import {IDataTable} from '.';

export interface IData {
  title: string;
  detail: IDetail[];
  isTable?: boolean,
 }

 interface IDetail {
  subtitle?: string;
  describe?: IDescrible[];
  items?: IDataItem[];
}
 interface IDescrible {
  list: string;
  listTable?: any;
  listItem?: IText[];
  listOtherItem?: listOtherItem[];
}

interface listOtherItem {
  statement: string;
  text: string;
}

interface IText {
  text: string;
}

interface IDataItem {
  content?: string | boolean;
  contentItems?: IContentItem[];
}

interface IContentItem {
  subcontent: string;
  subtable?:any;
  subcontentItems?: ISubcontentitem[];
}

interface ISubcontentitem {
  list: string;
  listItems?: IText[];
}

export const instruction: IData = {
  title: '一般体育说明', detail: [
    {
      subtitle: '概述',
      describe: [{list: '比规则与条款将适用于本公司所有的投注种类。会员们有责任确保您获知所有的规则与条款，我们保留随时修改条款的权利，并且会将修改的内容公布在本网站上，公布在网站公告上的信息可作为投注附加的规则与条款，若有任何差异或矛盾的地方，将以附加信息为准。本公司对此条款视为公平公正的，若您有任何意见成疑问，您可以联络我们的客服部，我们的客服团队将热诚协助每位客户，并确保能及时友善的解决您的问题。对于任何错误或争论，我们客服团队将竭力提供服务。所有的条款用于在会员与公司之间建立一般的原则。对产生的任何争议，希望通过该条款让双方都得到满意的解决方案。'}],
      items: [],
    },
    {
      subtitle: '一般体育规则',
      describe: [{list: '所有在本公司进行的投注都需要依照以下规则与条款处理。在个别体育项目里注明的规则将视为体育主要规则：'}],
      items: [
        {content: true, contentItems: [
          {subcontent: '所有投注项目的最高和最低投注额将由公司决定，如有任何更改无需提前通知'},
          {subcontent: '会员申请账户时需提供正确的个人信息，本公司对提供伪造或错误信息的账户将不负任何责任。'},
          {subcontent: '会员将全权负责账户提交的所有交易。在投注前请仔细检查选项，一旦投注提交成功后，将无法更改或取消。公司对会员自身原因造成的遗漏或重复投注不负任何责任。会员可以在“交易记录”中查看详情确保所有提交的注单已成功。'},
          {subcontent: '.在任何投诉中，如黑在公司的数据库中没有存储任何记录，公司将不接受也不认可任何会员提供的复印件或单据。'},
          {subcontent: '公司保留在任何时候关闭或冻结会员账号的权利'},
          {subcontent: '公司保留在任何时候暂停/中止会员对任何盘口进行投注的权利'},
          {subcontent: '公司保留对已预先知道赛果的投注作出取消的权利。如果由于“滚球现场”延迟而引起盘口的赔率错误，此期间的注单将视为无效'},
          {subcontent: '有关赛事的讯息(例:日期，时间，比分，统计，新闻，红卡，中场等等)仅供参考而已。公司对此讯息的准确性不负任何责任'},
          {subcontent: '如果赛事中断，没有在官方指定开赛时间内开始，则该赛事的所有投注，除已经有明确赛果的投注正常结算，其余投注将被视为无效目取消，公司取消该赛事所有注单的结果被视为最终决定，无需参考官方赛事裁判相关部门的决定。连串投注将会继续按照注单剩余赛事的赛果结算，该取消赛事的赔率将  会按照"1"计算'},
        ],
        },
      ],
    },
    {
      subtitle: '赛果与派彩',
      items: [
        {content: true, contentItems: [
          {subcontent: '.所有投注项目的最高和最低投注额将由公司决定，如有任何更改无需提前通知'},
          {subcontent: '会员申请账户时需提供正确的个人信息，本公司对提供伪造或错误信息的账户将不负任何责任。'},
          {subcontent: '会员将全权负责账户提交的所有交易。在投注前请仔细检查选项，一旦投注提交成功后，将无法更改或取消。公司对会员自身原因造成的遗漏或重复投注不负任何责任。会员可以在“交易记录”中查看详情确保所有提交的注单已成功。'},
          {subcontent: '在任何投诉中，如黑在公司的数据库中没有存储任何记录，公司将不接受也不认可任何会员提供的复印件或单据。'},
          {subcontent: '公司保留在任何时候关闭或冻结会员账号的权利'},
          {subcontent: '公司保留在任何时候暂停/中止会员对任何盘口进行投注的权利'},
          {subcontent: '公司保留对已预先知道赛果的投注作出取消的权利。如果由于“滚球现场”延迟而引起盘口的赔率错误，此期间的注单将视为无效'},
          {subcontent: '有关赛事的讯息(例:日期，时间，比分，统计，新闻，红卡，中场等等)仅供参考而已。公司对此讯息的准确性不负任何责任'},
        ],
        },
      ],
    },
  ],
};

export const pass:IData = {
  title: '连串过关/复式过关/组合过关', detail: [
    {subtitle: '一般规则', describe: [
      {list: '连串过关是指选择二个或更多的赛事在一个单一的注单中。每一个选择连串投注的赛事必须获胜此连串的注单才视为获胜。如果第一个注单是获胜的，投注获胜的注单会添加到第二个投注选项，直到连串过关中的所有投注获胜或到有一场失败为结束。某些连串过关是组合几个不同的连串在一个单一的连串注单中。例如：4串11是11个不同的连串投注。请参考"连串过关投注类型"选择查看更多的信息。'},
      {list: '例如：'},
      {list: '投注一个100元的3串1连串过关在以下的三场赛事：曼联@ 1.80、切尔西@ 1.50、阿森纳@ 1.66。如果所有的三场赛事都获胜，连串过关的盈利为448.20元（包括本金）。详细的计算方式您可以查看以下的信息：', listItem: [
        {text: '注单1：曼联1.80 * $100 = 返还$180.'},
        {text: '注单2：曼联1.80 * 切尔西1.50 * $100 = 返还$270.'},
        {text: '注单3：曼联1.80 * 切尔西1.50 * 阿森纳 1.66 * $100 = 返还$448.20.'},
      ]},
      {list: '连串过关注意事项：'},
    ], items: [
      {content: true, contentItems: [
        {subcontent: '本公司一个注单中最多的连串过关为10串。'},
        {subcontent: '不是所有的赛事都可以投注连串过关。如果您在投注列表中看到不可以组合二个不相关的赛事（可以查看以下的信息关于有关联的连串），那么就是其中一场并没有开出连串过关投注。'},
        {subcontent: '连串过关可以投注不同种类的赛事，以及不在同一天的比赛。'},
        {subcontent: '如遇赛事延期、比赛取消等情况产生，所有受影响的注单一律取消，连串注单该场赛事相关盘口赔率以（1）计算。'},
        {subcontent: '范例：会员投注3串1，其中各赛事盘口赔率为：曼联@ 1.80、切尔西@ 1.50、阿森纳@ 1.66。则该连串注单盘口总赔率为： 1.80 x 1.50 x 1.66 = @4.482。'},
        {subcontent: '如果切尔西赛事取消，该连串注单盘口总赔率为：1.80 x 1.0 x 1.66 = 2.988（因为切尔西赛事相关盘口赔率以（1）计算）。'},
      ]},
    ]},
    {subtitle: '连串过关中选项', describe: [
      {list: '连串过关投注，选择组合有关联的同一赛事或投注市场的结果会影响其他另一个投注市场，此注单是不接受的。'},
      {list: '例如:'},
      {list: '以下的2串1是不接受的，由于是同一场赛事:', listItem: [
        {text: '曼联获胜独赢盘口@1.80'},
        {text: '曼联2-0获胜，正确比分盘口@7.0'},
      ]},
      {list: '如果曼联2-0获胜，组合盘口为12.6。其实盘口应该为7.0，因为曼联2-0获胜，那么独赢盘口自然而然为获胜。'},
      {list: '连串过关投注，选择组合有关联的同一球队或球员，即使他们是不同的时间，同样是不接受例如一个结果会影响另一个结果。'},
      {list: '例如:', listItem: [
        {text: '曼联进入冠军杯决赛@6.0'},
        {text: '曼联赢得冠军杯冠军@10'},
        {text: '组合盘口@60.0'},
      ]},
      {list: '这个连串过关被视为第二个赛果会影响到第一个赛果。如果曼联获得冠军杯联赛冠军，那么曼联自然而然就进入冠军杯决赛。因此，盘口仅仅为10.0。'},
      {list: '本公司有权利取消有关联的连串过关投注。'},
    ], items: []},
    {subtitle: '连串过关', describe: [
      {list: '在连串过关中有任何的投注赛事无效或者打和（如以下的范例），此连串过关注单仍然有效，并且按照胜出的其余投注结算，范例如下：', listItem: [
        {text: '投注项1：切尔西（-0.5）-切尔西 赢。'},
        {text: '投注项2: 曼联（-1）-曼联赢 1-0.'},
        {text: '投注项 3: 阿森纳（-0.5）-阿森纳赢。'},
      ]},
      {list: '正如曼联是以（-1）的亚洲盘口1-0获胜，但在连串过关中的此赛事视为和。因此，当切尔西获胜连串阿森纳获胜过关，此连串过关将被视为切尔西以及阿森纳的2串，而非最初的3串。同时，打和的过关投注项目将会被自动以1计算。'},
      {list: '过关的计算范例如下'},
      {list: '范例1： 其中一个投注项为和:', listTable: {
        columns: [
          {
            title: '投注项',
            dataIndex: 'one',
            key: 'one',

          },
          {
            title: '让球',
            dataIndex: 'two',
            key: 'two',
          },
          {
            title: '赔率',
            key: 'three',
            dataIndex: 'three',
          },
          {
            title: '赛果',
            key: 'four',
            dataIndex: 'four',
          },
          {
            title: '结果',
            key: 'five',
            dataIndex: 'five',
          },
        ],
        tableData: [
          {
            key: '1',
            one: '切尔西',
            two: '(-0.5/1)',
            three: '1.85',
            four: '赢 2-0',
            five: '全赢',
          },
          {
            key: '2',
            one: '曼联',
            two: '(-1)',
            three: '1.95',
            four: '赢 1-0',
            five: '和',
          },
          {
            key: '3',
            one: '阿森纳',
            two: '(-1/1.5)',
            three: '2.05',
            four: '赢3-0',
            five: '全赢',
          },
        ],
      }},
      {list: '投注金额：$100 3串一'},
      {list: '计算方式如下'},
      {list: '$100 x 1.85 x 1 x 2.05 = $379.25,扣除本金$100=盈利**$279.25**', listItem: [
        {text: '切尔西(-0.5/1)：赢 - $100 x 1.85 =返还$185。此金额将会移至下个选项。'},
        {text: '曼联(-1): 和- $185 x 1 = $185. 此金额将会移至到下一选项。'},
        {text: '阿森纳(-1/1.5)：赢 - $185 x 2.05 =返还$379.25'},
        {text: '盈利：$379.25 – $100 = $279.25.'},
      ]},
      {list: '范例2： 其中一个投注项为赢半平半', listTable: {
        columns: [
          {
            title: '投注项',
            dataIndex: 'one',
            key: 'one',

          },
          {
            title: '让球',
            dataIndex: 'two',
            key: 'two',
          },
          {
            title: '赔率',
            key: 'three',
            dataIndex: 'three',
          },
          {
            title: '赛果',
            key: 'four',
            dataIndex: 'four',
          },
          {
            title: '结果',
            key: 'five',
            dataIndex: 'five',
          },
        ],
        tableData: [
          {
            key: '1',
            one: '切尔西',
            two: '(-0.5/1)',
            three: '1.85',
            four: '赢 1-0',
            five: '赢半 / 平半',
          },
          {
            key: '2',
            one: '曼联',
            two: '(-1)',
            three: '1.95',
            four: '赢 2-0',
            five: '全赢',
          },
          {
            key: '3',
            one: '阿森纳',
            two: '(-1/1.5)',
            three: '2.05',
            four: '赢3-0',
            five: '全赢',
          },
        ],
      }},
      {list: '连串投注：$100 3串一'},
      {list: '计算方式如下：'},
      {list: '$100 x [1 + 0.5 x 0.85] x 1.95 x 2.05 = $569.64， 扣除本金=赢$469.64', listItem: [
        {text: '切尔西(-0.5/1)：赢半/平半 – 此注单被分为两项，只有一半的投注盈利， 盈利的部分$50 x 1.85 = $92.50 打和部分$50 x 1 = 50返还是$92.50 + $50 = $142.50。 此金额将移至下个投注项'},
        {text: '曼联（-1）:盈利-142.50 x 1.95=$277.87，此金额将移至下个投注项'},
        {text: '阿森纳(-1/-1.5):盈利-277.87 x 2.05=$569.64'},
        {text: '总盈利:$569.64-$100=$469.64.'},
      ]},
      {list: '范例3：其中一个投注项为输半/平半', listTable: {
        columns: [
          {
            title: '投注项',
            dataIndex: 'one',
            key: 'one',

          },
          {
            title: '让球',
            dataIndex: 'two',
            key: 'two',
          },
          {
            title: '赔率',
            key: 'three',
            dataIndex: 'three',
          },
          {
            title: '赛果',
            key: 'four',
            dataIndex: 'four',
          },
          {
            title: '结果',
            key: 'five',
            dataIndex: 'five',
          },
        ],
        tableData: [
          {
            key: '1',
            one: '切尔西',
            two: '(-0.5/1)',
            three: '1.85',
            four: '赢2-0',
            five: '赢',
          },
          {
            key: '2',
            one: '曼联',
            two: '(-1)',
            three: '1.95',
            four: '赢 2-0',
            five: '全赢',
          },
          {
            key: '3',
            one: '阿森纳',
            two: '(-1/1.5)',
            three: '2.05',
            four: '赢 1-0',
            five: '输半 /平半',
          },
        ],
      }},
      {list: '连串投注：$100 3串一'},
      {list: '计算方式如下：'},
      {list: '$100 x 1.85 x 1.95 x 0.5 = $180.38, 扣除本金 $100 = 盈利$80.38', listItem: [
        {text: '切尔西 (-0.5/1): 赢 $100 x 1.85 = $185 = 返回 $185. 此金额将移至下个投注项'},
        {text: '曼联 (-1): 赢 $185 x 1.95 = $360.75. 此金额将移至下个投注项'},
        {text: '阿森纳 (-1/1.5): 输半/平半 – 投注额度将一分为二，其中一半为输。 $360.75 x 0.5 = $180.38. 输半: $180.38 平半: $180.38 x 1 = $180.38'},
        {text: '返回: $180.38'},
        {text: '总盈利: $180.38 – $100 = $80.38'},
      ]},
    ], items: []},
    {subtitle: '连串投注种类', describe: [
      {list: '本公司提供多种多样的连串过关投注。以下的表格可以清楚的查看每一种连串过关的排列组合。', listTable: {
        columns: [
          {
            title: '连串投注种类',
            dataIndex: 'one',
            key: 'one',

          },
          {
            title: '投注选项',
            dataIndex: 'two',
            key: 'two',
          },
          {
            title: '投注总数',
            key: 'three',
            dataIndex: 'three',
          },
          {
            title: '双式投注总数',
            key: 'four',
            dataIndex: 'four',
          },
          {
            title: '三式投注总数',
            key: 'five',
            dataIndex: 'five',
          },
          {
            title: '四串一投注总数',
            dataIndex: 'six',
            key: 'six',

          },
          {
            title: '五串一投注总数',
            dataIndex: 'seven',
            key: 'seven',
          },
          {
            title: '六串一投注总数',
            key: 'eight',
            dataIndex: 'eight',
          },
          {
            title: '七串一投注总数',
            key: 'nine',
            dataIndex: 'nine',
          },
          {
            title: '八串一投注总数',
            key: 'ten',
            dataIndex: 'ten',
          },
          {
            title: '九串一投注总数',
            key: 'eleven',
            dataIndex: 'eleven',
          },
          {
            title: '十串一投注总数',
            key: 'twelve',
            dataIndex: 'twelve',
          },
        ],
        tableData: [
          {
            key: '1',
            one: '2串1',
            two: '2',
            three: '1',
            four: '1',
            five: '',
            six: '',
            seven: '',
            eight: '',
            nine: '',
            ten: '',
            eleven: '',
            twelve: '',
          },
          {
            key: '2',
            one: '3串1',
            two: '3',
            three: '1',
            four: '',
            five: '1',
            six: '',
            seven: '',
            eight: '',
            nine: '',
            ten: '',
            eleven: '',
            twelve: '',
          },
          {
            key: '3',
            one: '4串1',
            two: '4',
            three: '1',
            four: '',
            five: '',
            six: '1',
            seven: '',
            eight: '',
            nine: '',
            ten: '',
            eleven: '',
            twelve: '',
          },
          {
            key: '4',
            one: '5串1',
            two: '5',
            three: '1',
            four: '',
            five: '',
            six: '',
            seven: '1',
            eight: '',
            nine: '',
            ten: '',
            eleven: '',
            twelve: '',
          },
          {
            key: '5',
            one: '6串1',
            two: '6',
            three: '1',
            four: '',
            five: '',
            six: '',
            seven: '',
            eight: '1',
            nine: '',
            ten: '',
            eleven: '',
            twelve: '',
          },
          {
            key: '6',
            one: '7串1',
            two: '7',
            three: '1',
            four: '',
            five: '',
            six: '',
            seven: '',
            eight: '',
            nine: '1',
            ten: '',
            eleven: '',
            twelve: '',
          },
          {
            key: '7',
            one: '8串1',
            two: '8',
            three: '1',
            four: '',
            five: '',
            six: '',
            seven: '',
            eight: '',
            nine: '',
            ten: '1',
            eleven: '',
            twelve: '',
          },
          {
            key: '8',
            one: '9串1',
            two: '9',
            three: '1',
            four: '',
            five: '',
            six: '',
            seven: '',
            eight: '',
            nine: '',
            ten: '',
            eleven: '1',
            twelve: '',
          },
          {
            key: '9',
            one: '10串1',
            two: '1',
            three: '',
            four: '',
            five: '',
            six: '',
            seven: '',
            eight: '',
            nine: '',
            ten: '',
            eleven: '1',
            twelve: '',
          },
          {
            key: '10',
            one: '3串4',
            two: '3',
            three: '4',
            four: '3',
            five: '1',
            six: '',
            seven: '',
            eight: '',
            nine: '',
            ten: '',
            eleven: '',
            twelve: '',
          },
          {
            key: '11',
            one: '4串11',
            two: '4',
            three: '11',
            four: '6',
            five: '4',
            six: '1',
            seven: '',
            eight: '',
            nine: '',
            ten: '',
            eleven: '',
            twelve: '',
          },
          {
            key: '12',
            one: '5串26',
            two: '5',
            three: '26',
            four: '10',
            five: '10',
            six: '5',
            seven: '1',
            eight: '',
            nine: '',
            ten: '',
            eleven: '',
            twelve: '',
          },
          {
            key: '13',
            one: '6串57',
            two: '6',
            three: '57',
            four: '15',
            five: '20',
            six: '15',
            seven: '6',
            eight: '1',
            nine: '',
            ten: '',
            eleven: '',
            twelve: '',
          },
          {
            key: '14',
            one: '7串120',
            two: '7',
            three: '120',
            four: '21',
            five: '35',
            six: '35',
            seven: '21',
            eight: '7',
            nine: '1',
            ten: '',
            eleven: '',
            twelve: '',
          },
          {
            key: '15',
            one: '8串247',
            two: '8',
            three: '247',
            four: '28',
            five: '56',
            six: '70',
            seven: '56',
            eight: '28',
            nine: '8',
            ten: '1',
            eleven: '',
            twelve: '',
          },
          {
            key: '16',
            one: '9串502',
            two: '9',
            three: '502',
            four: '36',
            five: '84',
            six: '126',
            seven: '126',
            eight: '84',
            nine: '36',
            ten: '9',
            eleven: '1',
            twelve: '',
          },
          {
            key: '17',
            one: '10串1013',
            two: '10',
            three: '1013',
            four: '45',
            five: '120',
            six: '210',
            seven: '252',
            eight: '210',
            nine: '120',
            ten: '45',
            eleven: '10',
            twelve: '1',
          },
        ],
      }},
      {list: '列表中连串过关的详细示意请查看以下信息：', listOtherItem: [
        {statement: '双式投注/ 2串1', text: '一个复式投注中包括2项不同的赛事。每个选择的赛事必须胜出方为赢。'},
        {statement: '三式投注/ 3串1', text: '一个三式投注中包括3项不同的赛事。每个选择的赛事必须胜出方为赢。'},
        {statement: '复式累计连串', text: '一个累计连串投注必须4个或更多不同的选项。所有的选项投注必须获胜方为赢。4个累计连串的投注可以参考4串1/4项复式投注；5个累计连串的投注可以参考5串1/5项复式投注，直到10串1/10项复式投注。'},
        {statement: '3串4投注', text: '3串4是由3个不同赛事组成的4个不同的投注，可以看作为4个分开的注单，它包括3个双式投注和1个三式投注。最少其中的2场赛事需要获胜，才会保证获得一些派彩。'},
        {statement: '4串11投注', text: '4串11是由4个不同赛事组成的11个不同的投注，可以看作为11个分开的注单，它包括6个双式投注，4个三式投注，1个4串1组成。最少其中的2场赛事需要获胜，才会保证获得一些派彩。'},
        {statement: '5串26投注', text: '5串26是由5个不同赛事组成的26个不同的投注，可以看作为26个分开的注单，它包括10个双式投注，10个三式投注，5个4串1投注以及1个5串1组成。最少其中的2场赛事需要获胜，才会保证获得一些派彩。'},
        {statement: '6串57投注', text: '6串57是由6个不同赛事组成的57个不同的投注，可以看作为57个分开的注单，它包括15个双式投注，20个三式投注，15个4串1投注，6个5串1投注以及一个6串1组成。最少其中的2场赛事需要获胜，才会保证获得一些派彩。'},
        {statement: '7串120投注', text: '7串120是由7个不同赛事组成的120个不同的投注，可以看作为120个分开的注单，它包括21个双式投注，35个三式投注，35个4串1，21个5串1，7个6串1以及1个7串1组成。最少其中的2场赛事需要获胜，才会保证获得一些派彩。'},
        {statement: '8串247投注', text: '8串247是由8个不同的赛事组成的247个不同的投注，可以看作为247个分开的注单，它包括28个双式投注，56个三式投注，70个4串1，56个5串1，28个6串1，8个7串1以及1个8串1组成。最少其中的2场赛事需要获胜，才会保证获得一些派彩。'},
        {statement: '9串502投注', text: ''},
        {statement: '', text: '9串502是由9个不同的赛事组成的502个不同的投注，可以看作为502个分开的注单。它包括36个双式投注，84个三式投注，126个4串1，126个5串1，84个6串1，36个7串1，9个8串1以及1个9串1组成。最少其中的2场赛事需要获胜，才会保证获得一些派彩。'},
        {statement: '10串1013投注', text: '10串1013是由10个不同的赛事组成的1013个不同的投注，可以看作为1013个分开的注单。它包括45个双式投注，120个三式投注，210个4串1，252个5串1，210个6串1，120个7串1，45个8串1，10个9串1以及1个10串1。最少其中的2场赛事需要获胜，才会保证获得一些派彩。'},
      ]},
    ], items: []},
  ]};

export const champion:IData = {
  title: '冠军', detail: [
    {subtitle: '冠军投注', describe: [
      {list: '在指定的冠军盘中，预测一场锦标赛, 联赛, 或者比赛的冠军。所选择的队伍或选手获得最终胜利视为符合派彩条件，包括：'},
    ], items: [
      {content: true, contentItems: [
        {subcontent: '联赛的最终结果，例如: 世界杯冠军或F1车手冠军。'},
        {subcontent: '在预赛中胜出，例如: 世界杯小组冠军。'},
        {subcontent: '在最后一场赛事中，例如: 能否出线，能否踢加时，能否踢点球。'},
        {subcontent: '比赛的最终结果，例如：F1赛事的个人冠军。'},
        {subcontent: '最高得分数。'},
        {subcontent: '最优秀的选手等。'},
      ]},
    ]},
    {subtitle: '一般规则', items: [
      {content: true, contentItems: [
        {subcontent: '联赛的派彩将以官方来源或相关体育权威机构判定的结果为准。'},
        {subcontent: '无论挑选的人或球队是否有参与，所有冠军投注都视为有效。'},
        {subcontent: '并列名次规则适用于冠军投注市场。'},
        {subcontent: '无论在什么情况下，如果名称使用“任何其他球员”或“任何其他球队” 将被视为代替无名称的参赛者。'},
        {subcontent: '如果体育项目有开出特殊规则，则其将取代一般适用规则。'},
        {subcontent: '冠军项目月份榜首榜尾结算规则: 此项目计算方式于该月第一日至最后一日（英国时间23: 59），如遇最后一日赛事延赛或赛事取消则不予计算，不影响该项目的计算。延迟或取消的赛事不予计算，如果由于人为错误或技术故障，赛果出来后盘口没有关闭，公司有权取消因此错误下注的注单。'},
        {subcontent: '足球冠军投注仅适用于常规赛季（除非另作说明）。整个赛季赛程结束后球队最终的排名来决定冠军。季后赛或随后查询(潜在扣分)各自联赛将不计算在最终赛果。'},
        {subcontent: '并列名次规则将不适用于以下情况：如果我们最终决定，可由排名准则决定排序的赛事（例如小组赛事）。'},
      ]},
    ]},
  ]};

export const football: IData = {
  title: '足球', detail: [
    {
      subtitle: '一般规则',
      items: [
        {content: true, contentItems: [
          {subcontent: '所有投注项目的最高和最低投注额将由公司决定，如有任何更改无需提前通知'},
          {subcontent: '会员申请账户时需提供正确的个人信息，本公司对提供伪造或错误信息的账户将不负任何责任。'},
          {subcontent: '会员将全权负责账户提交的所有交易。在投注前请仔细检查选项，一旦投注提交成功后，将无法更改或取消。公司对会员自身原因造成的遗漏或重复投注不负任何责任。会员可以在“交易记录”中查看详情确保所有提交的注单已成功。'},
          {subcontent: '在任何投诉中，如黑在公司的数据库中没有存储任何记录，公司将不接受也不认可任何会员提供的复印件或单据。'},
          {subcontent: '公司保留在任何时候关闭或冻结会员账号的权利'},
          {subcontent: '公司保留在任何时候暂停/中止会员对任何盘口进行投注的权利'},
          {subcontent: '公司保留对已预先知道赛果的投注作出取消的权利。如果由于“滚球现场”延迟而引起盘口的赔率错误，此期间的注单将视为无效'},
          {subcontent: '有关赛事的讯息(例:日期，时间，比分，统计，新闻，红卡，中场等等)仅供参考而已。公司对此讯息的准确性不负任何责任'},
          {subcontent: '如果赛事中断，没有在官方指定开赛时间内开始，则该赛事的所有投注，除已经有明确赛果的投注正常结算，其余投注将被视为无效目取消，公司取消该赛事所有注单的结果被视为最终决定，无需参考官方赛事裁判相关部门的决定。连串投注将会继续按照注单剩余赛事的赛果结算，该取消赛事的赔率将  会按照"1"计算'},
          {subcontent: '除非在个别玩法规则另有注明，乌龙球将予以计算在内。'},
          {subcontent: '如果比赛场地有变更（主客队调换），所有此注单将被取消。'},
          {subcontent: '对于国际赛事，只要变更的场地仍在同一个国家内，所有注单将保持有效。'},
          {subcontent: '对于国际赛事，只要变更的场地仍在联赛原定举办的国家内，所有注单将保持有效。'},
          {subcontent: '本公司保留权利取消任何因更换场地而可能对赛事结果有影响的注单。'},
          {subcontent: '若赛事的确切开赛时间不明（比如，由于电视直播时间安排的问题），要是在原本开赛时间的72小时之内，本平台保留调整该开赛时间的权利。'},
          {subcontent: '除非另有注明，对于特定的15分钟玩法，进球时间以确定得分的时间，即足球超过球门线的时间为准，角球时间以开出角球的时间为准，罚牌时间以官方裁判掏牌的时间为准。'},
        ]},
      ],
    },
    {subtitle: '主要市场',
      items: []},
    {
      subtitle: '让球盘',
      items: [
        {content: '一般规则',
          contentItems: [
            {subcontent: '预测哪一支球队在盘口指定的让球数在全场/半场/赛事某个时节赢得比赛。'},
            {subcontent: '“让球盘”则定义为在比赛正式开始前，一方球队已得到另一方让的虚拟分数，以领先的情况下开始比赛。'},
            {subcontent: '所有注单将按盘口开出的让球数在玩法的时节结束后结算。'},
            {subcontent: '让球队（优势球队）将给出让球，让球数将显示在赔率的左侧，让球队在盘面上也会以粗型字体显示'},
            {subcontent: '让球盘的玩法分为以下几种：', subcontentItems: [
              {
                list: 'a.整数让球也或称为让‘一球’（如：-1，-2，-3，等）',
              },
              {
                list: 'b.非整数让球也或称为‘半球’（如：-0.5，-1.5，-2.5，等）',
              },
              {
                list: 'c.混合以上让‘半球/一球’的方式（如：-0/0.5，-0.5/1，-1/1.5，等）',
              },
            ],
            },
            {subcontent: '根据盘口让球信息预测最终获得胜利的球队。'},
            {subcontent: '投注的结算皆以球赛所规定的完场时间90分钟为准。'},
            {subcontent: '如果赛事在90分钟结束前取消或中断，所有注单将会被视为无效。'},
          ]},
        {content: '全场让球赛果',
          contentItems: [
            {subcontent: '投注一场球赛经让球调整后的全场赛果是主胜、客胜或和局。'},
            {subcontent: '全场让球赛果是根据法定比赛时间的全场赛果为准，不包括加时赛或点球大战赛果。'},
            {subcontent: '较强球队会让球予较弱球队，胜负由正式赛果加上让球作调整决定， 让球数目为整数，例如一球，两球，三球等等。您可依照调整后的赛果，预测主队胜、和局或客队胜。'},
            {subcontent: '让球主队和客队在队名后有（-）或（+）符号。', subtable: {
              columns: [
                {
                  title: '云达不莱梅 (-1)',
                  dataIndex: 'one',
                  key: 'one',

                },
                {
                  title: '平局 (-1)',
                  dataIndex: 'two',
                  key: 'two',
                },
                {
                  title: '拜仁慕尼黑 (+1)',
                  key: 'three',
                  dataIndex: 'three',
                },
              ],
              tableData: [
                {
                  key: '1',
                  one: '(-) 表示让球的球队，而随后的数字表示让球数目，例如-1即让1球',
                  two: '(-) 表示主队让球，而随后的数字表示让球数目，例如-1即让1球',
                  three: '(+) 表示受让的球队，而随后的数字表示受让数目，例如+1即受让1球',
                },
              ],
            },
            subcontentItems: [
              {
                list: '据计算让球以后的赛果来判断胜平负，例如上图【云达不莱梅】让 1 球予【拜仁慕尼黑】， 全场赛果为 1:1，经过让球调整后的赛果只需将【拜仁慕尼黑】队加上一球，而【云达不莱梅】队赢的一球维持不变， 因此调整后赛果为1:2，故下注【拜仁慕尼黑】+1的投注为赢。',
              },
            ]},
            {subcontent: '我的注单与注单历史页面，赛事队伍信息处比分（非投注项比分），为投注时的比赛实时比分。'},
          ]},
        {content: '让球 - 上半场',
          contentItems: [
            {subcontent: '所有上半场的投注将以上半场45分钟其中包含伤停补时后的赛果结算。'},
            {subcontent: '如果赛事在上半场时节因任何理由取消或中断，所有上半场注单将被取消。'},
            {subcontent: '如果赛事在下半场或加时赛因任何理由取消或中断，所有上半场注单保持有效。'},
          ]},
        {content: '滚球让球',
          contentItems: [
            {subcontent: '所有注单将按照盘口开出让球信息，在相应投注类型结束后结算。'},
            {subcontent: '结算是以投注时到比赛/时节结束后的赛果做裁决。即是以赛事完场比分减去投注当时的比分。 上半场的滚球让球投注将以上半场结束后的赛果结算。'},
          ]},
        {content: '加时赛 - 让球',
          contentItems: [
            {subcontent: '所有注单将按照盘口开出让球信息，在30分钟加时赛结束后计算，包含补时。'},
            {subcontent: '如果赛事在加时赛结束前取消或中断，所有注单将会被视为无效。'},
          ]},
        {content: '加时赛 - 让球-上半场',
          contentItems: [
            {subcontent: '所有注单将按照盘口开出让球信息，在15分钟加时赛结束后计算，包含补时。'},
            {subcontent: '加时赛中如果赛事在上半场取消或中断，所有上半场注单将会被视为无效。'},
            {subcontent: '加时赛中如果赛事在下半场或补时阶段取消或中断，所有上半场注单将会被视为有效。'},
          ]},
        {content: '15 分钟进球数 （让球）',
          contentItems: [
            {subcontent: '根据盘口让球信息预测最终获得15分钟内比赛胜利的球队。'},
            {subcontent: '在每个15分钟开始，所有球队在开始此时段比赛都是0-0，之前的得分点是没有影响的。'},
            {subcontent: '所有的投注将以开始下个时节前的赛果结算。'},
            {subcontent: '如果赛事中断，所有当前15分钟时段的投注以及将要进行的下一个15分钟时段投注将视为无效，任何15分钟时段投注，如果该时段完整结束，注单将被视为有效。', subtable: {
              columns: [
                {
                  title: '15分钟-时段1',
                  dataIndex: 'one',
                  key: 'one',

                },
                {
                  title: '上半场开始-14分59秒',
                  dataIndex: 'two',
                  key: 'two',
                },
              ],
              tableData: [
                {
                  key: '1',
                  one: '15分钟-时段2',
                  two: '15分钟-29分59秒',
                },
                {
                  key: '2',
                  one: '15分钟-时段3',
                  two: '30分钟-半场',
                },
                {
                  key: '3',
                  one: '15分钟-时段4',
                  two: '下半场开始-59分59秒',
                },
                {
                  key: '4',
                  one: '15分钟-时段5',
                  two: '60分钟-74分59秒',
                },
                {
                  key: '5',
                  one: '15分钟-时段6',
                  two: '75分钟-全场',
                },
              ],
            }},
          ]},
      ],
    },
    {subtitle: '大小盘',
      items: [
        {content: '一般规则',
          contentItems: [
            {subcontent: '预测赛事总入球数将大于或小于在盘口指定的大/小盘球数。'},
            {subcontent: '如果赛事的总入球数多于盘口的大/小盘球数，则为大盘。如果少于盘口的大/小盘球数，则为小盘。'},
            {subcontent: '所有注单将按盘口开出的大/小盘球数在玩法的时节结束后结算。'},
            {subcontent: '大/小盘的玩法分为以下几种：', subcontentItems: [
              {list: 'a.大/小于‘一球’（如：2，3，4，等）'},
              {list: 'b.大/小于‘半球’（如：1.5，2.5，3.5，等）'},
              {list: 'c.混合以上‘半球/一球’的方式（如：1.5/2，2.5/3，3.5/4，等）'},
            ]},
            {subcontent: '如果赛事中断前已有明确结果并且之后没有任何显著会影响赛事结果的情况，大/小盘注单才会被结算。若遇到任何其他情况，注单将一律被取消。请参考以上范例：', subcontentItems: [
              {
                list: 'a.范例1：会员投注大于2.5球：',
                listItems: [
                  {text: '1）赛事在比分2-1时中断。'},
                  {text: '2）尽管赛事中断，但因结果已经明确并且若之后有任何潜在进球将对盘口结算裁决没有影响，所有此会员注单结算为赢。'},
                ],
              },
              {
                list: 'b.范例2：会员投注小于2.5球：',
                listItems: [
                  {text: '1）赛事在比分2-1时中断。'},
                  {text: '2）尽管赛事中断，但因结果已经明确并且若之后有任何潜在进球将对盘口结算裁决没有影响，所有此会员注单结算为输。'},
                ],
              },
              {
                list: 'c.范例3：会员投注大于3.5球：',
                listItems: [
                  {text: '1）赛事在比分2-1时中断。'},
                  {text: '2）由于赛事在未有明确的结果能裁决会员的注单前中断，此会员的注单将被取消。'},
                ],
              },
            ]},
          ]},
        {content: '进球: 大 / 小',
          contentItems: [
            {subcontent: '所有的投注将以全场90分钟的赛果结算。'},
            {subcontent: '如果比赛停止，取消或中断，所有投注将被视为无效，除非在赛事取消或中断前，结果已经明确。'},
          ]},
        {content: '进球: 大 / 小 - 上半场',
          contentItems: [
            {subcontent: '所有上半场的投注将以上半场45分钟的赛果结算。'},
            {subcontent: '如果赛事在上半场时节因任何理由取消或中断，所有上半场注单将被取消。除非在赛事取消或中断前，结果已经明确。'},
            {subcontent: '如果赛事在下半场或加时时段因任何理由取消或中断，所有上半场注单保持有效。'},
          ]},
        {content: '滚球大小盘',
          contentItems: [
            {subcontent: '结算是以双方球队在90分钟内的总进球数为依据。'},
          ]},
        {content: '加时赛 - 进球: 大 / 小',
          contentItems: [
            {subcontent: '两支球队开始加时赛的比分为0-0，之前赛果属于常规时间内入球不会计算在内。'},
            {subcontent: '所有的投注将以30分钟加时赛后结果结算，包括补时。'},
            {subcontent: '在加时赛结束前如果比赛停止，取消或中断，所有投注将被视为无效，除非在赛事取消或中断前，结果已经明确。'},
          ]},
        {content: '加时赛 - 进球: 大 / 小 - 上半场',
          contentItems: [
            {subcontent: '所有投注将会按照15分钟赛事结束后赛果为准，包含补时。'},
            {subcontent: '如果比赛在上半场停止，取消或者中断，所有上半场注单将被视为无效。'},
            {subcontent: '如果比赛在下半场或补时期间停止，取消或者中断，所有上半场注单将被视为有效。'},
          ]},
        {content: '球队进球数 - 大 / 小',
          contentItems: [
            {subcontent: '预测在特定的比赛有关期间内，其中一支球队的总入球数将大于或小于在盘口指定的大/小盘球数。'},
            {subcontent: '如果赛事的总入球数多于盘口的大/小盘球数，则为大盘。如果少于盘口的大/小盘球数，则为小盘。'},
            {subcontent: '如果赛事中断前已有明确结果并且之后没有任何显著会影响赛事结果的情况，注单才会被结算。若遇到任何其他情况，注单将一律被取消。'},
            {subcontent: '点球大战与乌龙球将不予计算。'},
          ]},
        {content: '15 分钟进球数 (大 / 小)',
          contentItems: [
            {subcontent: '预测赛事总入球数将大于或小于在盘口指定的大/小盘球数。'},
            {subcontent: '如果总进球数多于盘口的大/小盘牌数，则为大盘。如果少于盘口的大/小盘牌数，则为小盘。'},
            {subcontent: '在每个15分钟时开始，所有球队在开始此时节比赛都是0-0，之前的得分是没有影响的。'},
            {subcontent: '如果比赛被中断，所有将要进行的15分钟时段投注将被视为无效。任何15分钟时段投注，如果该时段中赛事进行完整，此注单将被视为有效。在15分钟时段中，如果赛事已有明确结果并且之后对赛事没有任何影响，总进球数大/小盘注单才会被结算。任何其他的情况，投注将被视为无效。', subtable: {
              columns: [
                {
                  title: '15分钟-时段1',
                  dataIndex: 'one',
                  key: 'one',

                },
                {
                  title: '上半场开始-14分59秒',
                  dataIndex: 'two',
                  key: 'two',
                },
              ],
              tableData: [
                {
                  key: '1',
                  one: '15分钟-时段2',
                  two: '15分钟-29分59秒',
                },
                {
                  key: '2',
                  one: '15分钟-时段3',
                  two: '30分钟-半场结束',
                },
                {
                  key: '3',
                  one: '15分钟-时段4',
                  two: '下半场开始-59分59秒',
                },
                {
                  key: '4',
                  one: '15分钟-时段5',
                  two: '60分钟-74分59秒',
                },
                {
                  key: '5',
                  one: '15分钟-时段6',
                  two: '75分钟-全场结束',
                },
              ],
            }},
          ]},
        {content: '加时赛 - 5 分钟进球数 (大 / 小)',
          contentItems: [
            {subcontent: '预测赛事总入球数将大于或小于在盘口指定的大/小盘球数。'},
            {subcontent: '如果总进球数多于盘口的大/小盘牌数，则为大盘。如果少于盘口的大/小盘牌数，则为小盘。'},
            {subcontent: '如果比赛被中断，所有将要进行的5分钟时段投注将被视为无效。任何5分钟时段投注，如果该时段中赛事进行完整，此注单将被视为有效。在5分钟时段中，如果赛事已有明确结果并且之后对赛事没有任何影响，总进球数大/小盘注单才会被结算。任何其他的情况，投注将被视为无效。', subtable: {
              columns: [
                {
                  title: '5分钟-时段1',
                  dataIndex: 'one',
                  key: 'one',

                },
                {
                  title: '上半场开始-04分59秒',
                  dataIndex: 'two',
                  key: 'two',
                },
              ],
              tableData: [
                {
                  key: '1',
                  one: '5分钟-时段2',
                  two: '05分钟-09分59秒',
                },
                {
                  key: '2',
                  one: '5分钟-时段3',
                  two: '10分钟-半场结束',
                },
                {
                  key: '3',
                  one: '5分钟-时段4',
                  two: '下半场开始-19分59秒',
                },
                {
                  key: '4',
                  one: '5分钟-时段5',
                  two: '20分钟-24分59秒',
                },
                {
                  key: '5',
                  one: '5分钟-时段6',
                  two: '25分钟-全场结束',
                },
              ],
            }},
          ]},
      ]},
    {
      subtitle: '1 X 2（独赢盘）',
      items: [
        {content: '一般规则', contentItems: [
          {subcontent: '预测哪一支球队将在比赛胜出。盘口提供两支球队和平局为投注选项。'},
          {subcontent: '投注将以0-0的比分作为计算基础（让球并不计算在内）。'},
        ]},
        {content: '独赢', contentItems: [
          {subcontent: '预测哪一支球队将在90分钟比赛胜出或赛事和局。'},
        ]},
        {content: '独赢 - 上半场', contentItems: [
          {subcontent: '所有上半场的投注将以上半场45分钟赛果结算。'},
        ]},
        {content: '滚球独赢', contentItems: [
          {subcontent: '预测滚球时，哪一支球队胜出。'},
          {subcontent: '投注的结算将以90分钟完场赛果为准。'},
          {subcontent: '以下为滚球独赢盘范例。', subtable: {
            columns: [
              {
                title: ' ',
                dataIndex: 'one',
                key: 'one',

              },
              {
                title: '目前得分',
                dataIndex: 'two',
                key: 'two',

              },
              {
                title: '赔率',
                dataIndex: 'three',
                key: 'three',
              },
            ],
            tableData: [
              {
                key: '1',
                one: '阿森纳（主）',
                two: '1',
                three: '1.61',
              },
              {
                key: '2',
                one: '曼联',
                two: '0',
                three: '6.0',
              },
              {
                key: '3',
                one: '和局',
                two: '',
                three: '3.8',
              },
            ],
          },
          subcontentItems: [
            {list: 'a.范例1：在赛事比分为阿森纳1-0曼联时，会员投注滚球独赢盘 – 阿森纳赢：', listItems: [
              {text: '1）完场赛果为阿森纳2-1曼联。'},
              {text: '2）因阿森纳在完场时胜出，所有投注阿森纳的注单结算为赢。'},
              {text: '3）所有在比分1-0时投注曼联或平局的注单将结算为输。'},
            ]},
            {list: 'b.范例2：在赛事比分为阿森纳1-0曼联时，会员投注滚球独赢盘 –曼联赢：', listItems: [
              {text: '1）完场赛果为阿森纳1-1曼联。'},
              {text: '2）因完场赛果为平局，所有投注曼联以及阿森纳的注单将结算为输。'},
              {text: '3）所有投注平局的注单将结算为赢。'},
            ]},
          ]},
          {subcontent: '加时赛则视为一场新的赛事并且会开出加时赛盘口。投注将按加时赛时节的结果做结算。'},
        ]},
        {content: '加时赛 - 独赢', contentItems: [
          {subcontent: '预测哪一支球队将会在30分钟内胜出，或赛事平局，包含补时。'},
          {subcontent: '如果比赛在加时赛结束前暂停，取消或中止，所有投注将被视为无效。'},
        ]},
        {content: '加时赛 - 独赢 - 上半场', contentItems: [
          {subcontent: '预测哪一支球队将会在15分钟内胜出，或赛事平局，包含补时。'},
          {subcontent: '如果赛事在加时赛上半场取消或中断，所有上半场注单将会被取消。'},
          {subcontent: '如果赛事在加时赛下半场取消或中断，所有上半场注单将被会视为有效。'},
        ]},
        {content: '15 分钟进球数 (独赢)', contentItems: [
          {subcontent: '预测在规定时段内哪一支球队将会获胜，赛事盘口将会提供两支球队，以及和局。'},
          {subcontent: '所有两支球队在每时段开始时比分将按照0-0计算，之前比分不计算在内。'},
          {subcontent: '如果赛事中断，所有当前15分钟时段的投注以及将要进行的下一个15分钟时段投注将视为无效，任何15分钟时段投注，如果该时段完整结束，注单将被视为有效。', subtable: {
            columns: [
              {
                title: '15分钟-时段1',
                dataIndex: 'one',
                key: 'one',

              },
              {
                title: '上半场开始-14分59秒',
                dataIndex: 'two',
                key: 'two',
              },
            ],
            tableData: [
              {
                key: '1',
                one: '15分钟-时段2',
                two: '15分钟-29分59秒',
              },
              {
                key: '2',
                one: '15分钟-时段3',
                two: '30分钟-半场',
              },
              {
                key: '3',
                one: '15分钟-时段4',
                two: '下半场开始-59分59秒',
              },
              {
                key: '4',
                one: '15分钟-时段5',
                two: '60分钟-74分59秒',
              },
              {
                key: '5',
                one: '15分钟-时段6',
                two: '75分钟-全场',
              },
            ],
          }},
        ]},
        {content: '剩余时间获胜', contentItems: [
          {subcontent: '预测哪一支球队将在剩余时间内比赛胜出，盘口提供选择“平局/和”。'},
          {subcontent: '投注的结算皆以球赛所规定的完成时间90分钟内赛果为准。'},
          {subcontent: '如果赛事在90分钟结束前取消或中断，所有注单将会被视为无效。'},
          {subcontent: '结算是以投注时到比赛/时节结束后的赛果做裁决。即是以赛事完场比分减去投注当时的比分。 上半场的剩余时节获胜投注将以上半场结束后的赛果结算。'},
        ]},
        {content: '进球数: 单 / 双', contentItems: [
          {subcontent: '预测90分钟内，赛事总入球对单或双。'},
          {subcontent: '若最终比分为：0-0，将会按照“双”来计算。'},
        ]},
        {content: '进球数: 单 / 双 - 上半场', contentItems: [
          {subcontent: '预测45分钟赛事的总入球数是单数或双数。'},
          {subcontent: '若最终比分为：0-0，将会按照“双”来计算。'},
        ]},
        {content: '加时赛 - 进球数: 单 / 双', contentItems: [
          {subcontent: '预测加时30分钟赛事的总入球数是单数或双数，包含补时。'},
          {subcontent: '若最终比分为：0-0，将会按照“双”来计算。'},
        ]},
        {content: '加时赛 - 进球数: 单 / 双 -上半场', contentItems: [
          {subcontent: '预测加时赛15分钟内的总进球数是单数或双数，包括补时。'},
          {subcontent: '若最终比分为：0-0，将会按照“双”来计算。'},
        ]},
        {content: '15 分钟进球数 (单 / 双)', contentItems: [
          {subcontent: '预测在规定时间内进球数是单或双。'},
          {subcontent: '所有两支球队在每时段开始时比分将按照0-0计算，之前比分不计算在内。'},
          {subcontent: '如果赛事中断，所有当前15分钟时段的投注以及将要进行的下一个15分钟时段投注将视为无效，任何15分钟时段投注，如果该时段完整结束，注单将被视为有效。', subtable: {
            columns: [
              {
                title: '15分钟-时段1',
                dataIndex: 'one',
                key: 'one',

              },
              {
                title: '上半场开始-14分59秒',
                dataIndex: 'two',
                key: 'two',
              },
            ],
            tableData: [
              {
                key: '1',
                one: '15分钟-时段2',
                two: '15分钟-29分59秒',
              },
              {
                key: '2',
                one: '15分钟-时段3',
                two: '30分钟-半场',
              },
              {
                key: '3',
                one: '15分钟-时段4',
                two: '下半场开始-59分59秒',
              },
              {
                key: '4',
                one: '15分钟-时段5',
                two: '60分钟-74分59秒',
              },
              {
                key: '5',
                one: '15分钟-时段6',
                two: '75分钟-全场',
              },
            ],
          }},
        ]},
        {content: '波胆', contentItems: [
          {subcontent: '预测一场特定赛事的全场准确比分。'},
          {subcontent: '全场波胆投注的结算根据90分钟完场比分做出裁决。'},
          {subcontent: '如果赛事取消，已有明确赛果或全场波胆投注在“其它比分”为仅有可能获胜的选项，投注将被视为有效；其余的投注则被视为无效，此是由于赛事无条件决定后面的进球不会影响赛事的结果。'},
        ]},
        {content: '波胆 - 上半场', contentItems: [
          {subcontent: '预测一场特定赛事半场的准确比分。'},
          {subcontent: '半场波胆投注是指投注上半场的比赛，投注的结算根据半场“45分钟”结束后的比分做出裁决。'},
          {subcontent: '如果赛事在上半场取消，已有明确赛果或所有半场波胆投注在“其它比分”为仅有可能获胜的选项，投注将被视为有效；其余的投注则被视为无效，此是由于赛事无条件决定后面的进球不会影响赛事的结果。'},
          {subcontent: '如果赛事在下半场取消，所有半场波胆的投注被视为有效。'},
        ]},
        {content: '反波胆', contentItems: [
          {subcontent: '预测90分钟内的全场赛果'},
          {subcontent: '投注的选项和最后的赛果不相符'},
        ]},
        {content: '反波胆 - 上半场', contentItems: [
          {subcontent: '预测上半场赛果'},
          {subcontent: '投注的选项和最后的上半场赛果不相符'},
        ]},
        {content: '反波胆 - 下半场', contentItems: [
          {subcontent: '预测下半场赛果'},
          {subcontent: '投注的选项和最后的下半场赛果不相符'},
        ]},
        {content: '双重机会', contentItems: [
          {subcontent: '在三种可能出现的赛果中选择两种进行投注; 主场赢或打平（1和X）, 客场赢或打平（2和X）或主场或客场赢（1和2）。'},
          {subcontent: '共有三种选择: 1 X, X 2, 1 2：', subcontentItems: [
            {list: 'a."1" 代表: 主场赢。'},
            {list: 'b."X" 代表: 平手。'},
            {list: 'c."2" 代表: 客场赢。'},
          ]},
          {subcontent: '如果比赛在中立场进行﹐列在盘面的上方球队则被视为主队。'},
        ]},
      ],
    },
    {
      subtitle: '进球集锦',
      items: [
        {content: '总进球数', contentItems: [
          {subcontent: '预测全场两队的总入球数。'},
          {subcontent: '全场总入球数注单结算是根据全场“90分钟”为准。'},
          {subcontent: '如果赛事中断，总入球数投注将仅结算当赛事进球7个或更多，这是由于任何后面的进球不会影响赛事结果。任何其他的情况，投注将被视为无效。'},
        ]},
        {content: '总进球数 - 上半场', contentItems: [
          {subcontent: '预测半场两队的总入球数。'},
          {subcontent: '半场总入球数注单仅限于上半场。注单结算是根据上半场“45分钟”为准。'},
          {subcontent: '如果赛事中断，总入球数投注将仅结算当赛事进球4个或更多，这是由于任何后面的进球不会影响赛事结果。任何其他的情况，投注将被视为无效。'},
        ]},
        {content: '进球区间', contentItems: [
          {subcontent: '预测在全场比赛（不包含加时赛、点球大战）中总进球的数量。'},
          {subcontent: '所有的投注以赛事官方90分钟为完场时间，包括伤停补时。'},
          {subcontent: '如果赛事中断，将以官方单位公布的最后赛果为准，其中包括赛事重新开始或指定的分数。'},
        ]},
        {content: '净胜分（4+）', contentItems: [
          {subcontent: '预测球队在全场比赛（不包含加时赛、点球大战）中的净胜球数。'},
          {subcontent: '投注的结算根据90分钟完场赛事比分的差别做裁决。'},
          {subcontent: '比赛结束为平局将根据比分“平局且进球”或者“无进球”进行结算。'},
        ]},
        {content: '点球大战-净胜分', contentItems: [
          {subcontent: '预测在点球大战中的获胜方以及净胜球数。'},
          {subcontent: '投注主队/客户净胜1球，表示预测主队/客队赢得点球大战，且主客队分差绝对值等于1'},
          {subcontent: '投注主队/客户净胜2球，表示预测主队/客队赢得点球大战，且主客队分差绝对值等于2'},
          {subcontent: '投注主队/客队净胜3+，表示预测主队/客队赢得点球大战，且主客队分差绝对值大于等于3'},
        ]},
        {content: '最先/最后进球球队', contentItems: [
          {subcontent: '在法定比赛90分钟内，预测最先或最后进球的球队。'},
          {subcontent: '乌龙球将予以计算为得分那方入球。比如: A队VS B队，B 队踢进一个乌龙球造成比分1-0，此球计为A队先进球。'},
          {subcontent: '如果赛事在有进球后中断，所有最先进球球队注单保持有效。'},
          {subcontent: '如果赛事中断，所有最后进球球队注单将被取消。'},
        ]},
        {content: '第（X）个进球（无进球退款）', contentItems: [
          {subcontent: '预测比赛中指定的第（X）个进球被哪支球队获得。'},
          {subcontent: '所有的投注以赛事官方90分钟为完场时间，包含伤停补时。'},
          {subcontent: '指定进球将提前提供一个或多个选择，例如，第二个进球或第二和第三个进球（各自独立的盘口）。'},
          {subcontent: '如果在指定的进球在发生之前比赛中断，该个进球的投注将被视为无效。所有比赛中断之前开出的进球将视为有效。'},
          {subcontent: '乌龙球将予以计算为得分那方入球。例：A队VS B队，如A 队踢进一个乌龙球，此球计为B队的分数。'},
          {subcontent: '如果指定的第（X）个进球均没有获得，那么该盘口的注单将会被退款。'},
        ]},
        {content: '第（X）个进球', contentItems: [
          {subcontent: '按盘口提供的队伍双方中，预测在90分钟完场时间内第（X）个进球被哪支球队获得或均不。'},
          {subcontent: '所有的投注以赛事官方90分钟为完场时间，包含伤停补时。'},
          {subcontent: '指定进球将提前提供一个或多个选择，例如，第二个进球或第二和第三个进球（各自独立的盘口）。'},
          {subcontent: '如果在指定的进球在发生之前比赛中断，该个进球的投注将被视为无效。所有比赛中断之前开出的进球将视为有效。'},
          {subcontent: '乌龙球将予以计算为得分那方入球。例：A队VS B队，如A 队踢进一个乌龙球，此球计为B队的分数。'},
          {subcontent: '如果指定的第（X）个进球均没有获得，那么该盘口的注单将会以“均不”的选项来进行结算。'},
        ]},
        {content: '谁会进球', contentItems: [
          {subcontent: '预测球队进球情况，结算依据仅限90分钟比赛，加时赛和点球大战不予计算在内。'},
        ]},
        {content: '双方球队进球- 上半场', contentItems: [
          {subcontent: '预测双方球队在第一个45分钟时间内是否进球。'},
          {subcontent: '如果赛事在上半场双方球队都有进球后中断，所有注单保持有效。'},
          {subcontent: '如果赛事在上半场双方球队没有进球前中断或延迟，所有注单将被取消。'},
          {subcontent: '乌龙球将予以计算为得分那方入球。'},
        ]},
        {content: '双方球队进球- 下半场', contentItems: [
          {subcontent: '预测双方球队在第二个45分钟时间内是否进球。'},
          {subcontent: '如果赛事在下半场双方球队都有进球后中断，所有注单保持有效。'},
          {subcontent: '如果赛事在下半场双方球队没有进球前中断或延迟，所有注单将被取消。'},
          {subcontent: '乌龙球将予以计算为得分那方入球。'},
        ]},
        {content: '零失球', contentItems: [
          {subcontent: '预测某个球队在90分钟的比赛中，没有任何失球。'},
          {subcontent: '选择投注球队不需要赢得比赛，例如：赛果 0-0，注单为赢。'},
        ]},
        {content: '零失球获胜', contentItems: [
          {subcontent: '预测您投注的球队在90分钟完场时间内没让敌方攻入任何一球且取得胜利。'},
          {subcontent: '零失球是指球队在赛事中没让敌方攻入任何一球，争取完美防守。'},
        ]},
        {content: '先进2球/3球的一方', contentItems: [
          {subcontent: '预测在90分钟完场时间内哪个球队先进2/3球。'},
          {subcontent: '如果赛事在一方球队已经进2/3球后中断，所有注单将保持有效。'},
        ]},
        {content: '最多进球的半场', contentItems: [
          {subcontent: '在赛事90分钟结束后，猜测哪个“45分钟”半场入球最多。'},
          {subcontent: '盘口提供两种投注选择，如上下半场入球数一样，注单将被视为无效。'},
          {subcontent: '选项可列为：', subcontentItems: [
            {list: 'a.上半场'},
            {list: 'b.下半场'},
          ]},
        ]},
        {content: '最多进球的半场 - 独赢', contentItems: [
          {subcontent: '预测在90分钟完场时间内哪个半场将会进最多球。'},
          {subcontent: '盘口提供三种投注选择，如上下半场入球数一样，投注“和”将会为赢。'},
          {subcontent: '选项可列为：', subcontentItems: [
            {list: 'a.上半场'},
            {list: 'b.下半场'},
            {list: 'c.平局'},
          ]},
        ]},
        {content: '双半场进球', contentItems: [
          {subcontent: '预测主队/客队在90分钟完场时间内是否在上下半场都至少进一球。'},
          {subcontent: '如果投注球队只有在一个半场有入球，或未入球，注单为输。'},
          {subcontent: '乌龙球将只会被计算在得分球队一方。'},
          {subcontent: '如果赛事在所投注的球队已在两个半场都进球后中断，所有投注此球队的注单将结算为赢。'},
          {subcontent: '如果赛事在下半场中断，并且所投注的球队并未在上半场进球，所有投注此球队的注单将结算为输。'},
          {subcontent: '如果上半场进球球队已经确认，而赛事在下半场中断，那么所有投注该球队注单将被视为有效。'},
        ]},
        {content: '首个进球方式', contentItems: [
          {subcontent: '预测首个进球的方式。'},
          {subcontent: '如果赛事在首个进球后中断，所有首个进球方式的注单将保持有效。'},
          {subcontent: '选项可列为：', subcontentItems: [
            {list: 'a.任意球：球必须是直接踢进的方式。间接行的任意球如果最后是罚球者本人踢进则计算在内。'},
            {list: 'b.点球：球必须是由罚球者本人直接踢进的方式。若遇到补射的情况，即使是罚球者本人踢进也将不计算在内。'},
            {list: 'c.乌龙球：球必须授予为乌龙球。'},
            {list: 'd.头球：进球者必须明确的用头进球。'},
            {list: 'e.射门：所有其他的进球方式。除了以上所列出的方式，所有其他进球的方式都包含在此方式。'},
            {list: 'f.没有进球：赛事没有进球。'},
          ]},
        ]},
        {content: '首个进球时间-3项', contentItems: [
          {subcontent: '预测在90分钟完场时间内首个进球时间，盘口提供无进球投注选项。'},
          {subcontent: '选项可列为：', subtable: {
            columns: [
              {
                title: '选项1',
                dataIndex: 'one',
                key: 'one',

              },
              {
                title: '小于等于26分钟',
                dataIndex: 'two',
                key: 'two',
              },
            ],
            tableData: [
              {
                key: '1',
                one: '选项 2',
                two: '大于或等于27分钟',
              },
              {
                key: '2',
                one: '选项 3',
                two: '没有进球',
              },
            ],
          }},
          {subcontent: '出于结算的用意，赛事的第一分钟是从1秒计算到59秒。第二分钟则是从1分钟计算到1分59秒，以此类推。'},
          {subcontent: '范例：如果投注首个进球时间的选项是‘赛事的第26分钟或之前’，而确实进球的时间为26分钟49秒，进球的范围属于‘第27分钟后’，因此投注将结算为输。'},
          {subcontent: '如果赛事在首个进球后中断，所有首个进球时间的注单将保持有效。'},
          {subcontent: '如果赛事在没有进球前中断，所有首个进球时间的注单将被取消。'},
          {subcontent: '乌龙球将予以计算在内。裁判判定无效的进球是将不予以计算在内。'},
        ]},
        {content: '首个进球时间', contentItems: [
          {subcontent: '预测在90分钟完场时间内首个进球时间。'},
          {subcontent: '选项可列为：', subtable: {
            columns: [
              {
                title: '15分钟-时段1',
                dataIndex: 'one',
                key: 'one',

              },
              {
                title: '上半场开始-14分59秒',
                dataIndex: 'two',
                key: 'two',
              },
            ],
            tableData: [
              {
                key: '1',
                one: '15分钟-时段2',
                two: '15分钟-29分59秒',
              },
              {
                key: '2',
                one: '15分钟-时段3',
                two: '30分钟-半场',
              },
              {
                key: '3',
                one: '15分钟-时段4',
                two: '下半场开始-59分59秒',
              },
              {
                key: '4',
                one: '15分钟-时段5',
                two: '60分钟-74分59秒',
              },
              {
                key: '5',
                one: '15分钟-时段6',
                two: '75分钟-全场',
              },
            ],
          }},
          {subcontent: '出于结算的用意，赛事的第一分钟是从1秒计算到59秒。第二分钟则是从1分钟计算到1分59秒，以此类推。'},
          {subcontent: '如果赛事在首个进球后中断，所有首个进球时间的注单将保持有效。'},
          {subcontent: '如果赛事在没有进球前中断，所有首个进球时间的注单将被取消。'},
          {subcontent: '乌龙球将予以计算在内。裁判判定无效的进球是将不予以计算在内。'},
        ]},
        {content: '乌龙球', contentItems: [
          {subcontent: '预测一场比赛中是否会有乌龙球。'},
          {subcontent: '根据双方球队上场球员是否踢进乌龙球，来进行结算。'},
          {subcontent: '如果比赛在有乌龙球之前中断，所有该盘口的投注将被视为无效。'},
        ]},
        {content: '上半场最后进球', contentItems: [
          {subcontent: '在第一个45分钟时间内，预测最后进球的球队。'},
          {subcontent: '乌龙球将予以计算为得分那方入球。比如: A队VS B队，B 队踢进一个乌龙球造成比分1-0，此球计为A队进球。'},
          {subcontent: '如果赛事中断，所有最后进球球队注单将被取消。'},
        ]},
      ],
    },
    {
      subtitle: '球员',
      items: [
        {content: '一般规则（第一/最后/任何时间进球得分）', contentItems: [
          {subcontent: '“其他”选项是指在官方“90分钟”比赛内没有标注的进球数（不包括乌龙球）。'},
          {subcontent: '\'没有进球\'的选项是指两队在官方“90分钟”内（即全场0-0）打入0球。'},
        ]},
        {content: '首个进球球员', contentItems: [
          {subcontent: '按照盘口提供的球员出场名单中，预测90分钟完场时间内首个进球的球员。'},
          {subcontent: '乌龙球不会计算为首个进球。如果首个进球为乌龙球，则该玩法所有注单判定为负。'},
          {subcontent: '如果赛事首个进球的球员并无提供该选项，则之前提供的所有选项都将判定为负。'},
          {subcontent: '如果投注的最先进球球员没有参与该场赛事或在第一个进球后才进场亦或者在没有射入第一个球就离场，注单也仍记为有效。'},
          {subcontent: '如果赛事中断，除已有明确赛果外，其余情况所有注单一律取消。'},
        ]},
        {content: '最后进球球员', contentItems: [
          {subcontent: '按照盘口提供的球员出场名单中，预测90分钟完场时间内最后进球球员。'},
          {subcontent: '乌龙球将不会被视为最后进球。如果出现乌龙球，下一个或之前的进球才被视为有效。'},
          {subcontent: '如果赛事最后的进球并无提供该选项，则之前提供的所有选项都将判定位负。'},
          {subcontent: '如果投注的最后进球球员在没有射入最后一个进球就被罚下场或被其他球员替代，注单将结算为负。'},
          {subcontent: '如果投注的最后进球球员均没有获得进球，该盘口的注单将会以“无进球”的选项来进行结算。'},
          {subcontent: '如果比赛被中断，所有投注最后进球球员的注单将被取消。'},
        ]},
        {content: '任何时间进球球员', contentItems: [
          {subcontent: '按盘口提供的球员出场名单中，预测在90分钟完场时间内哪位球员会进球。'},
          {subcontent: '如果投注的球员没有参与该场赛事，注单也将计算有效'},
          {subcontent: '如果赛事中断，除已有明确赛果外，其余情况所有注单一律取消。'},
          {subcontent: '乌龙球，加时赛进球和点球大战都不计于此玩法。'},
        ]},
        {content: '第（X）个进球球员', contentItems: [
          {subcontent: '按盘口提供的球员出场名单中，预测在90分钟完场时间内第（X）个进球哪位球员会获得。'},
          {subcontent: '所有的投注以赛事官方90分钟为完场时间，包含伤停补时。加时赛进球和点球大战都不计于此玩法。'},
          {subcontent: '该玩法会按照赛事进球的顺序为准。'},
          {subcontent: '如果赛事中断，除已有明确赛果外，其余情况所有注单一律取消。'},
          {subcontent: '如果指定的第（X）个进球均没有获得，该盘口的注单将会以“无进球”的选项来进行结算。'},
          {subcontent: '如果进球为乌龙球，所有该指定进球球员的注单都将会判负。'},
          {subcontent: '如果赛事指定进球并无提供该选项，则之前提供的所有选项都将判定为负。'},
        ]},
        {content: '平局退款', contentItems: [
          {subcontent: '预测哪一支球队获得最终胜利'},
          {subcontent: '投注的结算皆以球赛所规定的完成时间90分钟内赛果为准。'},
          {subcontent: '如果赛事在90分钟结束前取消或中断，所有注单将会被视为无效。'},
          {subcontent: '若赛果出现平局，投注将被返还。'},
        ]},
      ],
    },
    {
      subtitle: '特别',
      items: [
        {content: '开球球队', contentItems: [
          {subcontent: '预测在比赛先开球的球队。'},
          {subcontent: '如果赛事在开踢后中断，所有投注先开球球队的注单将保持有效。'},
        ]},
        {content: '胜出方法', contentItems: [
          {subcontent: '预测哪一支球队能在球赛中指定的时段内赢得比赛。'},
          {subcontent: '根据指定的球队能否在指定的时段内赢得比赛，来进行结算。时段可分为：“90分钟”，加时赛或点球大战。'},
        ]},
        {content: '晋级方法', contentItems: [
          {subcontent: '预测哪一支球队能在球赛中指定的时段内赢得比赛，从而晋级到联赛的下一阶段。'},
          {subcontent: '根据指定的球队能否在指定的时段内赢得比赛，来进行结算。时段可以选择：“90分钟”，加时赛或点球大战。'},
          {subcontent: '一场比赛的两个回合的总比分（包括客场进球规则）将计入“90分钟”结束的结算。'},
        ]},
        {content: '赢得所有半场', contentItems: [
          {subcontent: '预测选择的球队在90分钟完场时间内（不包括加时赛及点球赛）是否在上半场和下半场的进球数多于对手。'},
          {subcontent: '如果赛事中断，所有注单将被取消。'},
          {subcontent: '如果任何一个半场或上/下半场的结果是平局或没有进球，所有注单将结算为输。'},
        ]},
        {content: '赢得任一半场', contentItems: [
          {subcontent: '预测选择的球队在90分钟完场时间内（不包括加时赛及点球赛）是否在上/下半场的其中一个半场进球数多于对手。'},
          {subcontent: '如果赛事在下半场中断，但在上半场其中一方球队已经获胜，注单将保持有效。如果两支球队在上半场平局，注单将被取消。'},
          {subcontent: '如果赛事出现平局或上下半场均无进球，所有注单将视为输。如双方球队各赢半场，则投注两个球队注单为赢。'},
        ]},
        {content: '射正次数', contentItems: [
          {subcontent: '预测在90分钟完场时间内两个球队标射正次数。'},
          {subcontent: '注单的结算将根据官方赛果或赛事权威机构判定的结果为准。'},
        ]},
        {content: '上半场–第一个行动', contentItems: [
          {subcontent: '预测在45分钟完场时间内完成一系列的第一个行动。'},
          {subcontent: '选项有分为：任意球，球门球，界外球，越位，进球，罚牌和等等。'},
          {subcontent: '如果赛事在上半场中断，所有注单将被视为无效，除了第一个行动注单已有结果。如果赛事在下半场中断，所有上半场投注将会被视为有效。'},
          {subcontent: '全部的单子会依据赛事的官方数据结算。'},
        ]},
        {content: '下半场–第一个行动', contentItems: [
          {subcontent: '预测在第二段的45分钟完场时间内完成一系列的第一个行动。'},
          {subcontent: '选项有分为：任意球，球门球，界外球，越位，进球，罚牌和等等。'},
          {subcontent: '如果赛事在下半场中断，所有注单将被视为无效，除了第一个行动注单已有结果。'},
          {subcontent: '全部的单子会依据赛事的官方数据结算。'},
        ]},
        {content: '半场伤停补时时间预测', contentItems: [
          {subcontent: '预测半场结束伤停补时具体时间。'},
          {subcontent: '所有注单结算将会按照半场结束后第四裁判举牌补时的时间为准。'},
          {subcontent: '预测伤停补时时间，只计算在官方正常90分钟赛事内的补时，加时赛将不包含在内。'},
        ]},
        {content: '上半场伤停补时大/小', contentItems: [
          {subcontent: '预测上半场官方时间45分钟后的伤停补时时间。'},
          {subcontent: '如果补时总时间，多于盘口的大/小盘时间，则为大盘。如果少于盘口的大/小盘时间，则为小盘。'},
          {subcontent: '所有注单结算将会按照第四裁判举牌补时时间为准，在赛事正常45分钟结束后确定的补时时间。'},
          {subcontent: '如果赛事在官方时间45分钟之内中断，所有投注上半场伤停补时注单将会取消。'},
          {subcontent: '如果赛事是在上半场比赛确认结束后中断，所有投注上半场伤停补时将会被视为有效的。'},
        ]},
        {content: '下半场伤停补时大/小', contentItems: [
          {subcontent: '预测下半场的伤停补时时间。如果补时总时间，多于盘口的大/小盘时间，则为大盘。如果少于盘口的大/小盘时间，则为小盘。'},
          {subcontent: '如果补时总时间，多于盘口的大/小盘时间，则为大盘。如果少于盘口的大/小盘时间，则为小盘。'},
          {subcontent: '所有注单结算将会按照第四裁判举牌补时时间为准，在赛事正常90分钟结束后确定的补时时间。'},
          {subcontent: '如果赛事在官方时间90分钟之内中断，所有投注下半场伤停补时注单将会取消。'},
        ]},
        {content: '双半场总伤停补时—大/小', contentItems: [
          {subcontent: '预测上半场和下半场的伤停补时时间。'},
          {subcontent: '一旦赛事在官方时间90分钟完成，总伤停补时将会以上半场和下半场伤停补时之和为结果。'},
          {subcontent: '如果伤停补时时间多于盘口的大/小盘时间，则为大盘；如果少于盘口的大/小盘时间，则为小盘。'},
          {subcontent: '如果赛事在官方时间90分钟之内中断，所有投注双半场总伤停补时的注单将会取消。'},
        ]},
        {content: '5分钟第X个进球时分', contentItems: [
          {subcontent: '仅支持滚球中赛事，从可选择的投注项中预测下一个进球的时间段。'},
          {subcontent: '选项可列为：', subcontentItems: [
            {list: 'a. P1,P2…….P18 '},
            {list: 'b.无第{X}个进球'},
          ]},
          {subcontent: '每个选项都有注明分钟到秒。P1=比赛开始计算到4分59秒，以此类推（注：除时段P9和时段P18是300秒之外，其余的时段均为299秒）。'},
          {subcontent: '如果赛事中断，未经派彩的注单将被取消。'},
          {subcontent: '赛前已注明赛制或正常赛事90分钟内的点球与乌龙球计算在内，但不包含加时赛或点球大战的进球。'},
          {subcontent: '滚球盘不开放时段P1（开场~04分59秒）。'},
          {subcontent: '5分钟第X个进球时分玩法时段P10（下半场-49:59）投注项是指下半场开始到49:59。'},
          {subcontent: '滚球中第X进球时分玩法投注的是下一时段的投注项，例如：', subcontentItems: [
            {list: 'a.比赛进行到第10分钟时，投注项时段P3（10:00-14:59）将会关盘；'},
            {list: 'b. 比赛进行到第50分钟时，投注项时段P11（50:00-54:59）将会关盘。'},
          ], subtable: {
            columns: [
              {
                title: '时段',
                dataIndex: 'one',
                key: 'one',

              },
              {
                title: '时间',
                dataIndex: 'two',
                key: 'two',
              },
              {
                title: '时段',
                key: 'three',
                dataIndex: 'three',
              },
              {
                title: '时间',
                key: 'four',
                dataIndex: 'four',
              },
            ],
            tableData: [
              {
                key: '1',
                one: '5分钟~P1',
                two: '开场~04分59秒',
                three: '5分钟~P2',
                four: '5分钟-09分59秒',
              },
              {
                key: '2',
                one: '5分钟~P3',
                two: '10分钟-14分59秒',
                three: '5分钟~P4',
                four: '15分钟-19分59秒',
              },
              {
                key: '3',
                one: '5分钟~P5',
                two: '20分钟-24分59秒',
                three: '5分钟~P6',
                four: '25分钟-29分59秒',
              },
              {
                key: '4',
                one: '5分钟~P7',
                two: '30分钟-34分59秒',
                three: '5分钟~P8',
                four: '35分钟-39分59秒',
              },
              {
                key: '5',
                one: '5分钟~P9',
                two: '40分钟-45分00秒',
                three: '5分钟~P10',
                four: '下半场-49分59秒',
              },
              {
                key: '6',
                one: '5分钟~P11',
                two: '50分钟-54分59秒',
                three: '5分钟~P12',
                four: '55分钟-59分59秒',
              },
              {
                key: '7',
                one: '5分钟~P13',
                two: '60分钟-64分59秒',
                three: '5分钟~P14',
                four: '65分钟-69分59秒',
              },
              {
                key: '8',
                one: '5分钟~P15',
                two: '70分钟-74分59秒',
                three: '5分钟~P16',
                four: '75分钟-79分59秒',
              },
              {
                key: '9',
                one: '5分钟~P17',
                two: '80分钟-84分59秒',
                three: '5分钟~P18',
                four: '85分钟-90分00秒',
              },
              {
                key: '10',
                one: '无第 {X} 个进球',
                two: '',
                three: '',
                four: '',
              },
            ],
          }},
        ]},
        {content: '5分钟时段进球', contentItems: [
          {subcontent: '仅支持未开赛赛事，从可选择的投注项中预测赛事里任何进球的时间段。'},
          {subcontent: '选项可列为：', subcontentItems: [
            {list: 'a. P1,P2…….P18 '},
            {list: 'b.无进球(0-0)'},
            {list: 'c.绝杀球 （含上/下半场补时）'},
          ]},
          {subcontent: '每个选项都有注明分钟到秒。P1=比赛开始计算到4分59秒，以此类推（注：除时段P9和时段P18是300秒之外，其余的时段均为299秒）。'},
          {subcontent: '如果赛事中断，未经派彩的注单将被取消。'},
          {subcontent: '赛前已注明赛制或正常赛事90分钟内的点球与乌龙球计算在内，但不包含加时赛或点球大战的进球。'},
          {subcontent: '绝杀球（补时）定义为进球发生的时间为半/全场伤停补时的部分（即45:01+或是90:01+，且不包含准点进球）。', subtable: {
            columns: [
              {
                title: '时段',
                dataIndex: 'one',
                key: 'one',

              },
              {
                title: '时间',
                dataIndex: 'two',
                key: 'two',
              },
              {
                title: '时段',
                key: 'three',
                dataIndex: 'three',
              },
              {
                title: '时间',
                key: 'four',
                dataIndex: 'four',
              },
            ],
            tableData: [
              {
                key: '1',
                one: '5分钟~P1',
                two: '开场~04分59秒',
                three: '5分钟~P2',
                four: '5分钟-09分59秒',
              },
              {
                key: '2',
                one: '5分钟~P3',
                two: '10分钟-14分59秒',
                three: '5分钟~P4',
                four: '15分钟-19分59秒',
              },
              {
                key: '3',
                one: '5分钟~P5',
                two: '20分钟-24分59秒',
                three: '5分钟~P6',
                four: '25分钟-29分59秒',
              },
              {
                key: '4',
                one: '5分钟~P7',
                two: '30分钟-34分59秒',
                three: '5分钟~P8',
                four: '35分钟-39分59秒',
              },
              {
                key: '5',
                one: '5分钟~P9',
                two: '40分钟-45分00秒',
                three: '5分钟~P10',
                four: '下半场-49分59秒',
              },
              {
                key: '6',
                one: '5分钟~P11',
                two: '50分钟-54分59秒',
                three: '5分钟~P12',
                four: '55分钟-59分59秒',
              },
              {
                key: '7',
                one: '5分钟~P13',
                two: '60分钟-64分59秒',
                three: '5分钟~P14',
                four: '65分钟-69分59秒',
              },
              {
                key: '8',
                one: '5分钟~P15',
                two: '70分钟-74分59秒',
                three: '5分钟~P16',
                four: '75分钟-79分59秒',
              },
              {
                key: '9',
                one: '5分钟~P17',
                two: '80分钟-84分59秒',
                three: '5分钟~P18',
                four: '85分钟-90分00秒',
              },
              {
                key: '10',
                one: '无进球（0-0）',
                two: '',
                three: '绝杀球（含上/下半场补时）',
                four: '',
              },
            ],
          }},
        ]},
      ],
    },
    {
      subtitle: '角球',
      items: [
        {content: '角球：一般规则', contentItems: [
          {subcontent: '被裁定但并未实际执行的角球将不予以计算在内。'},
          {subcontent: '注单的结算将根据官方赛果或赛事权威机构判定的结果为准。'},
          {subcontent: '如果角球需重新进行(例如，在禁区内犯规)，重新进行的角球仍计为同一个角球。'},
        ]},
        {content: '角球: 让球', contentItems: [
          {subcontent: '预测在90分钟完场时间内哪一支球队在盘口指定的让球数获得最多角球。'},
          {subcontent: '所有注单将按盘口开出的让球数在玩法的时节结束后结算。'},
        ]},
        {content: '角球: 让球 - 上半场', contentItems: [
          {subcontent: '预测在45分钟完场时间内哪一支球队在盘口指定的让球数获得最多角球。'},
          {subcontent: '所有注单将按盘口开出的让球数在玩法的时节结束后结算。'},
        ]},
        {content: '角球: 大/小', contentItems: [
          {subcontent: '预测在90分钟后完成时间内（包括伤停补时）总获得的角球将大于或小于在盘口指定的大/小盘球数。'},
          {subcontent: '如果赛事获得的总角球数多于盘口的大/小盘球数，则为大盘。如果少于盘口的大/小盘球数，则为小盘。'},
          {subcontent: '如果赛事中断前已有明确结果并且之后没有任何显著会影响投注结果的情况，角球的大/小盘注单才会被结算。若遇到任何其他情况，注单将一律被取消。'},
        ]},
        {content: '角球: 大 / 小 - 上半场', contentItems: [
          {subcontent: '预测在45分钟后完成时间内总获得的角球将大于或小于在盘口指定的大/小盘球数。'},
          {subcontent: '如果赛事获得的总角球数多于盘口的大/小盘球数，则为大盘。如果少于盘口的大/小盘球数，则为小盘。'},
          {subcontent: '如果赛事在上半场中断，所有注单将被视为无效，除非赛事已有明确结果并且之后角球对赛事没有任何影响。'},
          {subcontent: '如果赛事在下半场中断，所有投注上半场角球大/小盘将会被视为有效。'},
        ]},
        {content: '角球: 独赢', contentItems: [
          {subcontent: '预测哪一支球队将在90分钟比赛内获得更多角球数，盘口提供两支球队和平局为投注选项。'},
          {subcontent: '如果赛事中断前已有明确结果并且之后角球对赛事没有任何影响，总角球数独赢盘注单将会被结算。若遇到任何其他情况，注单将一律被取消。'},
        ]},
        {content: '角球：独赢 - 上半场', contentItems: [
          {subcontent: '预测哪一支球队将在45分钟比赛内获得更多角球数，盘口提供两支球队和平局为投注选项。'},
          {subcontent: '如果赛事在上半场中断，所有投注上半场角球独赢的注单将被视为无效。'},
          {subcontent: '如果赛事在下半场中断，所有投注上半场角球独赢的注单将会被视为有效。'},
        ]},
        {content: '角球: 单 / 双', contentItems: [
          {subcontent: '预测90分钟内赛事的总角球数是单数或双数。'},
          {subcontent: '若比赛没有角球，结果为0，投注‘双’注单将会盈利。'},
          {subcontent: '如果赛事在上半场中断，所有注单将被视为无效，除非赛事已有明确结果并且之后角球对赛事没有任何影响。'},
        ]},
        {content: '角球: 单 / 双 - 上半场', contentItems: [
          {subcontent: '预测45分钟内赛事的总角球数是单数或双数。'},
          {subcontent: '如果赛事在上半场中断，所有注单将被视为无效，除非赛事已有明确结果并且之后角球对赛事没有任何影响。'},
          {subcontent: '如果赛事在下半场中断，所有投注上半场角球单/双盘将会被视为有效。'},
        ]},
        {content: '最先/最后角球', contentItems: [
          {subcontent: '预测在90分钟完场时间内，第一或最后获得角球的球队。'},
          {subcontent: '如果赛事在获得第一个角球后中断，所有第一个角球的注单将保持有效。'},
          {subcontent: '如果赛事中断，所有最后一个角球的注单将被取消。'},
          {subcontent: '如果赛事并没有获得角球，所有第一和最后一个角球的注单将被取消。'},
        ]},
        {content: '最多角球的半场', contentItems: [
          {subcontent: '预测在90分钟完场时间内哪个半场将会获得最多角球。'},
          {subcontent: '如果赛事中断前已有明确结果并且之后没有任何显著会影响赛事结果的情况，注单才会被结算。若遇到任何其他情况，注单将一律被取消。'},
        ]},
        {content: '角球 - 第（X）个角球', contentItems: [
          {subcontent: '预测哪支球队在90分钟完场时间内将被判罚指定的角球。'},
          {subcontent: '指定角球将提前提供一个或多个选择，例如，第四个角球或第四和第五个角球（各自独立的盘口）。'},
          {subcontent: '如果在指定的角球被开出之前比赛中断，该个角球的投注将被视为无效。所有比赛中断之前开出的角球将视为有效。'},
          {subcontent: '“均不”的选项是指两队在指定的角球个数中没有被判罚该指定个数来进行结算。'},
        ]},
        {content: '首个角球时间', contentItems: [
          {subcontent: '预测获得首个角球的时间。'},
          {subcontent: '选项可列为：', subcontentItems: [
            {list: 'a.赛事的第8分钟或之前。'},
            {list: 'b.第9分钟后。'},
          ]},
          {subcontent: '出于结算的用意，赛事的第一分钟是从1秒计算到59秒。第二分钟则是从1分钟计算到1分59秒，以此类推。'},
          {subcontent: '范例：如果投注首个角球时间的选项是‘赛事的第8分钟或之前’，而确实踢角球的时间为8分钟49秒，踢角球时间的范围属于‘第9分钟后’，因此投注将结算为输。'},
          {subcontent: '如果赛事在获得第一个角球后中断，所有首个角球时间的注单将保持有效。'},
          {subcontent: '如果赛事在没有获得角球前中断，所有首个角球时间的注单将被取消。'},
          {subcontent: '如果在90分钟完场时间内并未获得角球，所有首个角球时间的注单将被取消。'},
          {subcontent: '如果首个角球需重新进行，那首个角球时间将以重新进行的角球时间为准。'},
        ]},
        {content: '15分钟角球数', contentItems: [
          {subcontent: '依照以上主要市场陈列的15分钟规则，预测哪队将在让球，独赢，大小或单双盘口取得胜利。'},
          {subcontent: '角球时间以开出角球的时间为准。'},
        ]},
        {content: '角球 - 双重机会', contentItems: [
          {subcontent: '在三种可能出现的赛果中选择两种进行投注; 主场赢或打平（1和X）,客场赢或打平（2和X）或主场或客场赢（1和2）。'},
          {subcontent: '共有三种选择: 1 X, X 2, 1 2：', subcontentItems: [
            {list: 'a."1" 代表: 主场赢。'},
            {list: 'b."X" 代表: 平手。'},
            {list: 'c."2" 代表: 客场赢。'},
          ]},
        ]},
        {content: '角球: 波胆', contentItems: [
          {subcontent: '预测一场特定赛事的角球准确比分。'},
          {subcontent: '角球波胆投注的结算根据90分钟完场比分做出裁决。'},
          {subcontent: '如果赛事中断前已有明确结果并且之后角球对赛事没有任何影响，角球波胆注单将会被结算。若遇到任何其他情况，注单将一律被取消。'},
        ]},
        {content: '角球: 大小盘三项', contentItems: [
          {subcontent: '预测在90分钟后完成时间内（包括伤停补时）总获得的角球将大于、小于或等于在盘口指定的大/小盘三项球数。'},
          {subcontent: '如果赛事获得的总角球数多于盘口的大/小盘三项球数，则为大盘。如果少于盘口的大/小盘三项球数，则为小盘。如果等于盘口的大/小盘三项球数，则为相等。'},
          {subcontent: '如果赛事中断前已有明确结果并且之后没有任何显著会影响投注结果的情况，角球的大/小盘三项注单才会被结算。若遇到任何其他情况，注单将一律被取消。'},
        ]},
        {content: '上半场最后角球', contentItems: [
          {subcontent: '预测在第一个45分钟时间内，最后获得角球的球队。'},
          {subcontent: '如果赛事中断，所有上半场最后角球的注单将被取消。'},
          {subcontent: '如果赛事并没有获得角球，所有上半场最后角球的注单将被取消'},
        ]},
      ],
    },
    {subtitle: '牌/卡', items: [
      {content: '罚牌：一般规则', contentItems: [
        {subcontent: '针对非球员（例如：教练，没有比赛中替补出场的替补球员，管理人员等等）出示的任何罚牌将不计算在内。'},
        {subcontent: '黄卡将占1分，红卡占2分。如果球员获发两张黄卡，此球员所获发的总罚牌数将计算为黄卡占1分以及红卡占2分，总分三分（第二张黄牌不被计算在内，单场赛事每个球员最高可计3分）。'},
        {subcontent: '注单的结算将根据官方赛果或赛事权威机构判定的结果为准。'},
      ]},
      {content: '罚牌数: 让球', contentItems: [
        {subcontent: '预测在90分钟完场时间内哪一支球队根据盘口让牌信息获发最多罚牌。'},
        {subcontent: '所有注单将按盘口开出让牌信息，在相应投注类型结束后结算。'},
      ]},
      {content: '罚牌数: 让球 - 上半场', contentItems: [
        {subcontent: '预测在45分钟完场时间内哪一支球队在盘口指定的让球数获发最多罚牌。'},
        {subcontent: '所有注单将按盘口开出的让球数在玩法的时节结束后结算。'},
      ]},
      {content: '罚牌数: 大 / 小', contentItems: [
        {subcontent: '预测在90分钟比赛结束后总出示的罚牌数将大于或小于在盘口指定的大/小盘牌数。'},
        {subcontent: '如果出示的总罚牌数多于盘口的大/小盘牌数，则为大盘。如果少于盘口的大/小盘牌数，则为小盘。'},
        {subcontent: '如果赛事中断前已有明确结果并且之后没有任何显著会影响投注结果的情况，总罚牌的大/小盘注单才会被结算。若遇到任何其他情况，注单将一律被取消。'},
      ]},
      {content: '罚牌数: 大 / 小 - 上半场', contentItems: [
        {subcontent: '预测在半场“45分钟”比赛结束后总出示的罚牌将大于或小于在盘口指定的大/小盘牌数。'},
        {subcontent: '如果出示的总罚牌数多于盘口的大/小盘牌数，则为大盘。如果少于盘口的大/小盘牌数，则为小盘。'},
        {subcontent: '如果赛事在上半场中断，所有注单将会被取消，除非赛事已有明确结果并且之后罚牌对赛事没有任何影响。'},
        {subcontent: '如果赛事在下半场中断，那么所有投注上半场注单均视为有效。'},
      ]},
      {content: '罚牌数: 独赢', contentItems: [
        {subcontent: '预测哪一支球队将在90分钟比赛内获得最多罚牌，盘口提供两支球队和平局为投注选项。'},
        {subcontent: '如果赛事中断，所有注单将会被取消，除非赛事已有明确结果并且之后罚牌对赛事没有任何影响。'},
      ]},
      {content: '罚牌数: 独赢 - 上半场', contentItems: [
        {subcontent: '预测哪一支球队将在45分钟比赛内获得最多罚牌，盘口提供两支球队和平局为投注选项。'},
        {subcontent: '如果赛事在上半场中断，所有注单将会被取消，除非赛事已有明确结果并且之后罚牌对赛事没有任何影响。'},
        {subcontent: '如果赛事在下半场中断，那么所有投注上半场注单均视为有效。'},
      ]},
      {content: '罚牌数: 单 / 双', contentItems: [
        {subcontent: '预测90分钟内赛事的总罚牌数是单数或双数。'},
        {subcontent: '如果赛事中断，所有注单将会被取消，除非赛事已有明确结果并且之后罚牌对赛事没有任何影响。'},
        {subcontent: '如无红、黄牌出现，即“0”，此局可视为平局。'},
      ]},
      {content: '罚牌数: 单 / 双 - 上半场', contentItems: [
        {subcontent: '预测45分钟内赛事的总罚牌数是单数或双数。'},
        {subcontent: '如果赛事在上半场中断，所有注单将会被取消，除非赛事已有明确结果并且之后罚牌对赛事没有任何影响。'},
        {subcontent: '如果赛事在下半场中断，那么所有投注上半场注单均视为有效。'},
        {subcontent: '如无红、黄牌出现，即“0”，此局可视为平局。'},
      ]},
      {content: '第一张/最后一张罚牌', contentItems: [
        {subcontent: '预测在90分钟完场时间内主队或客队里的球员是否会收到首个或最后一个罚牌（黄卡或红卡）。'},
        {subcontent: '如果两位或以上球员因一个事件获发罚牌，首先被裁判员出示黄卡或红卡的球员，将被视为"优胜者"为注单进行结算。'},
        {subcontent: '针对非球员（例如：教练，没有比赛中替补出场的替补球员，管理人员等等）出示的任何罚牌将不计算在内。'},
        {subcontent: '如果赛事在出示首个罚牌后中断，所有首个罚牌的注单将保持有效。'},
        {subcontent: '如果赛事在出示首个罚牌后中断，所有最后一个罚牌的注单将被取消。'},
        {subcontent: '如果赛事在没有出示任何罚牌前中断，所有首个和最后一个罚牌的注单将被取消。'},
        {subcontent: '如果在90分钟完场时间内并未出示任何罚牌，所有首个和最后一个罚牌的注单将被取消。'},
      ]},
      {content: '罚牌 – 第（X）张罚牌', contentItems: [
        {subcontent: '预测哪支球队在90分钟完场时间内将被判罚指定的罚牌。'},
        {subcontent: '指定罚牌将提前提供一张或多张选择，例如，第四张罚牌或第四和第五张罚牌（各自独立的盘口）。'},
        {subcontent: '如果在指定的罚牌被记录之前比赛中断，该张罚牌的投注将被视为无效。所有比赛中断之前记录的罚牌将视为有效。'},
        {subcontent: '“均不”的选项是指两队在指定的罚牌张数中没有被判罚该指定张数来进行结算。'},
      ]},
      {content: '罚牌最多的球队', contentItems: [
        {subcontent: '预测哪一支球队将由获收的罚牌累积最多分数。'},
        {subcontent: '注单将按照90分钟完场赛事时间内所获收的黄卡和红卡累积最高分数的球队做结算。'},
        {subcontent: '选项可列为：', subcontentItems: [
          {list: 'a.球队A'},
          {list: 'b.球队B'},
          {list: 'c.平局'},
        ]},
      ]},
      {content: '第一张罚牌时间', contentItems: [
        {subcontent: '预测出示首个罚牌的时间。'},
        {subcontent: '选项可列为：', subcontentItems: [
          {list: 'a.赛事的第8分钟或之前。'},
          {list: 'b.第9分钟后。'},
        ]},
        {subcontent: '出于结算的用意，赛事的第一分钟是从1秒计算到59秒。第二分钟则是从1分钟计算到1分59秒，以此类推。'},
        {subcontent: '针对非球员（例如：教练，没有比赛中替补出场的替补球员，管理人员等等）出示的任何罚牌将不计算在内。'},
        {subcontent: '如果赛事在出示首个罚牌后中断，所有第一张罚牌时间的注单将保持有效。'},
        {subcontent: '如果赛事在没有出示任何罚牌前中断，所有第一张罚牌时间的注单将被取消。'},
        {subcontent: '如果在90分钟完场时间内并未出示任何罚牌，所有第一张罚牌时间的注单将被取消。'},
      ]},
      {content: '红卡（球员）', contentItems: [
        {subcontent: '预测在90分钟完场时间内是否会出示红卡。'},
        {subcontent: '针对非球员（例如：教练，没有比赛中替补出场的替补球员，管理人员等等）出示的任何罚牌将不计算在内。'},
        {subcontent: '如果赛事在出示一个红卡后中断, 所有是否出示红卡的注单将保持有效。'},
        {subcontent: '如果赛事在没有红卡出示前中断， 所有是否出示红卡的注单将被取消。'},
      ]},
      {content: '15分钟罚牌数', contentItems: [
        {subcontent: '依照以上主要市场陈列的15分钟规则，预测哪队将在让球，独赢，大小或单双盘口取得胜利。'},
      ]},
      {content: '罚牌 - 双重机会', contentItems: [
        {subcontent: '在三种可能出现的赛果中选择两种进行投注; 主场赢或打平（1和X）, 客场赢或打平（2和X）或主场或客场赢（1和2）。'},
        {subcontent: '共有三种选择: 1 X, X 2, 1 2：', subcontentItems: [
          {list: 'a."1" 代表: 主场赢。'},
          {list: 'b."X" 代表: 平手。'},
          {list: 'c."2" 代表: 客场赢。'},
        ]},
      ]},
      {content: '上半场罚牌数-双重机会', contentItems: [
        {subcontent: '在第一个45分钟时间内，三种可能出现的赛果中选择两种进行投注; 主场赢或打平（1和X）, 客场赢或打平（2和X）或主场或客场赢（1和2）。'},
        {subcontent: '共有三种选择: 1 X, X 2, 1 2：', subcontentItems: [
          {list: 'a."1" 代表: 主场赢。'},
          {list: 'b."X" 代表: 平手。'},
          {list: 'c."2" 代表: 客场赢。'},
        ]},
      ]},
      {content: '全场最后得牌', contentItems: [
        {subcontent: '预测在90分钟完场时间内收到的最后一个罚牌（黄卡或红卡），是主队还是客队。'},
        {subcontent: '如果两位或以上球员因一个事件获发罚牌，最后被裁判员出示黄卡或红卡的球队，将被视为"优胜者"为注单进行结算。'},
        {subcontent: '针对非球员（例如：教练，没有比赛中替补出场的替补球员，管理人员等等）出示的任何罚牌将不计算在内。'},
        {subcontent: '如果赛事在出示首个罚牌后中断，所有最后一个罚牌的注单将被取消。'},
        {subcontent: '如果赛事在没有出示任何罚牌前中断，所有最后一个罚牌的注单将被取消。'},
        {subcontent: '如果在90分钟完场时间内并未出示任何罚牌，所有最后一个罚牌的注单将被取消。'},
      ]},
      {content: '上半场最后得牌', contentItems: [
        {subcontent: '预测在第一个45分钟时间内主队或客队是否会收到最后一个罚牌（黄卡或红卡）。'},
        {subcontent: '如果两位或以上球员因一个事件获发罚牌，最后被裁判员出示黄卡或红卡的球队，将被视为"优胜者"为注单进行结算。'},
        {subcontent: '针对非球员（例如：教练，没有比赛中替补出场的替补球员，管理人员等等）出示的任何罚牌将不计算在内。'},
        {subcontent: '如果赛事在出示首个罚牌后中断，所有最后一个罚牌的注单将被取消。'},
        {subcontent: '如果赛事在没有出示任何罚牌前中断，所有最后一个罚牌的注单将被取消。'},
        {subcontent: '如果在第一个45分钟时间内并未出示任何罚牌，所有最后一个罚牌的注单将被取消。'},
      ]},
    ]},
    {subtitle: '任意球', items: [
      {content: '最先/最后球门球', contentItems: [
        {subcontent: '预测在90分钟完场时间内哪个球队会发出第一或最后一个任意球。'},
        {subcontent: '如果赛事在发出第一个任意球后中断，所有第一个任意球的注单将保持有效。'},
        {subcontent: '如果赛事在发出第一个任意球后中断，所有最后一个任意球的注单将被取消。'},
        {subcontent: '如果赛事在没有发出任何任意球前中断，所有第一个和最后一个任意球的注单将被取消。'},
        {subcontent: '如果在90分钟完场时间内并未发出任何任意球，所有第一个和最后一个任意球的注单将被取消。'},
      ]},
    ]},
    {subtitle: '射门', items: [
      {content: '最先/最后球门球', contentItems: [
        {subcontent: '预测在90分钟完场时间内哪个球队会发出第一或最后一个球门球。'},
        {subcontent: '如果赛事在发出第一个球门球后中断，所有第一个球门球的注单将保持有效。'},
        {subcontent: '如果赛事在发出第一个球门球后中断，所有最后一个球门球的注单将被取消。'},
        {subcontent: '如果赛事在没有发出任何球门球前中断，所有第一个和最后一个球门球的注单将被取消。'},
        {subcontent: '如果在90分钟完场时间内并未发出任何球门球，所有第一个和最后一个球门球的注单将被取消。'},
      ]},
    ]},
    {subtitle: '界外球', items: [
      {content: '最先/最后界外球', contentItems: [
        {subcontent: '预测在90分钟完场时间内哪个球队会发出第一或最后一个界外球。'},
        {subcontent: '如果赛事在发出第一个界外球后中断，所有第一个界外球的注单将保持有效。'},
        {subcontent: '如果赛事在发出第一个界外球后中断，所有最后一个界外球的注单将被取消。'},
        {subcontent: '如果赛事在没有发出任何界外球前中断，所有第一个和最后一个界外球的注单将被取消。'},
        {subcontent: '如果在90分钟完场时间内并未发出任何界外球，所有第一个和最后一个界外球的注单将被取消。'},
      ]},
    ]},
    {subtitle: '替换', items: [
      {content: '最先/最后替补', contentItems: [
        {subcontent: '预测在90分钟完场时间内哪个球队会最先或最后替补球员。'},
        {subcontent: '如果两位或以上球员同时被替补，首先被裁判员出示替补的球员，将被视为"优胜者"为注单进行结算。'},
        {subcontent: '如果赛事在替补第一个球员后中断，所有第一个替补的注单将保持有效。'},
        {subcontent: '如果赛事在替补第一个球员后中断，所有最后一个替补的注单将被取消，除非在赛事中断前，结果已经明确并且若之后有任何潜在替补将对盘口结算裁决没有影响。此情况只有当双方球队都将已分配好的替补机会用完。若遇到任何其他情况，注单将一律被取消。'},
        {subcontent: '如果赛事在没有任何替补前中断，所有第一个和最后一个替补的注单将被取消。'},
        {subcontent: '如果在90分钟完场时间内并未任何替补，所有第一个和最后一个替补的注单将被取消。'},
      ]},
    ]},
    {subtitle: '越位', items: [
      {content: '最先/最后越位', contentItems: [
        {subcontent: '预测在90分钟完场时间内哪个球队的球员会最先或最后越位。'},
        {subcontent: '如果赛事在第一个球员越位后中断，所有第一个越位的注单将保持有效。'},
        {subcontent: '如果赛事在第一个球员越位后中断，所有最后一个越位的注单将被取消。'},
        {subcontent: '如果赛事在没有任何球员越位前中断，所有第一个和最后一个越位的注单将被取消。'},
        {subcontent: '如果在90分钟完场时间内并未有任何球员越位，所有第一个和最后一个越位的注单将被取消。'},
      ]},
    ]},
    {subtitle: '点球', items: [
      {content: '一般规则', contentItems: [
        {subcontent: '点球大战将根据胜出回合(和已踢进的点球)来进行结算。'},
        {subcontent: '如果比赛规则注明必须完成全部点球，任何在已有明确胜出结果后的点球将不计于结算成绩内。'},
      ]},
      {content: '点球荣获', contentItems: [
        {subcontent: '预测在90分钟完场时间内是否会罚点球。'},
      ]},
      {content: '点球大战 - 让球', contentItems: [
        {subcontent: '预测哪一支球队根据盘口指定的让球数在点球赛里获胜。'},
        {subcontent: '骤死赛得分也包括在点球让球盘。'},
        {subcontent: '如果赛事并未进行点球，所有注单将被取消。'},
        {subcontent: '在90分钟完场时间内以及加时赛踢进的点球将不计算在内。'},
      ]},
      {content: '点球大战 – 大小盘', contentItems: [
        {subcontent: '预测点球赛总入球数将大于或小于在盘口指定的大/小盘球数。'},
        {subcontent: '点球大小盘只以10个点球为准（每队5球）。骤死赛得分不包括在点球大小盘。'},
        {subcontent: '范例：', subcontentItems: [
          {list: 'a.利物浦 4-1托特纳姆热刺 – 大小球以5球结算。'},
          {list: 'b.利物浦6-5托特纳姆热刺（每队踢5个点球后的结果为：利物浦4-4托特纳姆热刺）-大小盘在每队踢5个点球后的8球得分结算。'},
        ]},
        {subcontent: '如果赛事并未进行点球，所有注单将被取消。'},
        {subcontent: '在90分钟完场时间内以及加时赛踢进的点球将不计算在内。'},
        {subcontent: '如果赛事在点球赛时中断，而在赛事中断前已有明确结果并且之后没有任何显著会影响投注结果的情况，大/小盘注单才会被结算。若遇到任何其他情况，注单将一律被取消。'},
      ]},
      {content: '点球大战 - 独赢', contentItems: [
        {subcontent: '预测哪一支球队将在点球大战胜出或和局。'},
        {subcontent: '骤死赛(第6回合起) 将不计算在内。'},
        {subcontent: '点球独赢盘只计算球队在前5回合的进球。'},
      ]},
      {content: '点球：进球/无进球', contentItems: [
        {subcontent: '预测特定的球队是否会踢进指定的点球。'},
        {subcontent: '根据点球是否进球来进行结算。'},
      ]},
    ]},
    {subtitle: '比赛', items: [
      {content: '联赛：一般规则', contentItems: [
        {subcontent: '赛果确认完成后将进行派彩。'},
        {subcontent: '联赛的派彩将以官方来源或相关体育权威机构判定的结果为准。'},
        {subcontent: '所有联赛的积分扣除都予以计算。'},
        {subcontent: '冠军比赛规则适用。'},
      ]},
      {content: '小组赛', contentItems: [
        {subcontent: '预测整个赛季中排名最高的球队。'},
      ]},
      {content: '联赛：赛季让分盘', contentItems: [
        {subcontent: '根据每一队让分盘口的差点预测哪支球队将会获胜。'},
        {subcontent: '各球队的让分数将会添加到该队赛季的最终积分里。'},
        {subcontent: '拥有最高综合总分(让分数和赛季最终积分)的球队为赢家。'},
        {subcontent: '此盘口将采用并列名次规则'},
        {subcontent: '球队让分数将不会在赛季中变更,然而赔率将会有所调整。'},
        {subcontent: '球队(赛季前)让分数将显示在各别球队名旁。'},
        {subcontent: '下列为5队联赛例子', subtable: {
          columns: [
            {
              title: '球队',
              dataIndex: 'one',
              key: 'one',

            },
            {
              title: '赛季最终积分',
              dataIndex: 'two',
              key: 'two',
            },
            {
              title: '让分数',
              key: 'three',
              dataIndex: 'three',
            },
            {
              title: '综合总分',
              dataIndex: 'four',
              key: 'four',
            },
            {
              title: '最终排名',
              key: 'five',
              dataIndex: 'five',
            },
          ],
          tableData: [
            {
              key: '1',
              one: '球队1',
              two: '90',
              three: '3',
              four: '93',
              five: '第2',
            },
            {
              key: '2',
              one: '球队2',
              two: '85',
              three: '0',
              four: '85',
              five: '第5',
            },
            {
              key: '3',
              one: '球队3',
              two: '82',
              three: '5',
              four: '87',
              five: '第4',
            },
            {
              key: '4',
              one: '球队4',
              two: '79',
              three: '15',
              four: '94',
              five: '第1',
            },
            {
              key: '5',
              one: '球队5',
              two: '79',
              three: '9',
              four: '88',
              five: '第3',
            },
          ],
        }},
      ]},
      {content: '联赛：最后一名球队', contentItems: [
        {subcontent: '预测整个赛季中哪一支球队会成为最后一名。'},
        {subcontent: '此类投注也被称为最低分。'},
      ]},
      {content: '联赛：被降级的球队', contentItems: [
        {subcontent: '预测在比赛中哪一支球队会被降级。'},
        {subcontent: '所有被降级球队将以全赢作为计算标准，比如：并列名次规则不适用。'},
        {subcontent: '如果一支球队从联赛中被移除或清除，投注在此球队的注单将被视为无效。如果在赛季开始之前出现此情况，所有的投注都无效，将会另外开设盘口。'},
      ]},
      {content: '联赛：球队保持原位', contentItems: [
        {subcontent: '预测比赛中哪一支球队不会被降级。'},
        {subcontent: '所有没有被降级的球队将以全赢作为计算标准，比如：并列名次规则不适用。'},
        {subcontent: '如果一支球队从联赛中被移除或清除，投注在此球队的注单将被视为无效。如果在赛季开始之前出现此情况，所有的投注都无效，将会另外开设盘口。'},
      ]},
      {content: '联赛：球队晋级', contentItems: [
        {subcontent: '预测比赛中哪一支球队会晋级。'},
        {subcontent: '投注包括自动晋级以及在特定比赛中通过加赛后的晋级。'},
        {subcontent: '所有晋级的球队将以全赢作为计算标准，比如：并列名次规则不适用。'},
        {subcontent: '如果一支球队从联赛中被移除或清除，投注在此球队的注单将被视为无效。如果在赛季开始之前出现此情况，所有的投注都无效，将会另外开设盘口。'},
      ]},
      {content: '联赛：最佳新秀', contentItems: [
        {subcontent: '预测哪一支最新晋级的球队将在赛季中获得最高排名。'},
      ]},
      {content: '比赛 - 进球最多的球队', contentItems: [
        {subcontent: '预测在比赛中哪一个球队进球最多。'},
        {subcontent: '所有的投注以赛事官方90分钟为完场时间，包括加时、伤停补时。'},
        {subcontent: '进球数不包括点球大战。'},
        {subcontent: '如果赛事中断，将以官方单位公布的最后赛果为准，其中包括赛事重新开始或指定的分数。'},
      ]},
      {content: '比赛 - 失球最多的球队', contentItems: [
        {subcontent: '预测在比赛中哪一个球队失球最多。'},
        {subcontent: '所有的投注以赛事官方90分钟为完场时间，包括加时、伤停补时。'},
        {subcontent: '在点球大战中的失球不予计算。'},
        {subcontent: '如果赛事中断，将以官方单位公布的最后赛果为准，其中包括赛事重新开始或指定的分数。'},
      ]},
      {content: '比赛 – 总进球数', contentItems: [
        {subcontent: '预测在比赛中进球的数量。'},
        {subcontent: '所有的投注以赛事官方90分钟为完场时间，包括加时、伤停补时。'},
        {subcontent: '在比赛中点球大战的进球不予计算。'},
        {subcontent: '如果赛事中断，将以官方单位公布的最后赛果为准，其中包括赛事重新开始或指定的分数。'},
      ]},
      {content: '比赛 - 梅开二度（进2+球的球员）', contentItems: [
        {subcontent: '预测在比赛中任何一位球员进2个或以上的球。'},
        {subcontent: '所有的投注以赛事官方90分钟为完场时间，包含伤停补时。'},
        {subcontent: '梅开二度不包含点球大战中的进球。'},
        {subcontent: '在一场比赛中如果一个球员进球2个或更多，即为梅开二度。'},
        {subcontent: '如果赛事中断，将以官方单位公布的最后赛果为准，其中包括赛事重新开始或指定的得分。如果梅开二度是在赛事中断前，且赛事在0-0的情况下或者其它官方单位分配的比分下重新开始，将不予计算。'},
        {subcontent: '乌龙球不计算在球员进球。'},
      ]},
      {content: '比赛 - 帽子戏法（进3+球的球员）', contentItems: [
        {subcontent: '预测在比赛中任何一位球员进3个或以上的球。'},
        {subcontent: '所有的投注以赛事官方90分钟为完场时间，包含伤停补时。'},
        {subcontent: '帽子戏法不包含点球大战中的进球。'},
        {subcontent: '在一场比赛中如果一个球员进球3个或更多，即为帽子戏法。'},
        {subcontent: '如果赛事中断，将以官方单位公布的最后赛果为准，其中包括赛事重新开始或指定的得分。如果帽子戏法是在赛事中断前，且赛事在0-0的情况下或者其它官方单位分配的比分下重新开始，将不予计算。'},
        {subcontent: '乌龙球不计算在球员进球。'},
      ]},
      {content: '比赛 - 总帽子戏法（总进3+球次数）', contentItems: [
        {subcontent: '预测在比赛中获得了多少帽子戏法。'},
        {subcontent: '所有的投注以赛事官方90分钟为完场时间，包含伤停补时。'},
        {subcontent: '帽子戏法不包含点球大战中的进球。'},
        {subcontent: '在一场比赛中如果一个球员进球3个或更多，即为帽子戏法。'},
        {subcontent: '如果赛事中断，将以官方单位公布的最后赛果为准，其中包括赛事重新开始或指定的分数。如果帽子戏法是在赛事中断前，且赛事在0-0的情况下或者其它官方单位分配的比分下重新开始，将不予计算。'},
        {subcontent: '乌龙球不计算在球员进球。'},
      ]},
      {content: '比赛 – 总红卡数', contentItems: [
        {subcontent: '预测在比赛中红卡的数量。'},
        {subcontent: '所有的投注以赛事官方90分钟为完场时间，包括加时、伤停补时。'},
        {subcontent: '任何非球员的红卡（例如.经理、教练或替补）不予计算。'},
        {subcontent: '点球大战中的红卡不予计算。'},
        {subcontent: '如果赛事在出现红卡之后中断，红卡仍然计算在总红卡数中。'},
      ]},
      {content: '比赛 – 总黄卡数', contentItems: [
        {subcontent: '预测在比赛中黄卡的数量。'},
        {subcontent: '所有的投注以赛事官方90分钟为完场时间，包括加时、伤停补时。'},
        {subcontent: '任何非球员的黄卡（例如.经理、教练或替补）不予计算'},
        {subcontent: '点球大战中的黄卡不予计算'},
        {subcontent: '如果同个球员被出示第二张黄卡，第二张黄卡会被计算在内。'},
      ]},
      {content: '比赛 – 进球最多的城市/体育馆', contentItems: [
        {subcontent: '预测在比赛中哪一个城市/体育馆将会进球最多。'},
        {subcontent: '所有的投注以官方时间90分钟为准，包括加时、伤停补时。'},
        {subcontent: '点球大战中的进球不予计算。'},
        {subcontent: '如果赛事中断，将以官方单位公布的最后赛果为准，其中包括赛事重新开始或指定的分数。'},
      ]},
      {content: '比赛 – 获胜小组', contentItems: [
        {subcontent: '预测在比赛中哪一个小组将会获胜。'},
        {subcontent: '冠军比赛规则适用。'},
      ]},
      {content: '锦标赛 – 小组最后一名球队', contentItems: [
        {subcontent: '预测哪一个球队为最后一名。'},
        {subcontent: '冠军比赛规则适用。'},
      ]},
      {content: '冠军所属地', contentItems: [
        {subcontent: '预测比赛的冠军来自哪里。'},
        {subcontent: '来源地可以是冠军球队的所属地区、国家或洲。'},
        {subcontent: '冠军比赛规则使用。'},
      ]},
      {content: '比赛-晋级', contentItems: [
        {subcontent: '预测那支队伍会晋级去下一轮赛事。'},
        {subcontent: '投注包括自动晋级以及在加时赛与点球大战后的晋级。'},
        {subcontent: '符合冠军规则。'},
      ]},
      {content: '比赛 - 阶段淘汰', contentItems: [
        {subcontent: '预测比赛中该球队会在哪一个阶段被淘汰。'},
        {subcontent: '冠军比赛规则使用。'},
      ]},
      {content: '比赛 - 提名入围', contentItems: [
        {subcontent: '预测哪一支球队会进入决赛。'},
        {subcontent: '冠军比赛规则适用。'},
      ]},
      {content: '比赛 – 最终裁判员', contentItems: [
        {subcontent: '预测决赛中的裁判员是哪一位。'},
        {subcontent: '无论此前是否有任何公告，将根据决赛开始后的裁判为派彩依据。'},
        {subcontent: '冠军比赛规则适用。'},
      ]},
      {content: '直接预测排名（联赛、比赛）', contentItems: [
        {subcontent: '预测在比赛或联赛中哪两个球队获得第1名和第2名的顺序排名。'},
        {subcontent: '所有的投注以官方时间90分钟为准，包括加时、伤停补时。'},
        {subcontent: '如果赛事中断，将以官方单位公布的最后赛果为准，其中包括赛事重新开始或指定的分数。'},
      ]},
      {content: '双预测排名', contentItems: [
        {subcontent: '预测在比赛或联赛中哪两个球队为前两名的排名。'},
        {subcontent: '所有的投注以官方时间90分钟为准，包括加时、伤停补时。'},
        {subcontent: '如果赛事中断，将以官方单位公布的最后赛果为准，其中包括赛事重新开始或指定的分数。'},
      ]},
      {content: '进球最多的小组', contentItems: [
        {subcontent: '预测在比赛中哪一组进球最多。'},
        {subcontent: '只计算在小组阶段的进球。'},
        {subcontent: '所有的投注以赛事官方单位90分钟为完场时间，包括球员伤停补时。'},
        {subcontent: '如果赛事中断，将以官方单位公布的最后赛果为准，其中包括赛事重新开始或指定的分数。'},
      ]},
      {content: '最佳射手/金靴奖', contentItems: [
        {subcontent: '预测在一场特定比赛中进球最多的球员。'},
        {subcontent: '如果产生超过一个冠军数量, 最佳射手将采用并列名次规则结算方式。(与金靴奖得主无关)。'},
        {subcontent: '金靴奖注单的结算将根据官方赛果或赛事权威机构判定的结果为准'},
        {subcontent: '投注在被列出的该球队球员将被视为有效，无论他们是否受伤、暂停、不参与比赛或其它任何原因。'},
        {subcontent: '如果联赛中途有球员转到同一个联赛的另一个球队, 球员在转到另一个球队前的进球数将继续计算在内且注单有效。如果球员是转到不同联赛的球队，在转会之前的进球数不会继续带到新联赛去，在此球员转会官宣前的注单将保持有效。'},
        {subcontent: '乌龙球将不予计算在内。'},
        {subcontent: '按照单纯的联赛比赛玩法，只有在联赛中进得球才计算在内。在季后赛进的球将不予计算在内。'},
      ]},
      {content: '最佳射手球队', contentItems: [
        {subcontent: '预测比赛中哪一个球员在所属球队中进球最多。'},
        {subcontent: '所有的投注以官方时间90分钟为准，包括加时、伤停补时。'},
        {subcontent: '进球数不包括点球大战。'},
        {subcontent: '投注适用于所有比赛的球队。'},
        {subcontent: '并列名次规则适用；任何用于决定和局的方法不可作为结算依据，比如：计数协助。'},
      ]},
      {content: '最佳射手/比赛双赢', contentItems: [
        {subcontent: '预测比赛中哪一个球员进球最多和哪一支球队获胜。'},
        {subcontent: '所有的投注以官方时间90分钟为准，包括加时、伤停补时。'},
        {subcontent: '进球数不包括点球大战。'},
        {subcontent: '如果多于一个球员和最佳射手打平，并列名次规则适用；任何用于决定和局的方法不可作为结算依据，比如：计数协助。'},
      ]},
      {content: '加时赛', contentItems: [
        {subcontent: '预测一场比赛是否会有加时赛。'},
        {subcontent: '根据比赛是否在正常的“90分钟”结束，还是进行了加时赛结束，来进行结算。'},
      ]},
      {content: '比赛-季军', contentItems: [
        {subcontent: '预测哪支队伍会在季军战胜出。'},
        {subcontent: '投注包括自动晋级以及在加时赛与点球大战后的晋级。'},
        {subcontent: '符合冠军规则。'},
      ]},
      {content: '比赛-分组赛冠军', contentItems: [
        {subcontent: '从指定的两个球队预测选出谁将荣登小组榜首。'},
        {subcontent: '结算以整个小组所有赛事结束后并且官方宣布的结果为准。'},
        {subcontent: '如果出现两个球队比分相同的情况，结果将以官方宣布的获胜者将为准（球分差异，净胜球等等）。'},
        {subcontent: '如果官方没有宣布获胜者，所有投注将会被取消。'},
      ]},
      {content: '获得第一个任意球的队伍', contentItems: [
        {subcontent: '按盘口提供的队伍双方中，预测在90分钟完场时间内最先获得任意球队伍。'},
        {subcontent: '任意球是一种在足球比赛中发生犯规后重新开始比赛的方法。任意球分两种：直接任意球及间接任意球。'},
        {subcontent: '在裁判哨响后踢球才会计算在内。'},
        {subcontent: '若全场比赛无发生任意球判罚，所有投注获得第一个任意球队伍的注单将会取消。'},
        {subcontent: '如果赛事在判罚第一个任意球后中断，所有投注获得第一个任意球的队伍的注单将保持有效。'},
        {subcontent: '如果赛事在没有判罚任意球前中断，所有投注获得第一个任意球的队伍的注单将被取消。'},
      ]},
      {content: '获得下半场第一个任意球的队伍', contentItems: [
        {subcontent: '按盘口提供的队伍双方中，预测在下半场时间内最先获得任意球队伍。'},
        {subcontent: '任意球是一种在足球比赛中发生犯规后重新开始比赛的方法。任意球分两种：直接任意球及间接任意球。'},
        {subcontent: '在裁判哨响后踢球才会计算在内。'},
        {subcontent: '若下半场比赛无发生任意球判罚，所有投注获得下半场第一个任意球队伍的注单将会取消。'},
        {subcontent: '如果赛事在下半场判罚第一个任意球后中断，所有投注获得下半场第一个任意球的队伍的注单将保持有效。'},
        {subcontent: '如果赛事在下半场没有判罚任意球前中断，所有投注获得下半场第一个任意球的队伍的注单将被取消。'},
      ]},
      {content: '获得第一个界外球的队伍', contentItems: [
        {subcontent: '按盘口提供的队伍双方中，预测在90分钟完场时间内最先获得界外球队伍。'},
        {subcontent: '界外球是一种在足球比赛中发生足球完全离开足球场边线的时候后重新开始比赛的方法。'},
        {subcontent: '从头后经头上用双手持球置于头的后方将球掷入场内才会计算在内。'},
        {subcontent: '若全场比赛无发生界外球判罚，所有投注获得第一个界外球队伍的注单将会取消。'},
        {subcontent: '如果赛事在判罚第一个界外球后中断，所有投注获得第一个界外球的队伍的注单将保持有效。'},
        {subcontent: '如果赛事在没有判罚界外球前中断，所有投注获得第一个界外球的队伍的注单将被取消。'},
      ]},
      {content: '获得下半场第一个界外球的队伍', contentItems: [
        {subcontent: '按盘口提供的队伍双方中，预测在下半场时间内最先获得界外球队伍。'},
        {subcontent: '界外球是一种在足球比赛中发生足球完全离开足球场边线的时候后重新开始比赛的方法。'},
        {subcontent: '从头后经头上用双手持球置于头的后方将球掷入场内才会计算在内。'},
        {subcontent: '若下半场比赛无发生界外球判罚，所有投注获得下半场第一个界外球队伍的注单将会取消。'},
        {subcontent: '如果赛事在下半场判罚第一个界外球后中断，所有投注获得下半场第一个界外球的队伍的注单将保持有效。'},
        {subcontent: '如果赛事在下半场没有判罚界外球前中断，所有投注获得下半场第一个界外球的队伍的注单将被取消。'},
      ]},
      {content: '获得第一个球门球的队伍', contentItems: [
        {subcontent: '按盘口提供的队伍双方中，预测在90分钟完场时间内最先获得球门球队伍。'},
        {subcontent: '球门球是比赛中进攻方球员将球踢出守方底线后重新由守方重新开踢的意思。'},
        {subcontent: '回传球，或直接被守门员接获的不计算在内。'},
        {subcontent: '若全场比赛无发生球门球判罚，所有投注获得第一个球门球队伍的注单将会取消。'},
        {subcontent: '如果赛事在判罚第一个球门球后中断，所有投注获得第一个球门球的队伍的注单将保持有效。'},
      ]},
      {content: '获得下半场第一个球门球的队伍', contentItems: [
        {subcontent: '按盘口提供的队伍双方中，预测在下半场时间内最先获得球门球队伍。'},
        {subcontent: '球门球是比赛中进攻方球员将球踢出守方底线后重新由守方重新开踢的意思。'},
        {subcontent: '回传球，或直接被守门员接获的不计算在内。'},
        {subcontent: '若下半场比赛无发生球门球判罚，所有投注获得下半场第一个球门球队伍的注单将会取消。'},
        {subcontent: '如果赛事在下半场判罚第一个球门球后中断，所有投注获得下半场第一个球门球的队伍的注单将保持有效。'},
        {subcontent: '如果赛事在下半场没有判罚球门球前中断，所有投注获得下半场第一个球门球的队伍的注单将被取消。'},
      ]},
      {content: '首先换上替补的队伍', contentItems: [
        {subcontent: '按盘口提供的队伍双方中，预测在90分钟完场时间内首先换上替补的队伍。'},
        {subcontent: '替补是指足球比赛中以替补队员换下场上的比赛队员。'},
        {subcontent: '助理裁判举牌示意换人才会计算在内（不包含球员拒绝下场/强行上场）。'},
        {subcontent: '若全场比赛无发生队伍换上替补，所有投注首先换上替补的队伍的注单将会取消。'},
        {subcontent: '如果赛事在队伍换上替补后中断，所有投注首先换上替补的队伍的注单将保持有效。'},
        {subcontent: '如果赛事在没有队伍换上替补后中断，所有投注获得首先换上替补的队伍的注单将被取消。'},
      ]},
      {content: '首先越位的队伍', contentItems: [
        {subcontent: '按盘口提供的队伍双方中，预测在90分钟完场时间内首先越位的队伍。'},
        {subcontent: '越位是球员处于越位位置，且在球被队友接触到或者拿到的时候，他被裁判员认定为涉入进行中的比赛，才会构成越位违例。'},
        {subcontent: '只有裁判员认定越位（主裁判罚，边裁举旗或视频裁判复审）才会计算在内。'},
        {subcontent: '如果赛事在队伍发生越位后中断，所有投注首先越位的队伍的注单将保持有效。'},
        {subcontent: '如果赛事在没有队伍发生越位后中断，所有投注首先越位的队伍的注单将被取消。'},
      ]},
      {content: '首个进球球员编号单/双', contentItems: [
        {subcontent: '按盘口提供的队伍双方中，预测在90分钟完场时间内首个进球球员编号单双或没有进球。'},
        {subcontent: '请注意，乌龙球也属于进球范围内。'},
        {subcontent: '以进球时球员身上的号码来计算。'},
        {subcontent: '如果赛事在发生进球后中断，所有投注首个进球球员编号单/双的注单将保持有效。'},
        {subcontent: '如果赛事在没有发生进球后后中断，所有投注首个进球球员编号单/双的注单将被取消。'},
        {subcontent: '\'没有进球\'的选项是指两队在官方“90分钟”内（即全场0-0）打入0球。\''},
      ]},
      {content: '首张罚牌球员编号单/双', contentItems: [
        {subcontent: '按盘口提供的队伍双方中，预测在90分钟完场时间内首张罚牌球员编号单双。'},
        {subcontent: '针对非球员（例如：教练，没有比赛中替补出场的替补球员，管理人员等等）出示的任何罚牌将不计算在内。'},
        {subcontent: '以裁判出示先后顺序来进行计算。'},
        {subcontent: '如果赛事在有罚牌发生后中断，所有投注首张罚牌球员编号单/双的注单将保持有效。'},
        {subcontent: '如果赛事在没有罚牌发生中断，所有投注首张罚牌球员编号单/双的注单将被取消。'},
        {subcontent: '如果赛事在完场比赛后没有发生罚牌，则所有注单会计算为走水。'},
      ]},
    ]},
    {subtitle: '综合市场', items: [
      {content: '独赢 & 进球 大/小', contentItems: [
        {subcontent: '同时预测“90分钟”后的比赛结果，以及赛事总入球数将大于或小于在盘口指定的大/小盘球数。'},
        {subcontent: '根据所选球队的输、赢或和局，以及全场比赛的总进球数，来进行结算。'},
        {subcontent: '如果在赛果公布之前比赛中断，所有该盘口的投注将被视为无效'},
      ]},
      {content: '独赢 & 双方球队进球', contentItems: [
        {subcontent: '同时预测“90分钟”后的比赛结果，以及双方球队是否都有进球。'},
        {subcontent: '根据所选特定球队的输、赢或和局，以及每支球队的进球数，来进行结算。'},
        {subcontent: '如果在赛果公布之前比赛中断，所有该盘口的投注将被视为无效'},
      ]},
      {content: '独赢 & 最先进球', contentItems: [
        {subcontent: '同时预测“90分钟”后的比赛结果，以及哪支球队将最先进球。'},
        {subcontent: '根据所选球队的输、赢或和局，以及是否正确的选择了最先进球球队，来进行结算。'},
        {subcontent: '如果在赛果公布之前比赛中断，所有该盘口的投注将被视为无效'},
        {subcontent: '如果赛事中没有首个进球，所有投注将会以输结算。'},
      ]},
      {content: '独赢 & 进球 单/双', contentItems: [
        {subcontent: '同时预测“90分钟”后的比赛结果，以及双方球队总进球数的奇偶。'},
        {subcontent: '根据所选球队的输、赢或和局，以及双方球队总进球数的奇偶，来进行结算。'},
        {subcontent: '如果在赛果公布之前比赛中断，所有该盘口的投注将被视为无效'},
      ]},
      {content: '进球 大/小 & 双方球队进球', contentItems: [
        {subcontent: '同时预测赛事总入球数将大于或小于在盘口指定的大/小盘球数，以及双方球队是否都有进球。'},
        {subcontent: '根据90分钟后的总进球数，以及两队是否都有进球，来进行结算。'},
        {subcontent: '如果在赛果公布之前比赛中断，将根据以下规则进行处理：', subcontentItems: [
          {list: 'a.如果在比赛中断那一刻，双方球队都已经进1球或以上，并且总进球数大于盘口指定的大/小盘球数，投注将被视为有效。'},
          {list: 'b.如果在比赛中断那一刻，双方球队没有都进1球或以上，投注将被视为无效。'},
        ]},
      ]},
      {content: '进球 大/小 & 进球 单/双', contentItems: [
        {subcontent: '同时预测赛事总入球数将大于或小于在盘口指定的大/小盘球数，以及总进球数的奇偶。'},
        {subcontent: '根据90分钟后的总进球数，以及总进球数的奇偶，来进行结算。'},
        {subcontent: '如果在赛果公布之前比赛中断，所有该盘口的投注将被视为无效。'},
      ]},
      {content: '进球 大/小 & 最先进球', contentItems: [
        {subcontent: '同时预测赛事总入球数将大于或小于在盘口指定的大/小盘球数，以及哪只球队将成为首先进球球队。'},
        {subcontent: '根据90分钟后的总进球数，以及是否正确的选择了最先进球球队，来进行结算。'},
        {subcontent: '如果在赛果公布之前比赛中断，将根据以下规则进行处理：', subcontentItems: [
          {list: 'a.如果在比赛中断那一刻的总进球数大于指定的大/小盘球数，投注将被视为有效。'},
          {list: 'b.如果在比赛中断那一刻的总进球数小于指定的大/小盘球数，投注将被视为无效。'},
        ]},
        {subcontent: '如果赛事中没有首个进球，所有投注将会以输结算。'},
      ]},
      {content: '双重机会 & 进球 大/小', contentItems: [
        {subcontent: '从可选的结果中预测正确的结果，以及总进球数对比指定数值的大小。'},
        {subcontent: '根据是否正确的选择了可能的结果，以及“90分钟”后的总进球数，来进行结算。'},
        {subcontent: '3种可能的结果是：', subcontentItems: [
          {list: 'a.主队胜出或和局（1 & X）'},
          {list: 'b.客队胜出或和局（1 & 2）'},
          {list: 'c.主队胜出或客队胜出（1 & 2）'},
        ]},
        {subcontent: '如果在赛果公布之前比赛中断，所有该盘口的投注将被视为无效。'},
      ]},
      {content: '双重机会 & 双方球队进球', contentItems: [
        {subcontent: '从可选的结果中预测正确的结果以及两队是否都会得分。'},
        {subcontent: '根据是否在可能的结果中做出了正确的选择以及两队是否都有进球，来进行结算。'},
        {subcontent: '3种可能的结果是：', subcontentItems: [
          {list: 'a.主队胜出或和局（1 & X）'},
          {list: 'b.b.客队胜出或和局（X & 2）'},
          {list: 'c.主队胜出或客队胜出（1 & 2）'}]},
        {subcontent: '如果在赛果公布之前比赛中断，所有该盘口的投注将被视为无效。'},
      ]},
    ]},
    {subtitle: '其他', items: [
      {content: '特定联赛里主客队的总进球数', contentItems: [
        {subcontent: '本公司在某些联赛里会提供某种结合性赛事结果的投注。盘口的玩法将结合主场与客场球队在整个联赛里的赛果之后分出胜负。中立场的比赛，第一个球队被视为这一场赛事的主队。以下列出所提供的个别替补玩法规则。'},
      ]},
      {content: '在特定联赛中的主队和客队进球数：独赢和双重机会', contentItems: [
        {subcontent: '根据得分的进球数预测所有主队对阵所有客队的结果。 例如，如果主队目标是6颗进球，客队目标是8颗进球，那么获胜的选择将是：'},
        {subcontent: 'a. ‘客队’ (独赢) b. ‘客队 / 平局’ 和 ‘主队 / 客队’ (双重机会)'},
      ]},
      {content: '特定联赛里主客队的总进球数：一般规则', contentItems: [
        {subcontent: '(1)如果联赛中有一场赛事中断或取消，所有特定联赛里主客队的总进球数注单将被取消。'},
        {subcontent: '(2)比赛日程以及赛事场次将会明确的在盘口显示。例如：a. 主队-周五-3场赛事。b. 客队-周五-3场赛事。'},
      ]},
      {content: '特定联赛里主客队的进球数：让球', contentItems: [
        {subcontent: '预测在90分钟完场时间内哪一支球队在结合整个联赛里的赛果后在盘口指定的让球数胜出。'},
      ]},
      {content: '特定联赛里主客队的进球数：进球: 大 / 小', contentItems: [
        {subcontent: '预测主客队的总进球数将大于或小于在盘口指定的大/小盘牌数。'},
      ]},
    ]},
    {subtitle: '奇幻赛事', items: [
      {content: '奇幻赛事是以2个不同赛事的2场比赛为组合进行结果预测的竞猜游戏。', contentItems: [
        {subcontent: '奇幻赛事的竞猜结果以选定的2场赛事的实际比赛结果为准。'},
        {subcontent: '如两场赛事中的任意一场（或两场）被取消、终止或延长后的36个小时内无最终结果，奇幻赛事对应竞猜游戏的结果将以无效处理。'},
        {subcontent: '如两场赛事中的任意一场（或两场）进行加时赛或点球大战时，此次竞猜将以正式比赛中的90分钟赛事结果为准。'},
        {subcontent: '主\客场因素将不作为影响奇幻赛事的影响因素。'},
        {subcontent: '奇幻赛事所有内容将遵守以上赛事规则。'},
      ]},
    ]},
    {subtitle: '落后反超获胜', items: [
      {content: true, contentItems: [
        {subcontent: '预测哪一支球队在比赛的任何时间里都为输，然而却在最后“90分钟”反超为赢。'},
        {subcontent: '选择的球队必须在比赛的任何时间里都为输，但是在接下来的最后“90分钟”却获胜为赢。'},
        {subcontent: '如果比赛被中断，所有的投注均视为无效。'},
      ]},
    ]},
    {subtitle: '电竞足球赛事', items: [
      {content: '电竞足球赛事基本规则', contentItems: [
        {subcontent: '这些比赛可以以虚拟模拟或PvP 的形式提供。'},
        {subcontent: '以比赛名称中注明的比赛时间结束时的官方分数(如:比赛时间为18分钟)为准。'},
        {subcontent: '如果未注明比赛时长，结算将根据该特定比赛的官方比分进行。'},
        {subcontent: '如果在 12 小时内出现“重新制作”或“重新新增”，投注将根据官方结果进行结算。'},
        {subcontent: '球队名称的顺序（主队或客队）与电竞足球比赛结算无关。例如，如果我们的赛程显示的是 甲队于乙队，但官方比赛显示的是 乙队于甲队，那么所有的投注均有效。'},
        {subcontent: '比赛游戏进行中，玩家出现犯规时，被判罚出场情况，投注视为无效。'},
        {subcontent: '比赛结果将不取决于点球大战。'},
        {subcontent: '若比赛因技术原因导致停顿(电脑故障，断线等) 并有预约重开时间，所有投注于已停顿的比赛将根据解决中断比赛的主规则而进行结算。'},
        {subcontent: '重开比赛仍接受投注因视为新比赛。'},
        {subcontent: '若赛事直播因技术故障导致中断 (断线, DDOS等) 将不成为取消注单原因，除非无法确认比赛最终结果。'},
      ]},
    ]},
    {subtitle: 'VS-PANDA 独家 FIFA', items: [
      {content: 'VS-PANDA独家FIFA22虚拟电竞足球赛事', contentItems: [
        {subcontent: '提供全天候的虚拟电竞足球赛事投注体验，赛事不断生成供玩家随时投注。'},
        {subcontent: '赛事仅接受滚球投注，所有比赛将提供直播视频。客户端显示的滚球计时器是游戏控制台，时间格式即为比赛分钟数，是跟着比赛本身的时间，比赛格式是根据实时（2*6）12分钟进行；由于比赛设计的原因，每场比赛可能需要12-16分钟实际时间完成。'},
        {subcontent: '若注单被确认时，出现人为错误或任何软件故障例如： a. 赔率显示有误 b. 体育/滚球页面显示的赔率与投注单不一致 c. 电脑故障，断线等； d. 或任何其他因素指出注单被错误确认的情况下，公司有权限宣布此投注为无效。'},
        {subcontent: '若队伍名称与直播中的名称不符，所有投注均无效。'},
        {subcontent: '提供以下联赛 a. VS - PANDA独家FIFA22 英格兰超级联赛 b. VS - PANDA独家FIFA22 西班牙甲级联赛 c. VS - PANDA独家FIFA22 法国甲级联赛 d. VS - PANDA独家FIFA22 中国超级联赛 e. VS - PANDA独家FIFA22 欧洲冠军联赛'},
      ]},
    ]},
  ],
  isTable: true,
};

export const dataTable: IDataTable[] = [{
  一般规则: '球员',
  主要市场: '特别',
  进球集锦: '角球',
},
{
  一般规则: '牌/卡',
  主要市场: '任意球',
  进球集锦: '射门',
},
{
  一般规则: '界外球',
  主要市场: '替换',
  进球集锦: '越位',
},
{
  一般规则: '点球',
  主要市场: '比赛',
  进球集锦: '综合市场',
},
{
  一般规则: '其他',
  主要市场: '奇幻赛事',
  进球集锦: '落后反超获胜',
},
{
  一般规则: '电竞足球赛事',
  主要市场: 'VS-PANDA 独家 FIFA',
  进球集锦: '',
},
];

export const basketball: IData = {
  title: '篮球', detail:
    [
      {
        subtitle: '一般规则',
        items: [
          {content: true, contentItems: [
            {subcontent: '篮球所有比赛的赛果认定皆以本公司所定的规则为准。'},
            {subcontent: '加时赛不计算在内。'},
            {subcontent: '篮球所有比赛，指示的"主场"、"客场"和"中立场"信息仅供参考，如遇主客场异动，不影响比赛结果，所有注单将被视为有效。'},
            {subcontent: '如比赛在法定时间提前进行，在比赛开始前的投注依然有效，在比赛开始后的所有投注均视为无效(滚球投注另作别论)。'},
            {subcontent: '全场玩法、下半场玩法的所有投注都包括加时赛，除非另有说明。注：单节玩法里的第四节投注不包括加时赛赛果。'},
            {subcontent: '如果比赛开始，但在原定时间的36小时内暂停或者中止，若比赛剩余时间小于等于5分钟，则全场所有注单被视为有效；如果比赛剩余时间大于5分钟，则除中断前已有明确赛果的投注正常结算以外，其余所有注单视为无效。'},
            {subcontent: '对于3x3篮球，结算将基于官方比赛规则。'},
            {subcontent: '篮球某些特定赛事，如遇友谊赛，积分制赛事等，遵循以下规则：', subcontentItems: [
              {list: 'a.若遇到平局结束，所有已投注成功注单均被视为有效，以平局结束比分进行结算。'},
              {list: 'b.若常规时间结束后，即使本场赛事比分已有胜负，但同场队伍因积分制原因再加时，所有已投注成功注单均被视为有效，本场加时比分将会计入到最终结算中。'},
            ]},
          ],
          },
        ],
      },
      {
        subtitle: '投注类型',
        items: [],
      },
      {
        subtitle: '独赢盘',
        items: [
          {content: true, contentItems: [
            {subcontent: '预测哪一支球队将在比赛胜出。盘口提供两支球队为投注选项。'},
            {subcontent: '赛事盘口包括全场、半场或单节投注。'},
          ],
          },
        ],
      },
      {
        subtitle: '让球',
        items: [
          {content: true, contentItems: [
            {subcontent: '预测哪一支球队在盘口指定的让分球数在半场/全场/赛事单节赢得比赛。'},
            {subcontent: '如果赛事在下半场取消或中断，所有上半场注单保持有效。'},
            {subcontent: '如果赛事在下半场取消或中断，所有下半场注单将被视为无效。'},
            {subcontent: '赛事盘口包括全场、半场或单节投注。'},
          ],
          },
        ],
      },
      {
        subtitle: '滚球让球',
        items: [
          {content: true, contentItems: [
            {subcontent: '预测哪支球队将获得让球比赛/赛节的胜利。'},
            {subcontent: '赛事盘口包括全场、半场或单节投注。'},
          ],
          },
        ],
      },
      {
        subtitle: '总分：大 / 小',
        items: [
          {content: true, contentItems: [
            {subcontent: '预测赛事总比分将大于或小于在盘口指定的大/小盘分数。'},
            {subcontent: '赛事盘口包括全场、半场或单节投注。'},
            {subcontent: '如果赛事中断，大/小盘将仅会结算任何将来的得分不会影响到赛果的注单。若遇到任何其它情况，注单将一律被视为无效。'},
            {subcontent: '如果赛事在上半场中断，所有上半场注单将被取消，除非中断前已有明确结果并且之后没有任何显著会影响赛事结果的情况注单才会被结算。'},
            {subcontent: '如果赛事在下半场取消或中断，所有上半场注单保持有效。'},
            {subcontent: '如果赛事在下半场取消或中断，所有下半场注单将被取消，除非中断前已有明确结果并且之后没有任何显著会影响赛事结果的情况注单才会被结算。'},
            {subcontent: '如果赛事中断, 所有时节的注单将被取消除非遇到以下其中一个情况：', subcontentItems: [
              {list: 'a.投注的时节是在比赛中断前'},
              {list: 'b.比赛中断前已有明确结果并且之后没有任何显著会影响赛事结果的情况。'},
            ]},
          ],
          },
        ],
      },
      {
        subtitle: '滚球总分： 大 / 小',
        items: [
          {content: true, contentItems: [
            {subcontent: '预测赛事总比分将大于或小于在盘口指定的大/小盘分数。'},
            {subcontent: '结算是以0-0的比分在比赛/时节结束后按盘口开出的让分数做裁决。'},
            {subcontent: '如果赛事中断，大/小盘将仅会结算任何将来的得分不会影响到赛果的注单。若遇到任何其它情况，注单将一律被视为无效。'},
          ],
          },
        ],
      },
      {
        subtitle: '球队得分 - 大 / 小',
        items: [
          {content: true, contentItems: [
            {subcontent: '预测赛事主队/客队的总分数将大于或小于在盘口指定的大/小盘分数。'},
            {subcontent: '如果赛事取消，所有的注单将会被认为无效，除非注单在中断前已经结算或者在中断前已有明确的结果并且之后没有任何显著会影响赛事结果的情况注单才会被结算。'},
            {subcontent: '所有注单的结算都是依据相关体育机构的官方统计数据为准。'},
          ],
          },
        ],
      },
      {
        subtitle: '总分: 单 / 双',
        items: [
          {content: true, contentItems: [
            {subcontent: '预测赛事的总比分是单数或双数。'},
            {subcontent: '赛事盘口包括全场、半场或单节投注。'},
          ],
          },
        ],
      },
      {
        subtitle: '最先得分球队',
        items: [
          {content: true, contentItems: [
            {subcontent: '预测最先得分的球队。'},
            {subcontent: '如果赛事在有得分后中断，所有最先得分球队的注单将保持有效。'},
            {subcontent: '如果赛事在没有球队得分前中断，所有最先得分球队的注单将被视为无效。'},
            {subcontent: '如果赛事在4节完场时间以及加时赛内没有球队得分，所有最先得分球队的注单将被视为无效。'},
          ],
          },
        ],
      },
      {
        subtitle: '最后得分球队',
        items: [
          {content: true, contentItems: [
            {subcontent: '如果赛事中断， 所有最后得分球队的注单将被视为无效。'},
            {subcontent: '如果赛事在4节完场时间以及加时赛内没有球队得分，所有最后得分球队的注单将被视为无效。'},
          ],
          },
        ],
      },
      {
        subtitle: '得分最高的赛节',
        items: [
          {content: true, contentItems: [
            {subcontent: '预测比赛中哪一节得分最高。'},
            {subcontent: '加时赛不包含在第四节比分内。'},
            {subcontent: '如果出现两节或更多节得分相同的情况，则投注于（平局）的玩法者胜出。'},
          ],
          },
        ],
      },
      {
        subtitle: '单节最高得分球队',
        items: [
          {content: true, contentItems: [
            {subcontent: '预测单节最高得分的球队。'},
            {subcontent: '加时赛不计算在内。'},
            {subcontent: '如果赛事中断，所有单节最高得分球队的注单将被视为无效。'},
            {subcontent: '如果赛事在4节完场时间以及加时赛内没有球队得分，所有最后单节最高得分球队的注单将被视为无效。'},
          ],
          },
        ],
      },
      {
        subtitle: '每节最先获得20分的球队',
        items: [
          {content: true, contentItems: [
            {subcontent: '预测每节最先得20分的球队。'},
            {subcontent: '加时赛不计算在内。'},
            {subcontent: '如果赛事中断前已有明确结果并且之后没有任何显著会影响赛事结果的情况，注单才会被结算。若遇到任何其他情况，注单将一律被视为无效。'},
            {subcontent: '取决于赛事的情况，玩法指定球队需最先获得的分数可能有变化，并且此信息会清楚的显示在盘口。'},
          ],
          },
        ],
      },
      {
        subtitle: '篮球特别投注',
        items: [
          {content: true, contentItems: [
            {subcontent: '预测比分，抢断，篮板，助攻，3分球等。'},
            {subcontent: '如果一方或双方球员/球队没有参与比赛，所有注单将被视为无效。'},
            {subcontent: '注单的结算将根据NBA或特别官方机构公布的结果为准，并且任何赛后更改的数据将被视为无效。'},
          ],
          },
        ],
      },
      {
        subtitle: '球队得分 – 最后一位数',
        items: [
          {content: true, contentItems: [
            {subcontent: '预测主队或客队最终得分的最后一位数字。'},
          ],
          },
        ],
      },
      {
        subtitle: ' 净胜分(3+)',
        items: [
          {content: true, contentItems: [
            {subcontent: '竞猜全场比赛（含加时赛）获胜方及比赛两队的得分差。'},
            {subcontent: '投注主队净胜3+，表示预测主队赢得比赛，且主客队分差大于等于3'},
            {subcontent: '投注客队净胜3+，表示预测客队赢得比赛，且客队主队分差大于等于3'},
            {subcontent: '投注其他，表示预测主客队分差绝对值小于3'},
          ],
          },
        ],
      },
      {
        subtitle: '净胜分(6+)',
        items: [
          {content: true, contentItems: [
            {subcontent: '竞猜全场比赛（含加时赛）获胜方及比赛两队的得分差。'},
            {subcontent: '投注主队净胜6+，表示预测主队赢得比赛，且主客队分差大于等于6'},
            {subcontent: '投注客队净胜6+，表示预测客队赢得比赛，且客队主队分差大于等于6'},
            {subcontent: '投注其他，表示预测主客队分差绝对值小于6'},
          ],
          },
        ],
      },
      {
        subtitle: ' 净胜分（不含加时）',
        items: [
          {content: true, contentItems: [
            {subcontent: '竞猜全场比赛（不含加时）获胜方及比赛两队的得分差。'},
            {subcontent: '投注主队净胜6+，表示预测主队赢得比赛，且主客队分差大于等于6'},
            {subcontent: '投注客队净胜6+，表示预测客队赢得比赛，且客队主队分差大于等于6'},
            {subcontent: '投注其他，表示预测主客队分差绝对值小于6'},
          ],
          },
        ],
      },
      {
        subtitle: '净胜分 6项',
        items: [
          {content: true, contentItems: [
            {subcontent: '竞猜全场比赛（含加时赛）获胜方及比赛两队的得分差。'},
            {subcontent: '预测主队或客队净胜1-5分（包含1分或5分），6-10分（包含6分或10分）'},
            {subcontent: '预测客队或客队净胜11+，分差大于等于11'},
          ],
          },
        ],
      },
      {
        subtitle: ' 净胜分 7项',
        items: [
          {content: true, contentItems: [
            {subcontent: '竞猜全场比赛（含加时赛），比赛两队的得分差。'},
            {subcontent: '预测主队客队分差绝对值为1-5分（包含1分或5分），6-10分（包含6分或10分），11-15分（包含11分或15分），16-20分（包含16分或20分），21-25分（包含21分或25分），26-30分（包含26分或30分）'},
            {subcontent: '预测主队客队分差绝对值为31+，分差大于等于31'},
          ],
          },
        ],
      },
      {
        subtitle: '净胜分 12项',
        items: [
          {content: true, contentItems: [
            {subcontent: '竞猜全场比赛（含加时赛）获胜方及比赛两队的得分差。'},
            {subcontent: '预测主队或客队净胜1-5分（包含1分或5分），6-10分（包含6分或10分），11-15分（包含11分或15分），16-20分（包含16分或20分），21-25分（包含21分或25分）'},
            {subcontent: '预测客队或客队净胜26+，分差大于等于26'},
          ],
          },
        ],
      },
      {
        subtitle: '梦幻篮球游戏规则',
        items: [
          {content: true, contentItems: [
            {subcontent: '梦幻篮球游戏将从同一天的赛事中任意选择两个球队（且原定不是在同一场赛事比赛的球队）进行投注。'},
            {subcontent: '梦幻比赛赛果会根据球队真实的比分为准；梦幻比赛的让分数则以球队真实比分来计算。'},
            {subcontent: '梦幻赛中的两支球队必须在同一天比赛，投注才被视为有效。'},
            {subcontent: '如果球队的比赛时间和本公司网站显示的时间不同，所有涉及此球队的梦幻赛注单将被视为无效。'},
            {subcontent: '梦幻赛投注将不考虑赛事实际进行的场地。'},
            {subcontent: '梦幻赛的举例如下:', subcontentItems: [
              {list: 'a.波士顿凯尔特人101 – 98 芝加哥公牛，洛杉矶湖人118 – 101 奥兰多魔术'},
              {list: 'b.梦幻赛1： 波士顿凯尔特人vs 洛杉矶湖人'},
              {list: 'c.梦幻赛赛果：波士顿凯尔特人 101 – 118洛杉矶湖人'},
              {list: 'd.梦幻赛的结算会根据各球队原定比赛的真实得分为准。 '},
            ]},
            {subcontent: '球队一定要实际完成原定比赛并且已在赛事的官方机构（例如：NBA）留下赛果记录，才能让涉及此球队的梦幻赛注单保持有效。如果球队没有完成原定比赛或最终赛果被官方否定，所有涉及此球队的梦幻赛注单将被视为无效。'},
            {subcontent: '所有梦幻赛都将按照篮球个别玩法的规则和标准裁决。'},
          ],
          },
        ],
      },
      {
        subtitle: '篮球 3x3 比赛规则',
        items: [
          {content: true, contentItems: [
            {subcontent: '每队由4人组成，包括3名首发球员和1名替补球员。'},
            {subcontent: '比赛在FIBA标准球场的一个半场进行，只设一个篮框。'},
            {subcontent: '比赛不通过跳球开始，而是通过掷币决定哪个球队获得第一个掷球入界球权。'},
            {subcontent: '比赛设1-2名裁判，记录员、计时员各1名。'},
            {subcontent: '在三分线内进篮得1分，在三分线外进篮得2分，罚球进篮得1分。'},
            {subcontent: '比赛共10分钟。先得到21分的球队立刻获胜。比赛时间终了时如双方均未得到21分则分数较高一队获胜。遇平分进入延长赛，先得2分队伍获胜。'},
            {subcontent: '单次进攻时间12秒。'},
            {subcontent: '进攻方得分后防守方不需洗球，只需将球自篮下拾起。'},
            {subcontent: '得分以外的死球情况后，防守与进攻球队队员通过三分线后交换球开始比赛。'},
            {subcontent: '全队犯规次数到达 7，8 和 9 次时，每次犯规将被判罚2次罚篮。第10次及以上，将被判罚2次罚球并享有随后的球权。'},
          ],
          },
        ],
      },
      {
        subtitle: '电子篮球赛事',
        items: [
          {content: true, contentItems: [
            {subcontent: '比赛将以虚拟或真实玩家对决(PVP)模式开打.'},
            {subcontent: '盘口的比赛名称将注明比赛时间(例如：4x4、4x5分钟), 且作为最终结算根据.'},
            {subcontent: '比赛时间若无注明时，结算将以官方或相关体育权威机构数据结果为准.'},
            {subcontent: '若由于技术或其他因素导致虚拟或真实玩家对战比赛中断且比赛无法继续进行，所有投注将被取消。'},
          ],
          },
        ],
      },
    ],
};

export const pingpong: IData = {
  title: '兵乓球', detail: [
    {
      subtitle: '一般规则',
      items: [
        {content: true, contentItems: [
          {subcontent: '所有投注的注单均在比赛结束后才被视为有效，除非另有注明。'},
          {subcontent: '如果投注的比赛有球员没有参与比赛，所有投注此比赛的注单将被取消。'},
          {subcontent: '如果一名球员或组合在比赛未结束前退出或被取消资格，所有该场比赛的未出赛果注单将被取消，除非另有注明。'},
          {subcontent: '如果比赛预定时间缩短或者需获胜比赛的比分提高，所有注单将被视为无效。'},
          {subcontent: '如果赛事延期或中断，只要比赛最后有完成，在注单有效时间内所有投注将保持有效。'},
          {subcontent: '如果比赛在法定时间提前进行，在比赛开始前的投注依然有效，在比赛开始后的所有投注均视为无效(滚球玩法除外)。'},
          {subcontent: '赛事是五局三胜制，所有的投注都将以最先赢得三局的球队为准。'},
          {subcontent: '比赛进行期间，因裁判或官方导致的比分变动的注单视为有效并正常结算。'},
        ],
        },
      ],
    },
    {
      subtitle: '投注类型',
      items: [],
    },
    {
      subtitle: '独赢盘',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测哪个球员将会赢取比赛的胜利。这个比赛包含双方球员。'},
        ],
        },
      ],
    },
    {
      subtitle: '让盘 / 让局',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测哪一位球员在盘口指定的让盘/局数赢得比赛。'},
        ],
        },
      ],
    },
    {
      subtitle: '总盘/总局数： 大 / 小',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测比赛进行的总盘/局数是大于或小于盘口指定的大小盘局数。'},
        ],
        },
      ],
    },
    {
      subtitle: '让分',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测在某个时节 哪一位球员在盘口指定的让分数赢得比赛。'},
        ],
        },
      ],
    },
    {
      subtitle: '总分： 大 / 小',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测提名的球员在某一特定的时间段内的个人总得分将大于或小于盘口指定的总分数线'},
        ],
        },
      ],
    },
    {
      subtitle: '球员/球队得分 -大/小',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测主场或客场的总比分是大于还是小于指定盘口。'},
          {subcontent: '如果赛事中断，除非市场已经派彩或任何将来的得分不会影响到赛果的投注有效，其他所有注单一律视为无效。'},
        ],
        },
      ],
    },
    {
      subtitle: '波胆',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测一个特定赛事全场的正确比分。'},
          {subcontent: '结算将依据相关部门最终公布的比分为准。'},
        ],
        },
      ],
    },
    {
      subtitle: '单/双',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测在某一特定的时间段内比赛进行的总局数、盘数或分数是单数还是双数。'},
        ],
        },
      ],
    },
  ],
};

export const puck: IData = {
  title: '冰球', detail: [
    {
      subtitle: '一般规则',
      items: [
        {content: true, contentItems: [
          {subcontent: '如果原定比赛场地更改，所有的投注将被视为无效。'},
          {subcontent: '在罚球中，获胜方会在赛事结束后的最终比分上加一分'},
          {subcontent: '在赛节投注中，特殊的赛节必须全部完成则注单才被视为有效，除非有明确说明或者个别投注规则。其他情况下，注单将一律取消。'},
          {subcontent: '第三节赛节投注不包括加时赛和罚球赛。'},
          {subcontent: '如果比赛提前开赛，只有在开赛之前投注的注单被视为有效投注。在开赛后投注的注单将被视为无效投注，滚球投注类型不包括在内。'},
          {subcontent: '除了在有特别说明的情况下,加时赛并不计算在内'},
        ],
        },
      ],
    },
    {
      subtitle: '投注类型',
      items: [],
    },
    {
      subtitle: '冠军',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测哪支球队将赢得比赛。'},
        ],
        },
      ],
    },
    {
      subtitle: '1 X 2（独赢）',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测哪支球队将赢得比赛/赛节。盘口提供两支球队和平局为投注选项。加时赛并不计算在内。'},
        ],
        },
      ],
    },
    {
      subtitle: '让球',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测哪支球队将获得让球比赛/赛节的胜利。'},
        ],
        },
      ],
    },
    {
      subtitle: '滚球让球',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测哪支球队将获得让球比赛/赛节的胜利。'},
        ],
        },
      ],
    },
    {
      subtitle: '大/小(球)',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测赛事/赛节总进球数将大于或小于盘口分数'},
          {subcontent: '如果赛事中断前已有明确结果并且之后没有任何显著会影响赛事结果的情况，大小球投注的注单才会被结算。若遇到任何其他情况，注单将一律被取消。'},
        ],
        },
      ],
    },
    {
      subtitle: '滚球大/小（球）',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测赛事/赛节总进球数将大于或小于盘口分数。'},
          {subcontent: '如果赛事中断前已有明确结果并且之后没有任何显著会影响赛事结果的情况，大小球投注的注单才会被结算。若遇到任何其他情况，注单将一律被取消。'},
        ],
        },
      ],
    },
    {
      subtitle: '单/双',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测赛事/赛节总进球数为单或者双'},
        ],
        },
      ],
    },
    {
      subtitle: '最先进球球队',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测哪支球队将最先得分'},
          {subcontent: '无论赛事在任何时间点取消，只要有一队在赛事取消前已经得分，所有的投注将被视为有效。'},
          {subcontent: '如果在赛事取消时未有任何一方得分，所有的注单将一律被取消。'},
        ],
        },
      ],
    },
    {
      subtitle: '最后进球球队',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测哪支球队将最后得分。'},
          {subcontent: '如果在赛事取消时未有任何一方得分，所有的注单将一律被取消。'},
        ],
        },
      ],
    },
    {
      subtitle: '球队最高得分的赛节',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测哪支球队在一场赛事中将获得最高的赛节得分。'},
          {subcontent: '加时赛不计算在内。'},
          {subcontent: '如果赛事取消，所有注单将一律被取消。'},
          {subcontent: ' 如果赛事在3节正常比赛时间结束后未有任何一队得分，所有的注单将一律被取消。'},
        ],
        },
      ],
    },
  ],
};

export const tennis: IData = {
  title: '网球', detail: [
    {
      subtitle: '一般规则',
      items: [
        {content: true, contentItems: [
          {subcontent: '所有投注的注单均在比赛结束后才被视为有效，除非另有注明。'},
          {subcontent: '如果投注的比赛有球员没有参与比赛，所有投注此比赛的注单将被取消。'},
          {subcontent: '如果一名球员或组合在比赛未结束前退出或被取消资格，所有该场比赛的未出赛果注单将被取消，除非另有注明。'},
          {subcontent: '如果比赛临时修改规则（在盘口开出后修改），除已出赛果注单外所有未出赛果注单将视受影响程度选择保留或取消。'},
          {subcontent: '如果赛事延期或中断，只要比赛最后有完成，在注单有效时间内所有投注将保持有效。'},
          {subcontent: '如果比赛开打后，因某些原因取消原有比分重新开赛，则赛前注单保留，按照最新赛果进行结算，取消重赛时间点之前所有滚球注单。'},
          {subcontent: '如果比赛在法定时间提前进行，在比赛实际开始时间前的赛前投注依然有效，在比赛开始后的所有赛前投注均视为无效(滚球玩法除外)。'},
          {subcontent: '在决胜盘中，超级抢十被视为一局。'},
          {subcontent: '网球大满贯（四大公开赛：澳洲网球公开赛、美国网球公开赛、法国网球公开赛、温布顿网球公开赛 ），比赛结算方式:', subcontentItems: [
            {list: 'a.男子组比赛：五盘中先赢三盘的球员，为胜方。'},
            {list: 'b.女子组比赛：三盘中先赢两盘的球员，为胜方。'},
          ]},
          {subcontent: '比赛进行期间，因裁判或官方导致的比分变动的注单视为有效并正常结算。'},
        ],
        },
      ],
    },
    {
      subtitle: '投注类型',
      items: [],
    },
    {
      subtitle: '独赢盘',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测哪一位球员将在比赛胜出。盘口提供两位球员为投注选项。'},
        ],
        },
      ],
    },
    {
      subtitle: '让盘',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测哪一位球员在盘口指定的让盘数赢得比赛。'},
        ],
        },
      ],
    },
    {
      subtitle: '让局',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测哪一位球员在盘口指定的让局数在某个时节（例如:全场比赛/第一盘/第二盘）赢得最多局。'},
          {subcontent: '决胜局(抢七局)将视为一局。'},
        ],
        },
      ],
    },
    {
      subtitle: '局获胜者（获胜者 – 盘X 局 X）',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测指定盘的指定局谁将获胜（例如第一盘第一局）。'},
          {subcontent: '抢七决胜局将视为一局（例如第一盘第十三局）。'},
          {subcontent: '如果某盘没有进行指定局，则该局所有注单将被取消。（例如第一盘第八局，但是该盘结束于1-6）。'},
          {subcontent: '如果一名球员退出或被取消资格，任何没有最终获胜者的局的所有注单将被取消，已结束局的注单将视为有效。'},
        ],
        },
      ],
    },
    {
      subtitle: '总局数： 大 / 小',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测比赛中的某个时节（例如:全场比赛/第一盘/第二盘）进行的总局数将大于或小于在盘口指定的大/小盘局数。'},
          {subcontent: '决胜局(抢七局)将视为一局。'},
          {subcontent: '如果比赛中断前已有明确结果并且之后没有任何显著会影响赛事结果的情况，大/小盘注单才会被结算。若遇到任何其他情况，注单将一律被取消。'},
        ],
        },
      ],
    },
    {
      subtitle: '总局数： 单 / 双',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测比赛中的某个时节（例如:全场比赛/第一盘/第二盘）进行的总局数是单数或双数。'},
          {subcontent: '决胜局(抢七局)将视为一局。'},
        ],
        },
      ],
    }, {
      subtitle: '单盘投注',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测单盘最终结果。'},
          {subcontent: '投注的注单只有在单盘结束后才被视为有效。'},
          {subcontent: '如果球员在某盘未结束前退出或被取消资格，所有投注此盘的注单将被取消。'},
        ],
        },
      ],
    },
    {
      subtitle: '波胆',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测比赛的每盘比分。'},
        ],
        },
      ],
    },
    {
      subtitle: '总得分-大/小',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测提名的球员在某一特定的时间段内的个人总得分将大于或小于盘口指定的总分数线'},
          {subcontent: '预测提名的球员在某一特定的时间段内的个人总得分将大于或小于盘口指定的总分数线'},
          {subcontent: '注单的结算将根据ATP / WTA公布的结果为准'},
        ],
        },
      ],
    },
    {
      subtitle: '任意一盘未失一局获胜',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测比赛中是否出现黄金盘 (6:0或0:6)。'},
          {subcontent: '如果赛制为超级强十，则决胜盘不计入该玩法。'},
        ],
        },
      ],
    },
    {
      subtitle: 'X赢得一盘',
      items: [
        {content: true, contentItems: [
          {subcontent: 'X总局数：大小'},
          {subcontent: '预测该选手比赛中赢下的总局数；'},
          {subcontent: '抢7局视为1局；'},
          {subcontent: '赛制为超级抢十的决胜盘，视为1局；'},
          {subcontent: '如果一名球员退出或被取消资格，已经有明确赛果注单会正常结算，未有明确赛果注单将被取消。'},
        ],
        },
      ],
    },
  ],
};

export const volleyball: IData = {
  title: '排球', detail: [
    {
      subtitle: '一般规则',
      items: [
        {content: true, contentItems: [
          {subcontent: '所有投注的注单均在比赛结束后才被视为有效，除非另有注明。'},
          {subcontent: '如果投注的比赛有某一个队伍没有参与比赛，所有投注此比赛的注单将被取消。'},
          {subcontent: '如果某一个队伍在比赛未结束前退出或被取消资格，所有该场比赛的未出赛果注单将被取消，除非另有注明。'},
          {subcontent: '如果比赛预定时间缩短或者需获胜比赛的比分提高，所有注单将被视为无效。'},
          {subcontent: '如果赛事延期或中断，只要比赛最后有完成，在注单有效时间内所有投注将保持有效。'},
          {subcontent: '如果比赛在法定时间提前进行，在比赛开始前的投注依然有效，在比赛开始后的所有投注均视为无效(滚球玩法除外)。'},
          {subcontent: '赛事是五局三胜制，所有的投注都将以最先赢得三局的球队为准。'},
          {subcontent: '比赛进行期间，因裁判或官方导致的比分变动的注单视为有效并正常结算。'},
        ],
        },
      ],
    },
    {
      subtitle: '投注类型',
      items: [],
    },
    {
      subtitle: '独赢盘',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测哪个球员将会赢取比赛的胜利。这个比赛包含双方球员。'},
          {subcontent: '让盘 / 让局'},
          {subcontent: '预测哪一位球员在盘口指定的让盘/局数赢得比赛。'},
        ],
        },
      ],
    },
    {
      subtitle: '总盘/总局数： 大 / 小',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测比赛进行的总盘/局数是大于或小于盘口指定的大小盘局数。'},
        ],
        },
      ],
    },
    {
      subtitle: '让分',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测在某个时节 哪一位球员在盘口指定的让分数赢得比赛。'},
        ],
        },
      ],
    },
    {
      subtitle: '总分： 大 / 小',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测提名的球员在某一特定的时间段内的个人总得分将大于或小于盘口指定的总分数线。'},
        ],
        },
      ],
    },
    {
      subtitle: '球员/球队得分 -大/小',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测主场或客场的总比分是大于还是小于指定盘口。'},
          {subcontent: '如果赛事中断，除非市场已经派彩或任何将来的得分不会影响到赛果的投注有效，其他所有注单一律视为无效。'},
        ],
        },
      ],
    },
    {
      subtitle: '波胆',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测一个特定赛事全场的正确比分。'},
          {subcontent: '结算将依据相关部门最终公布的比分为准。'},
        ],
        },
      ],
    },
    {
      subtitle: '单/双',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测在某一特定的时间段内比赛进行的总局数、盘数或分数是单数还是双数。'},
        ],
        },
      ],
    },
  ],
};

export const handball: IData = {
  title: '排球', detail: [
    {
      subtitle: '一般规则',
      items: [
        {content: true, contentItems: [
          {subcontent: '所有手球投注一律以六十分钟的完场球赛赛果为准，除非另有特别说明，伤停补时计算在内。如果比赛提前开赛，只有在开赛之前投注的注单被视为有效投注。在开赛之后投注的注单将被视为无效投注，滚球投注类型不包括在内。'},
          {subcontent: '对于任何使用”慈悲规则”的比赛, 所有投注将根据当时的结果来决定。'},
        ],
        },
      ],
    },
    {
      subtitle: '投注类型',
      items: [],
    },
    {
      subtitle: '独赢',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测哪支球队将赢得比赛，盘口将提供两支球队及平局作为投注选项。'},
        ],
        },
      ],
    },
    {
      subtitle: '让球',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测哪支球队将获得让球比赛/赛节的胜利。'},
          {subcontent: '滚球让球'},
          {subcontent: '预测哪支球队将获得让球比赛/赛节的胜利。'},
        ],
        },
      ],
    },
    {
      subtitle: '大/小',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测赛事总进球数将大于或小于盘口分数。'},
        ],
        },
      ],
    },

    {
      subtitle: '滚球大/小',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测赛事总进球数将大于或小于盘口分数。'},
          {subcontent: '如果赛事中断前已有明确结果并且之后没有任何显著会影响赛事结果的情况，大小球投注的注单才会被结算。若遇到任何其他情况，注单将一律被取消。'},
          {subcontent: '滚球大小球比分以0-0开始计算，派彩是根据最终的比分为准。'},
        ],
        },
      ],
    },
    {
      subtitle: '单/双',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测赛事总进球数是单数或双数。'},
        ],
        },
      ],
    },
  ],
};


export const rugby: IData = {
  title: '联合式橄榄球', detail: [
    {
      subtitle: '一般规则',
      items: [
        {content: true, contentItems: [
          {subcontent: '如果比赛场地有变更，所有注单将被取消。'},
          {subcontent: '除非另有注明, 所有联合式橄榄球和联盟式橄榄球注单的结算将以“80分钟”完场时间的赛果为准。'},
          {subcontent: '比赛的‘80分钟’完场时间包括任何伤停补时。'},
          {subcontent: '除非另有注明投注种类，所有比赛不包括加时时间。'},
          {subcontent: '所有滚球投注的结算将以“80分钟”完场时间的赛果为准。'},
          {subcontent: '对于国际赛事，只要变更的场地仍在同一个国家内，所有注单将保持有效。'},
          {subcontent: '所有上半场的投注将以上半场结束后的赛果结算。'},
          {subcontent: '下半场的投注将以下半场（包括任何伤停补时或加时赛）后的赛果结算。'},
          {subcontent: '如果赛事是在上半场中断，所有上半场的注单将被取消。如果赛事是在下半场或加时赛中断，所有上半场的注单保持有效，但所有下半场的注单将被取消。'},
        ],
        },
      ],
    },
    {
      subtitle: '投注种类',
      items: [],
    },
    {
      subtitle: '冠军 （平局退款）',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测哪一支球队在完场时间结束比赛胜出。'},
          {subcontent: '如果比赛结果在完场时间后为平局 ，所有注单将被取消。'},
        ],
        },
      ],
    },
    {
      subtitle: '冠军（包括加时赛）',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测哪一支球队将在比赛胜出。'},
          {subcontent: '完场时间和加时赛的比赛结果适用。'},
          {subcontent: '如果在完场时间和加时赛的结算后为平局，所有冠军预测（包括加时赛）的注单将被取消。'},
        ],
        },
      ],
    },
    {
      subtitle: '独赢',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测哪一支球队将在完场时间比赛胜出或平局。盘口提供两支球队和平局为投注选项。'},
        ],
        },
      ],
    },
    {
      subtitle: '独赢 - 上半场',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测哪一支球队将在上半场比赛胜出或平局。盘口提供两支球队和平局为投注选项。'},
        ],
        },
      ],
    },
    {
      subtitle: '独赢 - 下半场',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测哪一支球队将在下半场比赛胜出或平局。盘口提供两支球队和平局为投注选项。'},
        ],
        },
      ],
    },
    {
      subtitle: '让球',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测哪一支球队在赛事指定的让分数赢得比赛。'},
          {subcontent: '结算是以完场时间结束后最终比分，包含下注时的当时比分。'},
        ],
        },
      ],
    },
    {
      subtitle: '让球 - 上半场',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测哪一支球队在上半场中赛事指定的让分数赢得比赛。'},
          {subcontent: '结算是以上半场结束后最终比分，包含下注时的当时比分。'},
        ],
        },
      ],
    },
    {
      subtitle: '让球（包括加时赛）',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测哪一支球队将在比赛胜出。'},
          {subcontent: '完场时间和加时赛的比赛结果适用。'},
          {subcontent: '结算是以包括加时赛最终比分（如果有注明），包含下注时的当时比分。'},
        ],
        },
      ],
    },
    {
      subtitle: '总分： 大 / 小',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测赛事在完场时间，两队总比分将大于或小于在盘口指定的大/小盘分数。'},
          {subcontent: '如果赛事在任何阶段中断并且之后没有任何显著会影响赛事结果的情况，所有大/小盘注单将被视为无效。'},
        ],
        },
      ],
    },
    {
      subtitle: '总分: 大 / 小 - 上半场',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测赛事在上半场，两队总比分将大于或小于在盘口指定的大/小盘分数。'},
          {subcontent: '如果赛事在上半场中断并且之后没有任何显著会影响赛事结果的情况，大/小盘注单将被视为无效。'},
        ],
        },
      ],
    },
    {
      subtitle: '总分 - 3项投注',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测赛事在完场时间，两队总比分将大于或小于在盘口指定的大/小盘比分范围内。'},
          {subcontent: '例如：提供的比分范围是50-60，如果最后的比分是49或更少，“小” 将是一个成功的选择;如果最后的比分是61或更多， “大”将是一个成功的选择；如果最后的比分是50-60(包含50和60)之间的任何一个，则区间以内将是一个成功的选择。'},
          {subcontent: '如果赛事在任何阶段中断并且之后没有任何显著会影响赛事结果的情况，所有注单将被视为无效。'},
        ],
        },
      ],
    },
    {
      subtitle: '球队得分：大/小',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测赛事，指定的球队总比分将大于或小于盘口指定的大/小盘口比分。'},
          {subcontent: '如果赛事在任何阶段中断并且之后没有任何显著会影响赛事结果的情况，所有大/小盘注单将被视为无效。'},
        ],
        },
      ],
    },
    {
      subtitle: '球队得分：大/小－上半场',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测赛事，指定的球队总比分将大于或小于盘口指定的大/小盘比分。'},
          {subcontent: '如果赛事在上半场中断并且之后没有任何显著会影响赛事结果的情况，所有大/小盘注单将被视为无效。'},
        ],
        },
      ],
    },
    {
      subtitle: '主队得分：大/小－上半场',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测赛事在上半场完场时间，主队得分将大于或小于盘口指定的大/小盘比分。'},
          {subcontent: '如果赛事在上半场中断并且之后没有任何显著会影响赛事结果的情况，所有大/小盘注单将被视为无效。'},
        ],
        },
      ],
    },
    {
      subtitle: '客队得分：大/小－上半场',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测赛事在上半场完场时间，客队得分将大于或小于盘口指定的大/小盘比分。'},
          {subcontent: '如果赛事在上半场中断并且之后没有任何显著会影响赛事结果的情况，所有大/小盘注单将被视为无效。'},
        ],
        },
      ],
    },
    {
      subtitle: '触地得分',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测比赛中哪一支球队会成为下一个触地得分的球队。'},
          {subcontent: '如果赛事在指定球队触地得分前中断，则所有注单将被视为无效。'},

        ],
        },
      ],
    },
    {
      subtitle: '（触地得分后再把球射中球门的）附加得分',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测比赛中最后触地得分的球队是否会获得（触地得分后再把球射中球门的）附加得分。'},
          {subcontent: '如果裁判裁定加踢射门重踢 ，则赛事结果将以下一个加踢射门结果为准。'},
          {subcontent: '. 如果最后触地得分球队放弃加踢射门，则所有注单将被视为无效。'},
          {subcontent: '仅对联合式橄榄球,如果触地得分是罚踢触地得分,则盘口的注单将被取消.'},
        ],
        },
      ],
    },
    {
      subtitle: '触地得分总分：大／小盘',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测赛事，触地得分总分将大于或小于盘口指定的大/小盘比分。'},
          {subcontent: '如果赛事在任何阶段中断并且之后没有任何显著会影响赛事结果的情况，所有大/小盘注单将被视为无效。'},
        ],
        },
      ],
    },
    {
      subtitle: '触地得分（球队）：大／小盘',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测赛事，触地得分总分（主队或客队）将大于或小于盘口指定的大/小盘比分。'},
          {subcontent: '如果赛事在任何阶段中断并且之后没有任何显著会影响赛事结果的情况，所有大/小盘注单将被视为无效。'},
        ],
        },
      ],
    },
    {
      subtitle: '主队触地得分',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测赛事，主队是否在任何完场时间内触地多得一分或更多。'},
        ],
        },
      ],
    },

    {
      subtitle: '客队触地得分',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测赛事，客队是否在任何完场时间内触地获得一分或更多。'},
        ],
        },
      ],
    },
    {
      subtitle: '主队触地得分二分或更多',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测赛事，主队是否在任何完场时间内触地获得二分或更多。'},
        ],
        },
      ],
    },
    {
      subtitle: '客队触地得分二分或更多',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测赛事，客队是否在任何完场时间内触地获得二分或更多。'},
        ],
        },
      ],
    },
    {
      subtitle: '主队触地得分三分或更多',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测赛事，主队是否在任何完场时间内触地获得三分或更多。'},
        ],
        },
      ],
    },
    {
      subtitle: '客队触地得分三分或更多',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测赛事，客队是否在任何完场时间内触地获得三分或更多。'},
        ],
        },
      ],
    },
    {
      subtitle: '净胜分数（）',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测哪一支球队在完场时间结束后为净胜分数球队。'},
          {subcontent: '结算将根据完场时间结束时双方球队所获得的最后得分。'},
          {subcontent: '提供3种不同的方式:', subcontentItems: [
            {list: '可变分带，例如X-X分.'},
            {list: '10分带，例如01-10, 11- 20, 21-30等等.'},
            {list: '5分带，例如01-5, 6-10, 11-15, 16-20等等.'},
          ]},
          {subcontent: '如果赛事在任何时候中断，所有该场赛事的投注即被视为无效且取消。'},
        ],
        },
      ],
    },
    {
      subtitle: '首个触地得分球员',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测在80分钟完场时间内首个触地得分的球员。'},
          {subcontent: '如果投注的球员在首个触地得分前参与比赛，所有注单将视为有效。'},
          {subcontent: '如果投注的球员在首个触地得分后才进入比赛，所有注单将被取消。'},
          {subcontent: '如果投注的球员没有参与比赛，所有注单将被取消。'},
        ],
        },
      ],
    },
    {
      subtitle: '最后触地得分球员',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测在80分钟完场时间内最后触地得分的球员。'},
          {subcontent: '如果投注的球员在比赛所规定的80分钟完场时间内参与比赛，所有注单将视为有效。'},
          {subcontent: '如果投注的球员在比赛所规定的80分钟完场时间内参与比赛，所有注单将视为有效。'},
        ],
        },
      ],
    },
    {
      subtitle: '触地得分球员',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测在80分钟完场时间内投注的球员是否会触地得分。'},
          {subcontent: '如果投注的球员在比赛所规定的80分钟完场时间内参与比赛，所有注单将视为有效。'},
          {subcontent: '如果投注的球员没有参与比赛，所有注单将被取消。'},
        ],
        },
      ],
    },
    {
      subtitle: '首个触地得分球队',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测首个触地得分的球队。'},
          {subcontent: '点球将不计算在内。如果出现点球，下一个得分才被视为有效。'},
          {subcontent: '如果赛事在有得分后中断，所有首个触地得分球队的注单将保持有效。'},
          {subcontent: '如果赛事在没有球队触地得分前中断，所有首个触地得分球队的注单将被取消。'},
          {subcontent: '如果赛事在80分钟完场时间以及伤停补时内没有球队触地得分，所有首个触地得分球队的注单将被取消。'},
        ],
        },
      ],
    },
    {
      subtitle: '最后触地得分球队',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测最后触地得分的球队。'},
          {subcontent: '点球将不计算在内。如果最后出现点球，上一个得分才被视为有效。'},
          {subcontent: '如果赛事中断，所有最后触地得分球队的注单将被取消。'},
          {subcontent: '如果赛事在80分钟完场时间以及伤停补时内没有球队触地得分，所有最后触地得分球队的注单将被取消。'},
        ],
        },
      ],
    },
    {
      subtitle: '首个得分球队',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测在比赛时(包括点球赛),首个得分的球队。'},
          {subcontent: '如果赛事在有球队得分后中断，所有首个得分球队的注单将保持有效。'},
          {subcontent: '如果赛事在没有球队得分前中断，所有首个得分球队的注单将被取消。'},
          {subcontent: '如果赛事在80分钟完场时间以及伤停补时内没有球队得分，所有首个得分球队的注单将被取消。'},
        ],
        },
      ],
    },
    {
      subtitle: '最后得分球队',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测在比赛时(包括点球赛),最后得分的球队'},
          {subcontent: '如果赛事中断，所有最后得分球队的注单将被取消。'},
          {subcontent: '如果赛事在80分钟完场时间以及伤停补时内没有球队得分，所有最后得分球队的注单将被取消。'},
        ],
        },
      ],
    },
  ],
};

export const snooker: IData = {
  title: '斯诺克/台球', detail: [
    {
      subtitle: '一般规则',
      items: [
        {content: true, contentItems: [
          {subcontent: '所有注单都以全场赛事结束视为有效，除非另有特别说明。'},
          {subcontent: '如果一个球员未能及时到场参加比赛，官方判罚输掉某一局或某几局，则该场全场独赢、全场让局、总局数玩法将根据官方赛果进行正常结算，其余注单视为无效，串关玩法全部以（1）计算。'},
          {subcontent: '如果选手到场后，在该场比赛继续正常进行的情况下，之后的滚球玩法注单计算为有效。'},
          {subcontent: '如果一名球员在比赛未结束前退出或被取消资格，所有该场比赛的未出赛果注单将被取消，除非另有注明。'},
          {subcontent: '如果赛事延期或中断，只要比赛最后有完成，所有投注将保持有效。'},
          {subcontent: '如果比赛提前开赛，仅有在开赛之前投注的注单将为视为有效投注。开赛后投注的注单将被视为无效， 滚球玩法除外。'},
          {subcontent: '比赛进行中到某一局时，在双方选手及裁判都同意重新开球的情况下：', subcontentItems: [
            {list: 'a.本局重新开球前除独赢外其他注单将按照重新开球后的赛果进行结算。'},
            {list: 'b.本局重新开球前局中独赢投注视为无效，串关以（1）计算，局前独赢投注视为有效。'},
            {list: 'c.本局重新开球后的本局注单视为有效将正常结算。'},
          ]},
        ],
        },
      ],
    },
    {
      subtitle: '投注类型',
      items: [],
    },
    {
      subtitle: '独赢盘',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测哪个球员将赢取比赛胜利。这个比赛包含双方球员。'},
        ],
        },
      ],
    },
    {
      subtitle: '让局',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测哪个球员将在指定的让局比赛获得胜利。'},
        ],
        },
      ],
    },
    {
      subtitle: '总局数： 大 / 小',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测一场比赛的总比分是大于还是小于指定盘口。'},
          {subcontent: '如果一场赛事中断，大/小投注仅会结算任何将来的潜在得分不会影响到赛果的投注。任何其他的情况，投注将被视为无效。'},
        ],
        },
      ],
    },
    {
      subtitle: '总局数： 单 / 双',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测一场赛事的总比分是单数还是双数。'},
        ],
        },
      ],
    },
    {
      subtitle: '局数投注',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测哪个球员将会赢得一场指定赛事特定局数的胜利。'},
          {subcontent: '投注的结算将依据WPBSA最终公布的局数获胜者为准。'},
        ],
        },
      ],
    },
    {
      subtitle: '打满比赛',
      items: [
        {content: true, contentItems: [
          {subcontent: '此规则适用于所有比赛，例如："打满八局"比赛最终结果可能是7-1或者4-4等。'},
        ],
        },
      ],
    },
    {
      subtitle: '单杆破百',
      items: [
        {content: true, contentItems: [
          {subcontent: '预测在赛事中是否有单杆得分100分或更多。'},
          {subcontent: '如果出现某一局开始却未完成的情况，则该局投注将被视为无效，除非特定盘口的结果已确定。'},
        ],
        },
      ],
    },
  ],
};

export const cricket:IData = {
  title: '板球', detail: [
    {subtitle: '一般规则', items: [
      {content: true, contentItems: [
        {subcontent: '所有投注均根据比赛或竞赛相关组织机构公布的官方结果计算。'},
        {subcontent: '各联赛总分相关投注盘口请详参投注类型规则，相关投注将根据官方赛果结算。'},
        {subcontent: '若单日国际赛或Twenty20 比赛未完成排定的轮数，投注将根据官方宣布结果结算，比赛全场大小盘盘口无效，除非另有说明，否则比赛投注包括超级轮赛果。'},
        {subcontent: '如果某个特定的系列赛、阶段、赛轮（例如小组赛）或整场比赛出于任何原因未完成，除非另有特别说明，针对该比赛的所有相关投注被视为无效投注，均以赔率“1”结算，已有明确赛果之投注,将予以结算。'},
        {subcontent: '如果比赛提前开赛，只有在开赛之前投注的注单被视为有效投注。在开赛之后投注的注单将被视为无效投注，滚球投注类型不包括在内。'},
        {subcontent: '板球运动具有多种比赛类型：', subcontentItems: [
          {list: 'a.Twenty20，赛程较短的板球比赛 - 平均比赛时长为叁个半小时；'},
          {list: 'b.单日国际赛 （ODI） - 比赛持续时间超过 8 小时；'},
          {list: 'c.测试赛 - 比赛时长为 5 日，每日至少打 90 回合，每支球队各打两局。'},
        ]},
        {subcontent: '某些类型的赛事结果'},
      ]},
    ]},
    {subtitle: '投注类型', items: []},
    {subtitle: '独赢（三项）', items: [
      {content: true, contentItems: [
        {subcontent: '预测哪一方将获得比赛的胜利。这个投注方式将包含2个球队和 "和局"（draw）的投注选项。'},
      ]},
    ]},
    {subtitle: '独赢（两项）', items: [
      {content: true, contentItems: [
        {subcontent: '预测哪一支球队将在比赛胜出。但若比赛结果为和局，所有投注将被取消。'},
      ]},
    ]},
    {subtitle: '大/小', items: [
      {content: true, contentItems: [
        {subcontent: '预测赛事全场总分将大於或小於指定盘口。'},
        {subcontent: '赛事总分盘口投注，包括第一局丶第二局的投注。'},
        {subcontent: 'Twenty20-对战球队各进行20轮回合，赛事总回合必须完成至少90%以上,所有相关投注将予以结算。'},
        {subcontent: 'ODI-对战球队各进行50轮回合，赛事总回合已完成至少90%(含)以上,所有相关投注将予以结算。'},
        {subcontent: '测试赛-在平局比赛中，对战球队必须至少投掷200轮回合,所有相关投注将予以结算。'},
      ]},
    ]},
    {subtitle: '主队大小', items: [
      {content: true, contentItems: [
        {subcontent: '预测赛事全场主队总分将大於或小於指定盘口。'},
        {subcontent: '赛事主队总分盘口投注，包括第一局丶第二局的投注。'},
        {subcontent: '主队总分投注，若赛事完赛前或在赛事中断前已有明确赛果，并且之後没有任何会影响赛果情况的大小分投注，视为有效注单，所有相关投注将予以结算。'},
      ]},
    ]},
    {subtitle: '客队大小', items: [
      {content: true, contentItems: [
        {subcontent: '预测赛事全场客队总分将大於或小於指定盘口。'},
        {subcontent: '赛事客队总分盘口投注，包括第一局丶第二局的投注。'},
        {subcontent: '客队总分投注，若赛事完赛前或在赛事中断前已有明确赛果，并且之後没有任何会影响赛果情况的大小分投注，视为有效注单，所有相关投注将予以结算。'},
      ]},
    ]},
    {subtitle: '单双', items: [
      {content: true, contentItems: [
        {subcontent: '预测赛事的总比分是单数或双数，零分被视为偶数。'},
      ]},
    ]},
    {subtitle: '搭档开场最高得分', items: [
      {content: true, contentItems: [
        {subcontent: '只要各球队在其第1局中有1球被击出，投注視为有效，且由首个三柱门倒下时的得分决定（不包括退赛）。对于此盘口，比赛中的所有回合均计入。如果任一选手因“暂时离场”而被替代，投注仍为有效。在此情况下，盘口结算将根据首个三柱门倒下时的得分决定，包括新上场的击球手及任何其他被替代球员得分。'},
      ]},
    ]},
    {subtitle: '是否有加时', items: [
      {content: true, contentItems: [
        {subcontent: '预测比赛是否出现加时。'},
      ]},
    ]},
    {subtitle: '是否有平局', items: [
      {content: true, contentItems: [
        {subcontent: '预测比赛是否出现平局。'},
      ]},
    ]},
    {subtitle: '抛币获胜', items: [
      {content: true, contentItems: [
        {subcontent: '赢得抛硬币盘是预测赢得抛硬币（或类似方法）的球队。无论開赛与否，只要完成抛硬币，则投注将视为有效。'},
      ]},
    ]},
    {subtitle: '获得一击四分最多的球队', items: [
      {content: true, contentItems: [
        {subcontent: '如果一场比赛由于外界干扰而被取消，则所有投注都将作废，除非投注结算已被确认。'},
        {subcontent: '单日赛中的双方球队都必须进行至少40回合，否则投注将被视为无效，除非投注的结果已经被确定。'},
        {subcontent: '在对抗赛和郡级锦标赛投注中，整场比赛的结果作数。当比赛打平时，至少要完成200回合，否则投注无效，除非投注的结果已经被确定。'},
        {subcontent: '在二十20比赛中，每队必须打满20回合（除非有球队被投杀出局），否则投注无效，除非投注的结果已经被确定。'},
        {subcontent: '当比赛回合数为10或更少时，如果赛局没有完成，则投注无效，除非有球队被投杀出局或投注结算已被确定。'},
        {subcontent: '在100球赛中，每队必须完成全部100球（除非一方球队被投杀出局），否则投注无效，除非投注结算已确定。'},
        {subcontent: '出于结算目的，此投注指击球手获得正好4个跑位得分的所有投球（包括所有跑位得分/暴投）。'},
        {subcontent: '当比赛由超级轮决胜时，超级轮期间的一击4分均不计算在投注结算内。外界干擾不包括天氣因素。'},
      ]},
    ]},
    {subtitle: '获得一击六分最多的球队', items: [
      {content: true, contentItems: [
        {subcontent: '如果一场比赛由于外界干扰而被取消，则所有投注都将作废，除非投注结算已被确认。'},
        {subcontent: '单日赛中的双方球队都必须进行至少40回合，否则投注将被视为无效，除非投注的结果已经被确定。'},
        {subcontent: '在对抗赛和郡级锦标赛投注中，整场比赛的结果作数。当比赛打平时，至少要完成200回合，否则投注无效，除非投注的结果已经被确定。'},
        {subcontent: '在二十20比赛中，每队必须打满20回合（除非有球队被投杀出局），否则投注无效，除非投注的结果已经被确定。'},
        {subcontent: '当比赛回合数为10或更少时，如果赛局没有完成，则投注无效，除非有球队被投杀出局或投注结算已被确定。'},
        {subcontent: '在100球赛中，每队必须完成全部100球（除非一方球队被投杀出局），否则投注无效，除非投注结算已确定。'},
        {subcontent: '出于结算目的，此投注指击球手获得正好6个跑位得分的所有投球（包括所有跑位得分/暴投）。'},
        {subcontent: '当比赛由超级轮决胜时，超级轮期间的一击6分均不计算在投注结算内。外界干擾不包括天氣因素。'},
      ]},
    ]},
    {subtitle: '第X回合大小', items: [
      {content: true, contentItems: [
        {subcontent: '预测X回合比赛的总分是大于还是小于指定盘口。'},
        {subcontent: '如果X回合比赛中断，大/小投注仅会结算任何将来的潜在得分不会影响到赛果的投注。任何其他的情况，投注将被视为无效。'},
      ]},
    ]},
    {subtitle: '第X出局方式(6项)', items: [
      {content: true, contentItems: [
        {subcontent: '若出现“自愿退场”，则投注作废。如果没有更多的三柱门被击中，全部投注作废。'},
      ]},
    ]},
  ]};

export const financialBetting:IData = {
  title: '金融投注', detail: []};

export const lottery:IData = {
  title: '彩票', detail: []};

export const americanFootball:IData = {
  title: '美式足球', detail:
    [
      {
        subtitle: '一般规则',
        items: [
          {content: true, contentItems: [
            {subcontent: '最终赛果是以全场四个时节后的比分为准（包括加时赛）。'},
            {subcontent: '单节/半场的投注，必须在比赛赛节完成后注单才被视为有效。'},
            {subcontent: '第四节投注不包括加时赛。'},
            {subcontent: '美国大学美式足球联赛场地规则：盘口指示的"主场"和"客场"信息仅供参考。无论原定场地是否更改为"主场"，"客场"或"中立场"，所有注单将保持有效。'},
            {subcontent: '除非个别玩法规则另有注明，赛事完场时间将包括加时赛。'},
            {subcontent: '如比赛在法定时间提前进行，在比赛开始前的投注依然有效，在比赛开始后的所有投注均视为无效(滚球投注另作别论)。'},
          ]},
        ],
      },
      {
        subtitle: '投注类型',
        items: [],
      },
      {
        subtitle: '独赢盘',
        items: [
          {content: true, contentItems: [
            {subcontent: '预测哪一支球队将在比赛胜出。盘口提供两支球队为投注选项'},
          ],
          },
        ],
      },
      {
        subtitle: '让球',
        items: [
          {content: true, contentItems: [
            {subcontent: '预测哪一支球队在盘口指定的让分数赢得某个时节或全场比赛。'},
          ],
          },
        ],
      },
      {
        subtitle: '滚球让球',
        items: [
          {content: true, contentItems: [
            {subcontent: '预测哪一支球队在盘口指定的让分数赢得某个时节或全场比赛。'},
            {subcontent: '结算是以0-0的比分在比赛结束后按盘口开出的让分数做裁决。投注当时的比分对结算没有影响。'},
          ],
          },
        ],
      },
      {
        subtitle: '大/小（总比分）',
        items: [
          {content: true, contentItems: [
            {subcontent: '预测赛事总比分将大于或小于在盘口指定的大/小盘分数。'},
          ],
          },
        ],
      },
      {
        subtitle: '滚球大/小（总比分）',
        items: [
          {content: true, contentItems: [
            {subcontent: '预测赛事总比分将大于或小于在盘口指定的大/小盘分数'},
            {subcontent: '0的比分在比赛结束后按盘口开出的让分数做裁决。'},
          ],
          },
        ],
      },
      {
        subtitle: '单/双',
        items: [
          {content: true, contentItems: [
            {subcontent: '预测赛事的总比分是单数或双数。加时赛将包括在内。'},
          ],
          },
        ],
      },
      {
        subtitle: '半场/全场',
        items: [
          {content: true, contentItems: [
            {subcontent: '预测在全场四个时节后的半全场优胜球队。加时赛将包括在内。'},
            {subcontent: '此盘口也被称为‘双重结果’。'},
          ],
          },
        ],
      },
      {
        subtitle: '净胜分数',
        items: [
          {content: true, contentItems: [
            {subcontent: '投注的结算根据全场四个时节后两支球队比分的差别做裁决。加时赛将包括在内。'},
            {subcontent: '如果比赛在任何时间中断，所有注单将被取消。'},
          ],
          },
        ],
      },
      {
        subtitle: '最先得分球队',
        items: [
          {content: true, contentItems: [
            {subcontent: '预测最先得分的球队。'},
            {subcontent: '如果赛事在有得分后中断，所有最先得分球队的注单将保持有效。'},
            {subcontent: '如果赛事在没有球队得分前中断，所有最先得分球队的注单将被取消。'},
            {subcontent: '如果赛事在4节完场时间以及加时赛内没有球队得分，所有最先得分球队的注单将被取消。'},
          ],
          },
        ],
      },
      {
        subtitle: '最后得分球队',
        items: [
          {content: true, contentItems: [
            {subcontent: '预测最后得分的球队。'},
            {subcontent: '如果赛事中断，所有最后得分球队的注单将被取消。'},
            {subcontent: '如果赛事在4节完场时间以及加时赛内没有球队得分，所有最后得分球队的注单将被取消。'},
          ],
          },
        ],
      },
      {
        subtitle: '单节最高得分球队',
        items: [
          {content: true, contentItems: [
            {subcontent: '预测单节最高得分的球队。'},
            {subcontent: '加时赛不计算在内。'},
            {subcontent: '如果赛事中断，所有单节最高得分球队的注单将被取消。'},
            {subcontent: '如果赛事在4节完场时间内没有球队得分，所有单节最高得分球队的注单将被取消。'},
          ],
          },
        ],
      },
      {
        subtitle: '每节最先获得10分的球队',
        items: [
          {content: true, contentItems: [
            {subcontent: '预测每节最先得10分的球队。'},
            {subcontent: '加时赛不计算在内。'},
            {subcontent: '如果赛事中断，所有每节最先获得10分的球队的注单将被取消'},
            {subcontent: '如果每节都没有球队获得10分，所有注单将被取消。'},
            {subcontent: '取决于赛事，玩法指定球队需最先获得的分数可能有变化，并且会清楚的显示在盘口。'},
          ],
          },
        ],
      },
    ],
};

export const golf:IData = {
  title: '高尔夫球', detail: []};

export const baseball:IData = {
  title: '棒球', detail: [
    {subtitle: '一般规则', items: [
      {content: true, contentItems: [
        {subcontent: '如果主客场变更，所有注单将被取消。'},
        {subcontent: '国际棒球比赛规则:如果比赛最少进行七局后有一队领先10分，或最少进行五局后有一队领先15分，赛事将会提早结束。如果遇此情况，所有的投注将继续保持有效，包括独赢盘，单/双盘，让分盘（让垒盘）和大/小盘（总比分）。'},
        {subcontent: '若投注让分盘和大/小盘（总比分），比赛结果以9局后为准（如果主队领先，结果便以9局上半结束时为准）。如果赛事在加时赛时被保留或中断，比分将以最后一局的结果为准，除非主队打成平局，或在加局赛的上半局结束时，客队保持领先，比分将以比赛被保留时的结果为准。'},
        {subcontent: '未特别注明的情况下，所有全场玩法均包含加时赛。'},
        {subcontent: '上半场投注是按照第1局到第5局的结果为准。'},
        {subcontent: '如遇赛事临时更换先发投手的情况，所有注单将保持有效。'},
        {subcontent: '如果赛事是在下半场中断所有上半场的投注保持有效，除已有明确赛果的玩法外，所有下半场和全场的注单将被取消。'},
        {subcontent: '如果比赛在规定时间前开赛，则实际开赛时间前的赛前盘投注全部有效，在实际开赛时间后的所有赛前盘投注均视为无效。'},
        {subcontent: '因比赛延期导致的双重赛事，并只进行7局的情况下，所有投注成功的注单均为有效，相关的棒球结算规则都可适用于此情况。'},
        {subcontent: '棒球赛事，如遇比赛尚未开赛，官方已给出赛事延期讯息，则该场赛事的所有注单将会全部取消，串关以"1"计算 ; 但遇赛事已在进行中，中途因雨或其他因素暂停比赛时，36小时内官方如有公告该场赛事将保留场上状况、且会在7天内继续进行，则该场赛事所有注单将会保留并正常结算。'},
        {subcontent: '除国际棒球以外的棒球联盟裁定规则（美国职棒，日本职棒，韩国职棒，台湾职棒，墨西哥棒球，澳洲棒球...等）：', subcontentItems: [
          {list: '​1.如遇赛事因比分悬殊（落差达7分或以上，且赛事已进行至5局），经由联盟裁定胜负的场次，该场赛事所有注单（除单双玩法外）皆视为有效注单。'},
          {list: '​2.若因天气因素（下雨.下雪...等）或其他突发因素，赛事未进行至9局提前结束，经由联盟裁定最终赛果时，结算规则如下：'},
          {list: '＊ 赛事已进行至5局上半结束（含5局后），或五局下半进行中，为主场领先，则该场赛事的（全场独赢盘、半场所有玩法以及已有明确赛果的玩法）将会正常结算。'},
          {list: '＊ 若赛事未进行至5局，经由联盟裁定提前结束，则该场赛事的（半场独赢盘、全场独赢盘以及已有明确赛果的玩法）将会正常结算，其余尚未有明确赛果的玩法（如全场让分、全场大小、全场单双、全场主客队总分、半场让分、半场大小，4-6局区间玩法、7-9局区间玩法）注单一律取消，串关以"1"计算。'},
        ]},
      ]},
    ]},
    {subtitle: '投注类型', items: []},
    {subtitle: '独赢盘', items: [
      {content: true, contentItems: [
        {subcontent: '预测哪一支球队将在比赛胜出。'},
        {subcontent: '结算时, 加时(局)赛将计算在内。'},
      ]},
    ]},
    {subtitle: '让球', items: [
      {content: true, contentItems: [
        {subcontent: '预测哪一支球队在盘口指定的让分数赢得某个时节或全场比赛。'},
        {subcontent: '结算时, 加时(局)赛将计算在内。'},
      ]},
    ]},
    {subtitle: '滚球让球', items: [
      {content: true, contentItems: [
        {subcontent: '预测哪一支球队在盘口指定的让分数赢得某个时节或全场比赛。'},
        {subcontent: '结算时, 加时(局)赛将计算在内。'},
      ]},
    ]},
    {subtitle: '总得分: 大 / 小', items: [
      {content: true, contentItems: [
        {subcontent: '预测赛事总比分将大于或小于在盘口指定的大/小盘分数。'},
        {subcontent: '结算时, 加时(局)赛将计算在内。'},
        {subcontent: '如果赛事中断前已有明确结果并且之后没有任何显著会影响赛事结果的情况，大/小盘注单才会被结算。若遇到任何其他情况，注单将一律被取消。'},
        {subcontent: '如果赛事在上半场中断，所有注单将被取消，除非中断前已有明确结果并且之后没有任何显著会影响赛事结果的情况注单才会被结算。'},
        {subcontent: '如果赛事在下半场取消或中断，所有上半场注单保持有效。'},
        {subcontent: '如果赛事在下半场取消或中断，所有下半场和全场注单将被取消，除非中断前已有明确结果并且之后没有任何显著会影响赛事结果的情况注单才会被结算。'},
      ]},
    ]},
    {subtitle: '滚球总得分: 大 / 小', items: [
      {content: true, contentItems: [
        {subcontent: '预测赛事总比分将大于或小于在盘口指定的大/小盘分数。'},
        {subcontent: '结算是以0-0的比分按盘口开出的大小盘让分数做裁决。'},
        {subcontent: '结算时, 加时(局)赛将计算在内'},
      ]},
    ]},
    {subtitle: '总得分: 单 / 双', items: [
      {content: true, contentItems: [
        {subcontent: '预测赛事的总比分是单数或双数。'},
        {subcontent: '结算时, 加时(局)赛将计算在内。'},
      ]},
    ]},
    {subtitle: '独赢 - 前5局', items: [
      {content: true, contentItems: [
        {subcontent: '预测哪支球队将在前5局结束时获胜或者打平。'},
        {subcontent: '只提供于此时间段，不适用于赛事结束时的最终比分'},
      ]},
    ]},
    {subtitle: '球队得分 - 大/小盘', items: [
      {content: true, contentItems: [
        {subcontent: '预测指定的球队总跑垒得分将大于或小于盘口指定的大/小盘分数。'},
        {subcontent: '结算包括加时赛局'},
      ]},
    ]},
    {subtitle: '净胜分数', items: [
      {content: true, contentItems: [
        {subcontent: '预测哪一支球队将赢得这场比赛并比他们的对手多多少'},
        {subcontent: '举例：A队最后得分是12，B队最后得分是8，那么“净胜分数”就是4。'},
        {subcontent: '结算包括加时(局)赛'},
      ]},
    ]},
    {subtitle: '加时赛', items: [
      {content: true, contentItems: [
        {subcontent: '预测赛事是否超出常规9局时间（除非另有说明）。'},
        {subcontent: '出于结算的目的，任何常规的比赛延长到第10局或更多，将被视为进入“加时赛”。'},
      ]},
    ]},
  ]};

export const badminton:IData = {
  title: '羽毛球', detail: [
    {subtitle: '一般规则', items: [
      {content: true, contentItems: [
        {subcontent: '所有投注的注单均在比赛结束后才被视为有效，除非另有注明。'},
        {subcontent: '如果投注的比赛有球员没有参与比赛，所有投注此比赛的注单将被取消。'},
        {subcontent: '如果一名球员或组合在比赛未结束前退出或被取消资格，所有该场比赛的未出赛果注单将被取消，除非另有注明。'},
        {subcontent: '如果比赛预定时间缩短或者需获胜比赛的比分提高，所有注单将被视为无效。'},
        {subcontent: '如果赛事延期或中断，只要比赛最后有完成，在注单有效时间内所有投注将保持有效。'},
        {subcontent: '如果比赛在法定时间提前进行，在比赛开始前的投注依然有效，在比赛开始后的所有投注均视为无效(滚球玩法除外)。'},
        {subcontent: '比赛进行期间，因裁判或官方导致的比分变动的注单视为有效并正常结算。'},
      ]},
    ]},
    {subtitle: '投注类型', items: []},
    {subtitle: '独赢盘', items: [
      {content: true, contentItems: [
        {subcontent: '预测哪个球员将会赢取比赛的胜利。这个比赛包含双方球员。'},
      ]},
    ]},
    {subtitle: '让盘 / 让局', items: [
      {content: true, contentItems: [
        {subcontent: '预测哪一位球员在盘口指定的让盘/局数赢得比赛。'},
      ]},
    ]},
    {subtitle: '总盘/总局数：大 / 小', items: [
      {content: true, contentItems: [
        {subcontent: '预测比赛进行的总盘/局数是大于或小于盘口指定的大小盘局数。'},
      ]},
    ]},
    {subtitle: '让分', items: [
      {content: true, contentItems: [
        {subcontent: '预测在某个时节 哪一位球员在盘口指定的让分数赢得比赛。'},
        {subcontent: ''},
        {subcontent: ''},
        {subcontent: ''},
      ]},
    ]},
    {subtitle: '总分： 大 / 小', items: [
      {content: true, contentItems: [
        {subcontent: '预测提名的球员在某一特定的时间段内的个人总得分将大于或小于盘口指定的总分数线'},
      ]},
    ]},
    {subtitle: '球员/球队得分 -大/小', items: [
      {content: true, contentItems: [
        {subcontent: '预测主场或客场的总比分是大于还是小于指定盘口。'},
        {subcontent: '如果赛事中断，除非市场已经派彩或任何将来的得分不会影响到赛果的投注有效，其他所有注单一律视为无效。'},
      ]},
    ]},
    {subtitle: '波胆', items: [
      {content: true, contentItems: [
        {subcontent: '预测一个特定赛事全场的正确比分。'},
        {subcontent: '结算将依据相关部门最终公布的比分为准。'},
      ]},
    ]},
    {subtitle: '单/双', items: [
      {content: true, contentItems: [
        {subcontent: '预测在某一特定的时间段内比赛进行的总局数、盘数或分数是单数还是双数。'},
      ]},
    ]},
  ]};

export const beautyPageant:IData = {
  title: '选美大赛', detail: []};

export const racing:IData = {
  title: '赛车', detail: []};

export const softball:IData = {
  title: '垒球', detail: []};

export const indoorFootball:IData = {
  title: '室内足球', detail: []};

export const beachVolleyball:IData = {
  title: '沙滩排球', detail: [
    {subtitle: '一般规则', items: [
      {content: true, contentItems: [
        {subcontent: '如果比赛没有完成，所有的投注将被视为无效，除非另有特别说明。'},
        {subcontent: '如果开赛前球员的名字有更改，公司保留取消注单的权利。'},
        {subcontent: '投注将会根据球队三局两胜制结算。'},
        {subcontent: '如果比赛预定时间缩短，或者赛事获胜要求比分提高，所有注单将被取消。'},
        {subcontent: '如果比赛提前开赛，只有在开赛之前投注的注单将为视为有效投注。在开赛后投注的注单将被视为无效， 滚球玩法除外。'},
      ]},
    ]},
    {subtitle: '投注类型', items: []},
    {subtitle: '独赢盘', items: [
      {content: true, contentItems: [
        {subcontent: '预测哪一方赢得比赛。'},
      ]},
    ]},
    {subtitle: '让局', items: [
      {content: true, contentItems: [
        {subcontent: '预测哪一方在指定的让分情况下赢得比赛。'},
      ]},
    ]},
    {subtitle: '让分', items: [
      {content: true, contentItems: [
        {subcontent: '预测哪一方在指定的让分局数中可以获得更高的分数（例如：第一局，第二局）。'},
      ]},
    ]},
    {subtitle: '总分： 大 / 小', items: [
      {content: true, contentItems: [
        {subcontent: '预测在指定的局数中的总得分是大还是小，盘口中会有大小的分割线。 （例如：第一局，第二局）。'},
        {subcontent: '如果赛事中断前已有明确结果并且之后没有任何显著会影响赛事结果的情况，大/小盘注单才会被结算。若遇到任何其他情况，注单将一律被取消。'},
      ]},
    ]},
    {subtitle: '单/双', items: [
      {content: true, contentItems: [
        {subcontent: '预测在指定的局数中的总得分是单还是双。 （例如：第一局，第二局）'},
      ]},
    ]},
  ]};

export const winterSports:IData = {
  title: '冬季运动', detail: []};

export const hockey:IData = {
  title: '曲棍球', detail: [
    {subtitle: '一般规则', items: [
      {content: true, contentItems: [
        {subcontent: '户外曲棍球投注皆以完场4节 X 15 分钟为准'},
        {subcontent: '上半场投注将会根据前2节的赛果结算（例如：30分钟包含伤停补时）投注上半场所有种类注单，均以上半场球赛结果为准（30 分钟, 包括伤停时间）。'},
        {subcontent: '室内曲棍球投注皆以2半场 X 20 分钟为准'},
        {subcontent: '上半场投注将会根据第一半场的结果结算（例如：20分钟包含伤停补时）'},
        {subcontent: '单节/半场的投注，必须在比赛赛节完成后注单才被视为有效'},
        {subcontent: '如果提前开赛，只有在开赛之前投注的注单将为视为有效投注。在开赛后投注的注单将被视为无效，这里不包括滚球投注类型。'},
        {subcontent: '除了在有特别说明的情况下,加时赛并不计算在内。'},
      ]},
    ]},
    {subtitle: '投注类型', items: []},
    {subtitle: '独赢', items: [
      {content: true, contentItems: [
        {subcontent: '预测哪一队将赢取比赛事/赛节的胜利，此投注包含双方球队以及平局'},
      ]},
    ]},
    {subtitle: '让球', items: [
      {content: true, contentItems: [
        {subcontent: '预测哪一方将获得让球比赛/赛节的胜利。'},
      ]},
    ]},
    {subtitle: '滚球让球', items: [
      {content: true, contentItems: [
        {subcontent: '预测哪一方将在让球盘比赛/赛节的胜利'},
      ]},
    ]},
    {subtitle: '大/小(球)', items: [
      {content: true, contentItems: [
        {subcontent: '预测赛事总进球数将大于或小于指定的赛事/赛节盘口。'},
        {subcontent: '如果赛事取消，大小球投注会赛事已经确认任何潜在因素并不会影响最总注单结果情况下结算。其他情况下，注单将一律取消'},
      ]},
    ]},
    {subtitle: '滚球大/小（球）', items: [
      {content: true, contentItems: [
        {subcontent: '预测总进球数将大于或小于指定的赛事/赛节盘口。'},
      ]},
    ]},
    {subtitle: '单/双', items: [
      {content: true, contentItems: [
        {subcontent: '预测赛事的总进球数是单数或双数。'},
      ]},
    ]},
  ]};

export const bike:IData = {
  title: '自行车', detail: []};

export const gymnastics:IData = {
  title: '体操', detail: []};

export const athletics:IData = {
  title: '田径', detail: []};

export const moreSports:IData = {
  title: '更多运动', detail: []};

export const beachFootball:IData = {
  title: '沙滩足球', detail: []};

export const waterSports:IData = {
  title: '水上运动', detail: []};

export const specialproject:IData = {
  title: '特别项目', detail: []};

export const darts:IData = {
  title: '飞镖', detail: []};

export const boxing:IData = {
  title: '拳击/格斗', detail: [
    {subtitle: '一般规则', items: [
      {content: true, contentItems: [
        {subcontent: '第一回合的铃声响起后，投注的注单将视为有效。'},
        {subcontent: '每个回合的时长为3分钟；大/小盘里的‘半回合’将以90秒为准。'},
        {subcontent: '如果规定的回合数有所更改，所有投注大/小盘注单将被取消。'},
        {subcontent: '如果赛事出现平局， 投注二选一（H2H）玩法的注单将被取消。'},
        {subcontent: '注单的结算将根据比赛公布的结果为准，比赛结果可以以点数，技术性击倒，击倒或剥夺资格来定义。', subcontentItems: [
          {list: 'a.KO（击倒）包括TKO（技术性击倒）和剥夺拳击手资格。'},
          {list: 'b.平局包括技术性打和。'},
          {list: 'c.判决包括技术性判决。'},
        ]},
        {subcontent: '如果赛果在比赛结束并且拳击手离开擂台后有任何修正或修改将被视为无效。'},
        {subcontent: '如果供投注的拳手名单里有拳手退赛或被替补，所有注单将被取消。'},
        {subcontent: '如果官方宣布一方或双方拳手都没有达到比赛指定的体重要求，所有注单将被取消。'},
      ]},
    ]},
    {subtitle: '搏斗（综合格斗）', items: []},
    {subtitle: '一般规则', items: [
      {content: true, contentItems: [
        {subcontent: '当裁判宣布第一回合的开始后，投注的注单将视为有效。'},
        {subcontent: '终极格斗赛每一个回合的时长为5分钟，大/小盘里的‘半回合’将以150秒为准。'},
        {subcontent: '每个冠军头衔争夺战有5个回合，非冠军头衔争夺战有3个回合。每回合当中的休息时间为1分钟。'},
        {subcontent: '比赛后公布的结果将视为最终赛果并且可以以得分，降服，技术性击倒，击倒或剥夺资格来定义。如果赛果在比赛结束并且拳击手离开擂台后有任何修正或修改将被视为无效。', subcontentItems: [
          {list: 'a.降服：其中一位拳手清楚地拍打地面或他的对手，或口头方式告知裁判认输。'},
          {list: 'b.技术性击倒：如果一位拳手无法继续比赛，比赛将以技术性击倒定义比赛结束。'},
          {list: 'c.平局包括技术性打和。'},
        ]},
        {subcontent: '如果在比赛结束后裁判重新计算比分或官方更改赛果，将对注单的结算没有影响。'},
      ]},
    ]},
  ]};

export const esport: IData = {
  title: '电子竞技', detail: [
    {
      subtitle: '基本规则',
      items: [
        {content: true, contentItems: [
          {subcontent: '本公司网站针对电子竞技赛事盘口的开赛日期及时间仅作参考，具体开赛时间根据官方显示情况为最终依据，如某一比赛暂停或延期：', subcontentItems: [
            {list: '情况A：若官网在24小时内更新赛事时间，且在原赛事时间的36小时内进行，则该场赛事注单均计算为有效'},
            {list: '情况B：若官网在24小时内更新赛事时间，且在原赛事时间的36小时后进行，则该场赛事注单均视为无效，并予以退款'},
            {list: '情况C：若官网未在原定时间的24小时内更新赛事时间，该场比赛注单均视为无效，并予以退款'},
          ]},
          {subcontent: '如果队伍在比赛未开始前或比赛进行途中弃权，已明确的赛果正常结算，未明确赛果的注单视为无效并予以退款。'},
          {subcontent: '如果等待官方宣布赛事结果，并且在实际赛事时间后24小时内没有赛事结果或官方无法提供有力的信息，注单视为无效返还本金。'},
          {subcontent: '如果电竞赛事中错误队员或队伍名字（电竞赛事中，战队信息或队员信息不正确且得不到赛事方认可），有关赛事注单视为无效返还本金。'},
          {subcontent: '如该赛事队伍无法参赛，由于弃权或其它理由，有关该场赛事注单将被考虑取消视为无效返还本金。'},
          {subcontent: '对于已经结算的注单，自赛事开始时间起的36个小时内，如赛果有任何修正或变更，平台将保留该有权利修改赛事结果，赛果会根据相关机构、官方比分网或官方直播'},
          {subcontent: '(录像demo）决定。'},
          {subcontent: '关于赛事结果，如赛果在超过36小时后有更动或查找准确的赛果，需玩家自行寻求/咨询官方赛事平台的协助以作为参考。'},
          {subcontent: '当官方赛果与本平台网站赛果版块公布的赛果之间有冲突时，应当通过参考本平台的有关赛事视频记录来确定正确的结果，以便解决冲突。然而，如果没有此类适用的视频记录，应当根据特定赛事的相关主管机构在其官方网站上公布的赛果确定正确的结果。 如果该官方网站无法提供这一结果或者官方网站公布的赛果明显有错，则本平台有权做出决定/修正，以便确定最终的结果。在此方面，本平台的决定是最终和具有结束性的。'},
          {subcontent: '如果某一局赛事由于网络问题或技术上的问题需要重赛，有关该局所有已有明确赛果的投注将持续有效。若重赛时间发生在36小时内，未结算赛果参照重赛赛果结算；若重赛时间超过36小时，则取消相应未结算盘口注单，连串注单将按“1”计算。'},
          {subcontent: '所有赔率都会随时变动, 提交的投注会按照注单显示最终确认赔率为准。'},
          {subcontent: '连串的注单如果被取消赔率将按 ‘1’计算 。'},
          {subcontent: '盘口若未能在特定时间前关闭，投注该时间后的注单将被考虑取消视为无效返还本金。'},
          {subcontent: '延迟投注（事后单）- 赛前投注如果由于任何原因在比赛开始后被接受，该情况下的投注将视为事后单处理。滚盘的盘口若未能在特定时间前关闭，投注于该时间后的注单将视为事后单处理。该有关注单平台保留权利判断投注无效。'},
          {subcontent: '在比赛过程中如主办方临时更改赛制，与原本提供的赛制不相同，该场有关全局盘口的注单将视为无效。单局正常结算。'},
          {subcontent: '如果比赛过程中出现BUG或短暂技术问题，该比赛时段的结果会按照最终官方赛果进行结算。'},
          {subcontent: '平台保留在任何时间暂停盘口/或取消任何投注的权利。'},
          {subcontent: '如果出现放错视频源，视频无法播放等问题，不会因此而影响该赛事的结算。'},
          {subcontent: '若赛中出现队员掉线或短暂失去连接，且不可回转，即官方认可的所有赛果有效，均将正常结算'},
          {subcontent: '利用系统漏洞进行投注，利用非官网方平台不规范下单，串通投注或有其他嫌疑的不正常的投注，平台拥有最终的处理决定权。'},
          {subcontent: '一旦确定注单以后，该注单不得被取消，撤销及更改，并且该注单会视为您投注有效凭证以供本平台进行核实。'},
          {subcontent: '若发生系统/技术错误，导致开出一个明显错误的赔率，则错误赔率时间段所有投注将计为无效。若错误发生在滚盘投注盘上，我们保留权利判断投注无效，本金归还。'},
          {subcontent: '我们的系统或程序出错或出现故障时，所有投注将视为无效。您有义务在发现错误时通知平台。'},
          {subcontent: '本平台保留限制特殊比赛项目的最高投注金额，以及在不做出任何通知和说明理由下限制或增加某个客户最大赔率的权利。'},
          {subcontent: '本平台拥有有权收回多支付给您的任何金额，并调整您的账户，以纠正错误。我们且会在合理可行的范围内尽快通知您。'},
          {subcontent: '本平台拥有最终的处理决定权，并且保留最终解释权以及随时修改规则的必要。'},
        ],
        },
      ],
    },
    {
      subtitle: '冠军投注',
      items: [],
    },
    {
      subtitle: '独赢',
      items: [
        {content: true, contentItems: [
          {subcontent: '在指定的冠军盘中，预测一场锦标赛, 联赛, 或者比赛的冠军。所选择的队伍或选手获得最终胜利视为符合派彩条件，包括：', subcontentItems: [
            {list: 'a.联赛的最终结果，例如: 世界杯冠军；'},
            {list: 'b.在预赛中胜出，例如: 世界杯小组冠军；'},
            {list: 'c.最高得分数；'},
            {list: 'd.最优秀的选手等。'},
          ]},
          {subcontent: '一般规则：', subcontentItems: [
            {list: 'a.所有冠军投注基于比赛的最终结果。'},
            {list: 'b.如果所投注的选手或队伍参加了此次的竞赛、联赛或比赛，即使被取消资格、退职或没有完成比赛，不论任何原因，所有投注此选手或队伍的注单都将正常结算。'},
            {list: 'c.最高得分数；'},
            {list: 'd.无论在什么情况下，如果使用其他球员或"其他球队"代替名称的参赛者将被视为无名称。'},
          ]},
        ],
        },
      ],
    },
    {
      subtitle: '串关',
      items: [
        {content: true, contentItems: [
          {subcontent: '串关是指选择两个或更多的赛事在一个单一的注单中。串关里面的所有赛事必须获胜，注单才视为“胜利”.如果串关组合的其中一单是获胜的，即会添加到下一个投注选项，直到该串关所有的单都获胜或直到有一场失败为结束。串关有任何的投注赛事无效或者和局，该串关注单仍然有效，但是和局/无效的投注项目将以1计算'},
          {subcontent: '指以两个或以上的赛事投注为组合的投注方式。若全部选择均赢，则该串关投注为赢，并将获赔两个投注的组合赔率。若一个(或多个) 选择均输, 则 “串关” 投注为输。若一个 (或多个)选择被撤销或取消，则该选择的赔率将恢复为1.00的赔率。最多串关注单10注。'},
          {subcontent: '仅支持电竞赛事之间的非冠军玩法进行串关，也即不可与其他赛种进行串关投注。'},
        ],
        },
      ],
    },
    {
      subtitle: '滚球',
      describe: [
        {list: '滚盘投注是指对正在进行比赛进行投注。注单会在赛事进行期间继续收订单并且在关盘后停止收单。'},
        {list: ' 注意：但凡赛事已经移到滚盘页面，不管赛事是否已经开始，系统即将所有投注计算为“滚盘订单”。'},
      ],
      items: [
        {content: true, contentItems: [
          {subcontent: '所有滚盘投注均需经过系统验收程序。这可能会导致每笔投注延迟确认或出现投注失败的情况。'},
          {subcontent: '所有注单会在至多20秒内等待系统验收程序判断投注是否成功。这表示注单有可能被取消或确认。'},
          {subcontent: '在赛事进行中发生技术问题或其他特殊情况，所有待确认中的注单将不被确认并视为投注失败。'},
          {subcontent: '所有在滚盘投注所显示的资料（包括比分及时间等等）均只是一个参考，所有信息均不会用作结算的依据，也不应基于此作为投注的根据。'},
        ],
        },
      ],
    },
    {
      subtitle: '电竞结算规则',
      items: [
        {content: true, contentItems: [
          {subcontent: '出于结算目的，无证据证明比赛进行或确定未进行或被延期的比赛将视为无效/无结果/未参赛，除非相关比赛能在原定开赛时间后的36小时内进行。有关某一比赛队伍/选手锦标赛晋级或夺冠的注单始终有效。'},
          {subcontent: '如果所列赛事队伍信息不正确，所有投注将视为无效。如果选手/战队的名称被拼错、队徽的显示错误，公司有权纠正其错误且所有下注金额仍有效，除非明显是错误的对象。'},
          {subcontent: '如所列赛事盘口信息有误，此盘口所有下注订单做无效注单处理。比赛标题、比赛时间的错误在与实际进行的比赛联赛/比赛参赛者/参赛队相符时，公司有权纠正其错误且所有注单将继续有效，按实际进行比赛结果进行结算。'},
          {subcontent: '团队更名或换人：', subcontentItems: [
            {list: 'a.如果选手或战队更改了名称，只要可以确定投注对象是哪一场或哪一局赛事，使用之前名称提供的盘口全部生效。投注不会因团队有替补或暂代队员参加比赛而取消，如果比赛的组织机构允许有替补队员且公布官方的比赛结果，所有投注将被视为正常。'},
            {list: 'b.如果一支队伍更改名字但是阵容一样，那么在比赛期间，所有投注于新队名称以及旧队名称均有效。但如果一支队伍被全新的阵容以及每个玩家都不同于原来的参赛队取代，则所有的投注将被视为无效。'},
          ]},
          {subcontent: '若存在参赛选手并非战队的官方选手（或其中之一），并未在公布赛程前公告参赛人员变动，本公司有权取消该场的注单并予以退还本金。'},
          {subcontent: ' 在单张地图中因不可抗力导致比赛无法进行。则已结算的赛果仍然有效，未结算赛果的盘口投注将被退还本金。'},
          {subcontent: '在单张地图中因不可抗拒力导致比赛重赛，则已结算的赛果仍然有效，未结算赛果的盘口投注按照重赛赛果事为准，如36小时内，未开始重赛，则所有未结算注单取消。'},
          {subcontent: '在一支队伍有一张或者一张以上的地图优势，例如：来自于胜者组决赛而具备优势，“地图二”意指实际进行游戏的第一张地图，“地图三”意指实际进行游戏的第二张地图，以此类推。'},
          {subcontent: '延迟投注（事后单）：早盘投注如果由于任何原因在比赛开始后被接受，该情况下的投注将视为事后单处理。滚球的盘口若未能在特定时间前关闭，投注于该时间后的注单将视为事后单处理。事后单的投注将被退还本金。'},
          {subcontent: '如果缺乏一致且独立的证据，或出现明显互相矛盾的证据资料，投注将按我们自己的相关独立数据进行结算。'},
          {subcontent: '投注结算将以指定赛事、广播或游戏的相关管理机构宣布的官方结果为依据。对无效/无结果/未参赛的投注将视为无效。'},
          {subcontent: '如果对任何赛果有不确定，公司有权无限期暂停任何盘口的结算。'},
          {subcontent: ' 所有已公布的赛果于36小时后不得更改，且在该时间段后不再接受任何查询。公司仅在赛果公布后36小时内，重置/更正因人为失误、系统错误或因参考赛果来源而造成错误的赛果；而对于有证据证明比赛已结束但无证据证明赛果的盘口，超过36小时，我们将返还这些盘口的注单。'},
        ],
        },
      ],
    },
    {
      subtitle: '玩法说明',
      items: [
        {content: true, contentItems: [
          {subcontent: '独赢盘口：关于独赢盘口是以赛事和地图。根据官方赛事结果，官方比分网或官方直播(录像demo）。如该赛事局数不正确或有变化，与其他官方网站不一致，该注单视为无效返还本金。'},
          {subcontent: '让分局盘口：关于让分局盘口根据官方赛事结果， 官方比分网或官方直播 (录像demo） 。让分局包括地图，局数，击杀。如该赛事地图不正确或有变化，与其他官方网站不一致，该注单视为无效返还本金。'},
          {subcontent: '当仅提供胜负选项的盘口遇到最终比赛结果为平局时（若有加时，则最后一个加时的结果视为最终比赛结果），则该盘口的所有注单无效并予以退款。'},
          {subcontent: '1X2胜平负3项盘口：此类型的下注适用于存在平局的比赛（如BO2只打两局、不含加时的BO1），玩家需正确预测比赛结果才可赢得奖金。'},
          {subcontent: '让分：预测计算让分数后的结果数。任何形式的加时或补时将予以计算在内。让分是为了“均衡”概率而设置的一个数字，队伍或队员前“-”代表让分，“+”代表受让，计算让分数后得分高的胜出。',
            subcontentItems: [{list: ' 例如：A -1.5 B +1.5  比赛结果A=2，B=1，那么A-1.5<b，b+1.5>A，则B+1.5胜出。即： 2:（1+1.5）投注B为获胜。'}],
          },
          {subcontent: '大/小：预测在比赛中大于或小于盘口数，任何形式的额外时间或加时赛均计算在内。'},
          {subcontent: '单双：预测在比赛最终结果数量的单双，任何形式的额外时间或加时赛均计算在内。（如结果出现为 0 ，结算为偶数 “双”)。'},
          {subcontent: '以上2种时间盘口时长大于或等于盘口标注时间计算为大于。'},
          {subcontent: '总击杀数：单场游戏内击杀数量；以游戏结束后官方计分板上数量为准，如未提供计分板再以游戏内显示为准。'},
          {subcontent: '摧毁防御塔数量：地图中所有防御塔如果参赛队伍在比赛结束前投降，则发起投降后摧毁的所有目标均计入。小兵或反补摧毁的目标也将被计入。'},
          {subcontent: '摧毁首座防御塔位置：指防御塔的位置，包含上路/中路/下路，总共6座一层塔。'},
          {subcontent: '击杀数：指参赛队伍选手击杀数量，以计分板为准。'},
          {subcontent: '一血：以计分板为依据，拿下第一分便是一血。'},
          {subcontent: '一塔：摧毁第一座防御塔的队伍（DOTA2中反补防御塔，算作反补方对面摧毁防御塔）。'},
          {subcontent: 'N杀：是指一方率先获得版面的N次的击杀数。例如：五杀：是指一方率先获得五个击杀数。'},
        ],
        },
      ],
    },
    {
      subtitle: '游戏玩法',
      items: [],
    },
    {
      subtitle: 'DOTA2',
      items: [
        {content: true, contentItems: [
          {subcontent: '选手游戏中担任的位置，指战队信息中的位置编号(如果实际存在位置调换，则以实际情况为准）。'},
          {subcontent: '辅助位获得一血：是指战队信息中的4和5号位置选手能否获得一血。'},
          {subcontent: '三分钟前是否获得一血：三分钟前是否发生第一次击杀（不包含03:00）。'},
          {subcontent: '首防御塔摧毁方: DOTA2中反补防御塔，算作反补方对面摧毁防御塔。'},
          {subcontent: '首杀肉山：根据官方网站结果或官方直播(录像demo）进行结算。'},
          {subcontent: 'DOTA2 赛中掉线：',
            subcontentItems: [
              {list: '情况A. 若一血产生前如发生掉线情况，但在游戏进行中重新连接成功，即官方认可的所有有效赛果，均将正常结算'},
              {list: '情况B. 若一血产生后如发生掉线情况，即官方认可的所有有效赛果，均将正常结算'},
              {list: '情况C. 一血产生前如发生某一方掉线并且无法重新连接成功，并且在接下来的游戏时间持续无法重连成功直至游戏结束，为保证游戏的公平公正原则，该场赛事注单无效。'},
            ],
          },
          {subcontent: '是否出现超级兵：单队六座兵营都被摧毁则计算为“是”。'},
          {subcontent: '获得第N次几杀队伍：是指哪一方刚好获得第N次的击杀，而非率先获得N杀。',
            subcontentItems: [
              {list: '例如：获得第二十次击杀队伍，是指哪一方获得第二十次的击杀。'},
            ],
          },
          {subcontent: '八分钟前是否发生五杀：8分钟前是否有队伍累计五次击杀。'},
        ],
        },
      ],
    },
    {
      subtitle: '英雄联盟',
      items: [
        {content: true, contentItems: [
          {subcontent: '选手在游戏中所处位置（上路/中路/打野/辅助/ADC）以官方公布的早盘对阵图为准。'},
          {subcontent: '峡谷先锋：只计算击杀，只要是此队伍击杀就为胜利。'},
          {subcontent: '总推塔数单双：以比赛结束完场计分板为准，两支队伍总推塔总数（包括门牙塔），水晶兵营和大水晶（基地）不算在内。'},
          {subcontent: '所有小龙盘口结算定义：只计算元素亚龙，不计算远古巨龙。'},
          {subcontent: '击杀首条纳什男爵BUFF增益人数：如果未出现击杀纳什男爵，则该玩法的投注将被退还本金。'},
          {subcontent: '摧毁重生的水晶不会被计算在摧毁数内。'},
          {subcontent: '基地摧毁时选手存活数：以摧毁主基地水晶瞬间的存活人数为准。（爆炸发生时/发生后的复活人数不做计算）。'},
          {subcontent: '十分钟前杀敌总数大小：指10分钟前累计杀敌总数。刚好10分钟的不列入计算。'},
          {subcontent: '第一滴血盘口：比赛中率先击杀对方为胜方。以计分板为准。'},
          {subcontent: '所有基于时间的盘口, 结算注单是根据游戏进度时间来结算的, 赛事结果根据官方网站的分数和赛后统计面板、官方直播(录像demo）进行结算。'},
          {subcontent: '竞猜第N条元素龙属性：崖壁上会显示下一条元素龙的属性，只要预告了就是代表已经有结果了。根据官方网站结果或官方直播(录像demo）进行结算。'},
          {subcontent: '总杀大/小 (00:00-10:00 分钟，规定时间段内) 盘口：有效注单为所规定的时间内，比赛时间如果没有超过规定时间例如10:00分钟，0到10分钟这个时间区域就算无效的。根据游戏内的计时器，赛事结果根据官方网站的分数或官方直播(录像demo）进行结算。'},
          {subcontent: '是否出现大龙被抢到盘口：如该场赛事未有大龙被击杀，根据双方队伍0:0 结果为“否”结算，赛事结果根据官方网站的分数和赛后统计面板、官方直播 (录像demo）进行结算。'},
          {subcontent: '总杀尾数大小盘口：总杀双方尾数相加与盘口开出的数值比较大小。例如赛果为9:12（总杀双方尾数相加9+2 =11）。赛事结果根据官方网站的分数和赛后统计面板，API或官方直播 (录像demo）进行结算。'},
          {subcontent: '三杀Triple Kill：连续击杀3名敌方英雄后显示。'},
          {subcontent: '四杀 Quadra KILL：连续击杀4名敌方英雄后显示。'},
          {subcontent: '是否出现团灭：单队伍全员死亡或游戏内出现团灭提示均计算为团灭。'},
        ],
        },
      ],
    },
    {
      subtitle: '王者荣耀',
      items: [
        {content: true, contentItems: [
          {subcontent: '防御塔摧毁盘口：王者荣耀比赛中首防御塔摧毁方必须对方先摧毁的防御塔才计算以内。',
            subcontentItems: [
              {list: '注：水晶基地不计算在内。'},
            ],
          },
          {subcontent: '第一血盘口  ：王者荣耀比赛中率先击杀对方为胜方。（以积分面板为准）'},
          {subcontent: '两分钟前是否发生第一滴血：以视频中实际击杀时间为准'},
          {subcontent: '分30秒前是否击杀首条暴君，2分30秒前是否击杀首条暴君（02:30则算否）'},
          {subcontent: '2分30秒前是否击杀首条暴君，2分30秒前是否击杀首条暴君（02:30则算否）'},
          {subcontent: '选手在游戏中所处位置（游走，中路，打野，对抗路，发育路）是以官方公布的赛后对阵图为最终结算依据。'},
          {subcontent: '击杀主宰总数单双：所有主宰都计算在内，包括先知主宰及暗影主宰。'},
          {subcontent: '击杀暴君总数单双：所有暴君都计算在内，包括暴君及暗影暴君。'},
        ],
        },
      ],
    },
    {
      subtitle: 'CSGO/CS2',
      items: [
        {content: true, contentItems: [
          {subcontent: '第一手枪局获胜：赢取第一回合手枪局的队伍。'},
          {subcontent: '率先获得5/10回合胜者：最先赢取5/10个回合的队伍。'},
          {subcontent: '单双类盘口，赛果计算为“0”时，算作双数。'},
          {subcontent: '/CS2回合定义：新的回合进入购买倒计时时，上一回合才算结束。'},
          {subcontent: '第N回合爆头总数大小：只有出现爆头图标/提示的才算爆头击杀，该回合内任何状况时间段所产生的爆头都计算在内。'},
          {subcontent: '首杀：必须是击杀对方选手,如果是自杀或者队友击杀，则判定该回合不存在首杀，相关投注退还本金。'},
          {subcontent: '首被杀：单回合首个被杀队员，任何死亡方式都被计算在内。'},
          {subcontent: '手枪局总杀大/小：根据官方网站的分数或官方直播(录像demo）进行结算。'},
          {subcontent: '击杀盘口：根据官方网站的分数或官方直播(录像demo）进行结算。'},
          {subcontent: '上半场获胜/下半场获胜：',
            subcontentItems: [
              {list: '在CSGO/CS2比赛中上半场（第1回合至第15回合）/下半场（第16回合至第30回合，若平局则退款）获得比分较高的队伍赢得本注，每个半场单独计算。'},
              {list: '在CS2比赛中上半场（第1回合至第12回合，若平局则退款）/下半场（第13回合至第24回合，若平局则退款），获得比分较高的队伍赢得本注，每个半场单独计算。'},
            ]},
          {subcontent: '手枪局和第N回合爆头总数 大/小：根据官方网站结果，官方直播(录像demo）进行结算。注：被自己的团队成员爆头杀死都被视为爆头总数。'},
          {subcontent: '手枪局和第N回合总杀大/小：根据官方网站结果，官方直播(录像demo）进行结算。 注：被炸弹炸死，不计算在总杀内。'},
          {subcontent: '第N回合胜利方式：胜利方式为四种，分别是时间耗尽/炸弹爆炸/拆除炸弹/全歼对方，该玩法的判断方式是该回合以哪种方式获胜'},
          {subcontent: '是否出现刀杀：刀战选边和热身期间均不计算为有效，如果被友军刀杀，也将计算为“是”。'},
          {subcontent: '是否出现手雷击杀：选边和热身期间均不计算为有效，只计算“手雷”击杀。“燃烧弹”及其他投掷物均不计算，如果被友军手雷击杀，也将计算为“是”。'},
          {subcontent: '上半场获胜者/地图获胜者：该盘口选项必须同时满足上半场获胜及地图获胜的条件才视为中奖。'},
          {subcontent: '获得最多助攻的选手：在 CSGO/CS2比赛中，所有类型敌方击杀助攻都将计算在选手助攻内。注：闪光弹助攻不计算在内。'},
          {subcontent: '总翻盘(CLUTCHES)次数：官方参考计算方式：该回合对战人数下降到1对1，并在该回合内必须以共9个总杀才能被考虑为获得翻盘数，结算仅根据官方赛后结果显示“CLUTCHES翻盘"，结算仅根据官方结果面板显示为准。'},
          {subcontent: '是否有选手单回合获得三杀（第N至第N+1回合）：在第N至N+1回合中，出现单选手单回合击杀3人或者3人以上（包含击杀队友），视为赢得注单。若未进行到第N至N+1回合则注单视为无效。'},
          {subcontent: '指定地图玩法，若选图不为指定的地图时，则视为无赛果，投注取消返还本金。'},
          {subcontent: '选手玩法只计算单选手数据，例：哪位选手获得较高击杀数：A=30 B=25，则包含选手A的选项获胜；若为多个选手则包含相应数据最高选手的选项获胜，例；哪位选手获得较高助攻数：A=3/BC=6/D=1，最高为C，则包含选手C的选项C/D获胜。（平局退款）'},
          {subcontent: '正确回合比分（不含加时）：',
            subcontentItems: [
              {list: '若选项为单向比分，则任意队伍取得对应分数胜利都为赢，'},
              {list: '例如在CSGO/CS2比赛中：16:9，A队=9 B队=16 选项16:9为赢，A队=16 B队=9 选项16:9也为赢；'},
              {list: '在CS2比赛中：13:5，A队=5 B队=13 选项13:5为赢，A队=13 B队=5 选项13:5也为赢'},
              {list: '若选项为双向比分，则需对应队伍获得相应分数胜利才为赢，'},
              {list: '例如在CSGO/CS2比赛中：16:11 11:16，A队=16 B队=11 则选项16:11为赢，A队=11 B队=16 则选项11:16为赢。（若进入加时则15:15为赢）；'},
              {list: '在CS2比赛中：13:7 7:13，A队=13 B队=7 则选项13:7为赢，A队=7B队=13 则选项7:13为赢。（若进入加时则12:12为赢）'},
            ]},
          {subcontent: ' 第二手枪局获胜：在CSGO/CS2比赛中，是指赢取第十六回合手枪局的队伍。在CS2比赛中，是指赢取第十三回合手枪局的队伍。'},
        ],
        },
      ],
    },
  ],
};
